{"comment_id":{"0":"hiojvt5","1":"hip39ci","2":"hipfabq","3":"hip0tu1","4":"hip97vd","5":"hip2ecs","6":"hion5z0","7":"hir97dl","8":"hipl13f","9":"hionh7w","10":"hiow1te","11":"hiphc5n","12":"hiqn7tx","13":"hiroyod","14":"hip5ryr","15":"hipwgxd","16":"hiq622k","17":"hirlubm","18":"hip3gzr","19":"hioro9h","20":"hiqtbbk","21":"hiprsxj","22":"hipd0o8","23":"hirb6ry","24":"hiovt5e","25":"hipqskb","26":"hiop78v","27":"hiopw8w","28":"hioofb5","29":"hip8t1h","30":"hip6mht","31":"hireo4t","32":"hip5t4a","33":"hioweej","34":"hir9kch","35":"hirdpcv","36":"hipuja6","37":"hirar8e","38":"hisacpv","39":"hiorwci","40":"hiovyk8","41":"hisdax1","42":"hiowmrf","43":"hiqflgg","44":"hirarjd","45":"hirgcc8","46":"hirp6wn","47":"hiosfla","48":"hiovud6","49":"hiow8jl","50":"hisf41k","51":"hipfu6j","52":"his8pwd","53":"hirjbqd","54":"hirxfkx","55":"hiotchl","56":"hip1fth","57":"hisg5mb","58":"hipifwf","59":"hisa98g","60":"hisp5tp","61":"hiozsnx","62":"hiov0ga","63":"hiprc48","64":"hipjl2q","65":"hispr2c","66":"hip1cpu","67":"hipjoux","68":"hit4mks","69":"hipcdkf","70":"hipkua1","71":"hivst00","72":"hipl2kc","73":"hipl5d7","74":"hipljzh","75":"hiplpdn","76":"hipmjx2","77":"hipmndb","78":"hipmqk4"},"comment_parent_id":{"0":"t3_qj8sr6","1":"t3_qj8sr6","2":"t3_qj8sr6","3":"t3_qj8sr6","4":"t3_qj8sr6","5":"t3_qj8sr6","6":"t3_qj8sr6","7":"t3_qj8sr6","8":"t3_qj8sr6","9":"t3_qj8sr6","10":"t3_qj8sr6","11":"t3_qj8sr6","12":"t3_qj8sr6","13":"t3_qj8sr6","14":"t3_qj8sr6","15":"t3_qj8sr6","16":"t3_qj8sr6","17":"t3_qj8sr6","18":"t1_hiojvt5","19":"t1_hiojvt5","20":"t1_hip39ci","21":"t1_hip97vd","22":"t1_hip2ecs","23":"t1_hir97dl","24":"t1_hionh7w","25":"t1_hionh7w","26":"t1_hionh7w","27":"t1_hionh7w","28":"t1_hionh7w","29":"t1_hionh7w","30":"t1_hiow1te","31":"t1_hiow1te","32":"t1_hip3gzr","33":"t1_hioro9h","34":"t1_hiqtbbk","35":"t1_hiqtbbk","36":"t1_hiprsxj","37":"t1_hipd0o8","38":"t1_hirb6ry","39":"t1_hiop78v","40":"t1_hioofb5","41":"t1_hip5t4a","42":"t1_hioweej","43":"t1_hioweej","44":"t1_hir9kch","45":"t1_hirdpcv","46":"t1_hirar8e","47":"t1_hiorwci","48":"t1_hiorwci","49":"t1_hiovyk8","50":"t1_hisdax1","51":"t1_hiowmrf","52":"t1_hirarjd","53":"t1_hirgcc8","54":"t1_hirp6wn","55":"t1_hiosfla","56":"t1_hiovud6","57":"t1_hisf41k","58":"t1_hipfu6j","59":"t1_his8pwd","60":"t1_hirxfkx","61":"t1_hiotchl","62":"t1_hiotchl","63":"t1_hip1fth","64":"t1_hipifwf","65":"t1_hisp5tp","66":"t1_hiozsnx","67":"t1_hipjl2q","68":"t1_hispr2c","69":"t1_hip1cpu","70":"t1_hipjoux","71":"t1_hit4mks","72":"t1_hipkua1","73":"t1_hipl2kc","74":"t1_hipl5d7","75":"t1_hipljzh","76":"t1_hiplpdn","77":"t1_hipmjx2","78":"t1_hipmndb"},"comment_created_utc":{"0":1635623645.0,"1":1635632428.0,"2":1635638358.0,"3":1635631286.0,"4":1635635312.0,"5":1635632021.0,"6":1635625103.0,"7":1635682982.0,"8":1635641249.0,"9":1635625244.0,"10":1635629090.0,"11":1635639409.0,"12":1635665162.0,"13":1635691635.0,"14":1635633624.0,"15":1635647071.0,"16":1635652393.0,"17":1635690150.0,"18":1635632526.0,"19":1635627123.0,"20":1635670333.0,"21":1635644638.0,"22":1635637205.0,"23":1635684289.0,"24":1635628980.0,"25":1635644126.0,"26":1635626029.0,"27":1635626342.0,"28":1635625675.0,"29":1635635108.0,"30":1635634033.0,"31":1635686389.0,"32":1635633640.0,"33":1635629250.0,"34":1635683229.0,"35":1635685826.0,"36":1635646049.0,"37":1635684017.0,"38":1635700962.0,"39":1635627222.0,"40":1635629048.0,"41":1635702248.0,"42":1635629357.0,"43":1635658897.0,"44":1635684022.0,"45":1635687344.0,"46":1635691738.0,"47":1635627462.0,"48":1635628996.0,"49":1635629175.0,"50":1635703020.0,"51":1635638639.0,"52":1635700283.0,"53":1635688912.0,"54":1635695408.0,"55":1635627879.0,"56":1635631569.0,"57":1635703457.0,"58":1635639961.0,"59":1635700922.0,"60":1635707189.0,"61":1635630804.0,"62":1635628626.0,"63":1635644403.0,"64":1635640527.0,"65":1635707431.0,"66":1635631531.0,"67":1635640578.0,"68":1635713675.0,"69":1635636885.0,"70":1635641155.0,"71":1635774315.0,"72":1635641270.0,"73":1635641310.0,"74":1635641508.0,"75":1635641584.0,"76":1635642013.0,"77":1635642062.0,"78":1635642107.0},"comment_body":{"0":"<div class=\"md\"><p>The real idiot part here:<\/p>\n\n<blockquote>\n<p>EVs that have to run on coal power would do nothing for the climate<\/p>\n<\/blockquote>\n\n<p><a href=\"https:\/\/nitter.net\/alex_avoigt\/status\/1454379007449894914#m\">https:\/\/nitter.net\/alex_avoigt\/status\/1454379007449894914#m<\/a><\/p>\n\n<p>How many times has this already been disproven?<\/p>\n<\/div>","1":"<div class=\"md\"><p>no wonder their stock is in the shitter.<\/p>\n<\/div>","2":"<div class=\"md\"><p>Government policy will tell him otherwise.<\/p>\n<\/div>","3":"<div class=\"md\"><p>I bet he drives like he owns a BMW…<\/p>\n<\/div>","4":"<div class=\"md\"><p>Their EVs seem to be better than I expected.<\/p>\n<\/div>","5":"<div class=\"md\"><p>What he is guaranteeing with this attitude is that no one will be driving a BMW in 10-20 years tops.<\/p>\n<\/div>","6":"<div class=\"md\"><p>Screw this guy.<\/p>\n<\/div>","7":"<div class=\"md\"><p>BMW will be out of business by 2030<\/p>\n<\/div>","8":"<div class=\"md\"><p>He’s Delusional !<\/p>\n<\/div>","9":"<div class=\"md\"><p>Comes from a Tesla cult member with no source. Delete this bullshit post.<\/p>\n<\/div>","10":"<div class=\"md\"><p>It&#39;s a self fulfilling prophecy. If big OEMs like BMW and Toyota assert that the hope isn&#39;t there, then yes there&#39;s a strong chance the EV transition won&#39;t be achieved even mostly if not fully. But if they jumped aboard then yes the transition could be achieved. At least Toyota and BMW are becoming more the minority of OEM CEOs who are resistant to the EV transition.<\/p>\n\n<p>Hopefully the iX, i4, and later successors knock it out of the park so Zipse has no choice but to prioritize EVs going forward.<\/p>\n<\/div>","11":"<div class=\"md\"><p>Climate change deniers will not look for solutions.  The world is making great strides to move to clean energy and there will become a point where clean energy will be more cost effective and abundant that the older methods of creating electrical power.   The modern EV transition is relatively new and there will be some major advancements in the near future such as solid state which offers longer range, lower weight and extended life which will make EVs even more appealing to the masses.  Combine better EVs with cheaper electricity and only historians will have ICE cars to show future generations how evolution in technologies looks.  These are my thoughts.<\/p>\n<\/div>","12":"<div class=\"md\"><p>Are BMW execs like BMW drivers?<\/p>\n<\/div>","13":"<div class=\"md\"><p>The most troubling part of all this is knowing that people like him make it to be CEOs.  Psychopaths run companies, run our economies, and make the decisions that negatively affect average people.<\/p>\n<\/div>","14":"<div class=\"md\"><p>I mean they cant produce gas cars after like 2035 in some places so yeah most people will go electric or be driving older gas cars<\/p>\n<\/div>","15":"<div class=\"md\"><p>Y&#39;all remember when a higherup at Audi said that 200 miles of range is just enough for everyone and that they will go no further? Yeah <a href=\"https:\/\/www.cnet.com\/roadshow\/news\/audi-e-tron-gt-tesla-ev-range-markus-duesmann\/\">that was a thing<\/a><\/p>\n<\/div>","16":"<div class=\"md\"><p>So BMW are in trouble on the software and he wants all the auto manufacturers to share the operating system because there&#39;s no differentiation in that.<\/p>\n\n<p>Not a chance of a snowball in Hell.  He&#39;s going to have to hire some software engineers and pay them extravagant amounts of money and he had better hurry before all the really good ones are working for one of his competitors.<\/p>\n<\/div>","17":"<div class=\"md\"><p>It&#39;s going to be funny when VW acquires BMW for pocket money in 2025<\/p>\n<\/div>","18":"<div class=\"md\"><p>Every time this comes up, I reference this video: <a href=\"https:\/\/www.youtube.com\/watch?v=6RhtiPefVzM&amp;t=303s\">https:\/\/www.youtube.com\/watch?v=6RhtiPefVzM&amp;t=303s<\/a><\/p>\n\n<p>It&#39;s a solid analysis and haven&#39;t found much to refute it.<\/p>\n\n<p>Bottom line is that the average pollution break-even between the average EV and the average ICE car is under 2 years, meaning that at less than 2 years of ownership, the average EV becomes less polluting than the average ICE car. This takes into account the environmental impact of manufacturing batteries and all other components. <\/p>\n\n<p>The interesting part was how that shifts in the worst case scenarios. They took the Model S, which is at the time had the highest environmental impact because it had the largest battery, and calculated the pollution from the dirtiest power source, which would be coal-heavy West Virginia. That shifted the break even as far out as 17 years, so if you&#39;re electricity comes from really bad sources and you have a huge battery, that is the only scenario where he may have a point, but it&#39;s a very niche case. <\/p>\n\n<p>As coal becomes less and less cost effective and more plants go offline, this entire line of thinking becomes moot.<\/p>\n<\/div>","19":"<div class=\"md\"><p>It is true that EVs powered by electricity produced from coal only get 25mpge versus 58mgpe for natural gas. But coal electricity production has been falling in the US.<\/p>\n<\/div>","20":"<div class=\"md\"><p>Stocks are just a scam anyways. Tesla is just a complete meme stock fueled by idiot people who buy it because Elon Musk. Sales is what really matters.<\/p>\n<\/div>","21":"<div class=\"md\"><p>Their EVs are good and efficient with good range. <\/p>\n\n<p>Problem is they don&#39;t want to let go of traditional ICE business. When the technology shifts happening if you are not ready cannibalize your own products you will not survive. <\/p>\n\n<p>They are developing many BEV models but very limited production. There are no plans to increase production drastically in the near future. Even by 2030, they expect ICEs to make up majority of their sales. Good luck with that.<\/p>\n<\/div>","22":"<div class=\"md\"><p>Their attitude is great actually. Their goal is to make the most sustainable EVs in terms of production emissions. The plant where the iX and the i4 are made runs on 100% hydro. They are using EESM electric motors instead of PMS so no rare earths. Recycled aluminium, recycled floor mats, recycled nickel (50%) in the iX and i4 battery. Just started using a new paint method that uses 70% less energy. Gave a deadline to suppliers requiring that they also have to use 100% renewable energy or they will be dropped as a supplier. Developing a lot of sustainable materials that are already in use in the iX. The main focus of the Neue Klasse platform is to lower production emissions. Just recently announced that the NK platform will use sustainably sourced steel from Swedish company that doesn&#39;t use fossil fuels. 95%  reduction of CO2 emissions compared to the normal process. And so on.<\/p>\n\n<p><a href=\"https:\/\/www.bmwblog.com\/2021\/10\/20\/bmw-neue-klasse-models-to-use-sustainably-sourced-steel\/\">https:\/\/www.bmwblog.com\/2021\/10\/20\/bmw-neue-klasse-models-to-use-sustainably-sourced-steel\/<\/a><\/p>\n\n<p><a href=\"https:\/\/www.bmwblog.com\/2021\/05\/12\/bmw-to-reduce-battery-carbon-footprint-by-more-than-half\/\">https:\/\/www.bmwblog.com\/2021\/05\/12\/bmw-to-reduce-battery-carbon-footprint-by-more-than-half\/<\/a><\/p>\n\n<p><a href=\"https:\/\/www.bmwblog.com\/2021\/09\/02\/bmws-neue-klasse-platform-will-focus-on-recycling\/\">https:\/\/www.bmwblog.com\/2021\/09\/02\/bmws-neue-klasse-platform-will-focus-on-recycling\/<\/a><\/p>\n\n<p><a href=\"https:\/\/www.bmw.com\/en\/innovation\/life-cycle-of-a-battery-cell.html\">https:\/\/www.bmw.com\/en\/innovation\/life-cycle-of-a-battery-cell.html<\/a><\/p>\n<\/div>","23":"<div class=\"md\"><p>Someone will buy them for the name, just like Volvo, Jaguar Land Rover, etc.<\/p>\n<\/div>","24":"<div class=\"md\"><p>lol ok Tesla hater<\/p>\n<\/div>","25":"<div class=\"md\"><p>Wtf are you talking about? Literally nothing here was sensationalized.<\/p>\n<\/div>","26":"<div class=\"md\"><p><a href=\"https:\/\/www.spiegel.de\/wirtschaft\/bmw-chef-oliver-zipse-von-einem-verbrenner-verbot-halte-ich-nichts-a-39fb1199-77f2-449b-990d-4d12cb93f6aa\">https:\/\/www.spiegel.de\/wirtschaft\/bmw-chef-oliver-zipse-von-einem-verbrenner-verbot-halte-ich-nichts-a-39fb1199-77f2-449b-990d-4d12cb93f6aa<\/a><\/p>\n<\/div>","27":"<div class=\"md\"><p>Cry more<\/p>\n<\/div>","28":"<div class=\"md\"><p>Nah, it fits a narrative so it&#39;s got legs.<\/p>\n<\/div>","29":"<div class=\"md\"><p>Why so delusional?<\/p>\n<\/div>","30":"<div class=\"md\"><p>I think the OEMs have lost the initiative. VW are fully committed. Governments of polluted cities know it’s the only way to prevent citizens rioting. My first BMW was amazing, my second as terrible, my Tesla is far better than either of them. I’m not surprised Tesla is strongly outselling BMW 3 series.<\/p>\n<\/div>","31":"<div class=\"md\"><p>BMW isn&#39;t that big<\/p>\n<\/div>","32":"<div class=\"md\"><p>That’s a great video - and Jason made a more recent one expanding on the question “Is Keeping Your Old Car Better For The Environment?”<\/p>\n\n<p><a href=\"https:\/\/youtu.be\/L2IKCdnzl5k\">https:\/\/youtu.be\/L2IKCdnzl5k<\/a><\/p>\n<\/div>","33":"<div class=\"md\"><p>Those numbers don&#39;t make sense. Is that comparing emissions? MPGe is based on just energy.<\/p>\n<\/div>","34":"<div class=\"md\"><p>If you&#39;re evaluating stocks based on sales trends, Tesla is the clear choice<\/p>\n<\/div>","35":"<div class=\"md\"><p>Stocks are being purchased more and more by people who are investing in the long future individuals investing their own money, their own way. Less of the pot is owned by firms shooting for quarterly results.  People are investing in ideas. Firms dont. The whole stock market climate shifted drastically with online investing platforms and old ways of thinking have to change. Were you also surprised to see the taxi industry collapse?<\/p>\n<\/div>","36":"<div class=\"md\"><p>And there are plenty of people still lining up to buy them.  No need to leave money on the table.  You&#39;ll have to pry the V8 from my wife.<\/p>\n<\/div>","37":"<div class=\"md\"><p>Let me prove to you why that&#39;s stupid.<\/p>\n\n<p>The average EV today is built without all that fancy tech from BMW and in terms of pollution, including from production, they break even in ~2 years.<\/p>\n\n<p>That means a delay of more than 1 year, max 2 years, causes more pollution than what these fancy methods save.<\/p>\n\n<p>Since BMW has delayed producing EVs for more than 2 years they are actually causing more pollution as they keep selling ICE cars instead of EVs (since market share and production are relatively constant it&#39;s close to 1:1).<\/p>\n\n<p>BMW keeps lying to you because their goal isn&#39;t &quot;sustainable EVs&quot; but to delay transitioning to EVs as much as possible.<\/p>\n<\/div>","38":"<div class=\"md\"><p>It won&#39;t be BMW any more then. Obviously I mean the ongoing business entity known currently as BMW. They won&#39;t successfully transition and they won&#39;t succeed doing BAU.<\/p>\n<\/div>","39":"<div class=\"md\"><p>Okay so it&#39;s real. Still don&#39;t see the outrage. Maybe in 200-300 years every single person on the planet will drive BEV. But for the next 100 years that is completely unrealistic. These Tesla cult members just look for anything to talk crap on other car companies.<\/p>\n<\/div>","40":"<div class=\"md\"><p>i4 preorder? BMW thanks you for giving them more money for their anti-EV lobbying efforts!<\/p>\n<\/div>","41":"<div class=\"md\"><p>Without having to watch, was the conclusion it’s better to keep your old gas vehicle longer or make the switch to electric sooner?<\/p>\n<\/div>","42":"<div class=\"md\"><p>Yes, coal emits about 40% more CO2 per btu than gasoline. Natural gas emits ~35% <strong>less<\/strong> CO2 per btu than gasoline. In other words, coal emits almost twice as much CO2 as natural gas per unit of energy. You cut CO2 emissions almost in half just by converting a coal power plant to natural gas.<\/p>\n<\/div>","43":"<div class=\"md\"><p>I wish we could entirely stop using MPGe as a unit. It&#39;s next to worthless. Doesn&#39;t compare cost or carbon, the two things that people actually care about. You can use it to compare between EVs, but at that point, use Wh\/distance or similar.<\/p>\n<\/div>","44":"<div class=\"md\"><p>Tesla is a bubble, that&#39;s what it is.<\/p>\n<\/div>","45":"<div class=\"md\"><p>People invest in dumb shit because they are dumb. There&#39;s absolutely no sense in Tesla gaining $175B in capital because another dumb company that went almost went bankrupt bought 100K of their cars. So tell me why 100K sales are enough to gain over 3 times BMWs Worth. You can&#39;t, because it&#39;s just ridiculous.<\/p>\n<\/div>","46":"<div class=\"md\"><blockquote>\n<p>Since BMW has delayed producing EVs for more than 2 years<\/p>\n<\/blockquote>\n\n<p>Source?<\/p>\n\n<p>And developing the new NK platform doesn&#39;t mean that they will not release a lot of models before that.<\/p>\n\n<p>iX3, i4, iX, iX1, i3 (electric 3 Series), i7, i5, 2 new electric Minis and so on.<\/p>\n\n<p>13 EV models by 2023: <a href=\"https:\/\/electricvehicleweb.com\/wp-content\/uploads\/2021\/05\/BMW-Group-EV-roadmap-May-2021.jpg\">https:\/\/electricvehicleweb.com\/wp-content\/uploads\/2021\/05\/BMW-Group-EV-roadmap-May-2021.jpg<\/a><\/p>\n<\/div>","47":"<div class=\"md\"><blockquote>\n<p>Maybe in 200-300 years every single person on the planet will drive BEV. But for the next 100 years that is completely unrealistic. <\/p>\n<\/blockquote>\n\n<p>wonder why you&#39;re on this subreddit then<\/p>\n<\/div>","48":"<div class=\"md\"><p>Nice try Tesla\/BEV FUDster.<\/p>\n<\/div>","49":"<div class=\"md\"><p>Yawn.  Does it get tiring spending your day poorly shitting on all things not Tesla?  At least other posters get a little more creative.<\/p>\n<\/div>","50":"<div class=\"md\"><p>The answer is in an absolute sense &quot;yes&quot; it&#39;s most often better to switch to EV, but the point of breakeven is different depending on how many miles a year one drives and the fuel economy of the ICE car being replaced. I queued up the video to a chart showing the breakeven point for fuel economy. (Jason used a fixed annual mileage for the comparison)<\/p>\n\n<p><a href=\"https:\/\/youtu.be\/L2IKCdnzl5k?t=505\">https:\/\/youtu.be\/L2IKCdnzl5k?t=505<\/a><\/p>\n<\/div>","51":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","52":"<div class=\"md\"><p>Subjectively, everything feels overvalued right now, but if you actually look at the stock, Tesla is &quot;equally overvalued&quot; to other companies going promising things.  At the end of the day, Tesla is dominating an emerging market.  Will that continue? Maybe.  Will they get leapfrogged by the likes of GM or Ford like the skeptics say? Doesn&#39;t look like it.<\/p>\n<\/div>","53":"<div class=\"md\"><p>Some people are investing in an idea. Others believe tesla is the way of the future and will dominate the industry indefinitely. Some are investing in elon himself. Others see an inflated stock to make quick money on. All are reasonable reasons to buy a stock. The whole idea of a stock market, art, and currency is &quot;dumb&quot; it&#39;s all created, regulated, controlled, influenced by humans who are by design emotional creatures. I think it&#39;s hilarious, that the most capitalist of capitalist people (investment bankers, advisors, brokers, firms) are crying about the system that they created and manipulated for centuries. All of a sudden &quot;people arent playing by the arbitrary rules that they unofficially put in place to ensure they always came out on top&quot; and NOW they want government interference? NOW they want MORE government regulation? Tesla being so heavily overvalued shows us several things are changing. People give a shit about the environment and future of others. People are fucking sick of big banks telling them how they have to live their lives.<\/p>\n<\/div>","54":"<div class=\"md\"><p>BMW invested heavily in the i platform a decade ago and then simply fired the entire team and only sold enough EVs to meet quotas.<\/p>\n\n<p>Just compare VW, Kia, Hyundai, etc to BMW.<\/p>\n<\/div>","55":"<div class=\"md\"><p>Because I like EVs, doesn&#39;t mean I need to live in this fairy tale fantasy that literally everyone person on the planet is gonna drive a BEV within 100 years.<\/p>\n<\/div>","56":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","57":"<div class=\"md\"><p>Awesome, thanks for taking the time to link to the heart of the data!<\/p>\n\n<p>Makes great sense.. often people argue the 50mpg gas vehicle against electrification, which seems to hold.. but not many people have that good of mpg. <\/p>\n\n<p>Trucks are going to be a huge transition! My business work truck gets about 15mpg. Can’t wait to electrify and decrease all that emissions.<\/p>\n\n<p>We also went from a Dodge Grand Caravan that got about 19mpg to a Nissan Leaf. The Leaf is awesome, but we would love something bigger.. just nobody makes anything, non-luxury.<\/p>\n<\/div>","58":"<div class=\"md\"><p>Google is your friend if you’re really curious. I’m also not sure why it is controversial to state that coal is a really dirty fossil fuel?<\/p>\n<\/div>","59":"<div class=\"md\"><p>You must be kidding yourself if you think other car companies are equally overvalued. Tesla is a bubble that&#39;s going to burst in a few years. There&#39;s absolutely no sense to adding 175 billion dollars from a 100k car sales.<\/p>\n<\/div>","60":"<div class=\"md\"><p>All of them are selling enough EVs to meet quotas. Just look at EU targets. Non of them are overperforming. 2023 is the year when profit margins will be similar between ICE and EVs for premium vehicles according to Audi and that&#39;s when we will see premium carmakers overperforming the targets.<\/p>\n<\/div>","61":"<div class=\"md\"><p>Of course it&#39;s gonna happen with a 100 years, what kind of timescale is this??<\/p>\n\n<p>It&#39;s gonna happen much sooner than that.<\/p>\n<\/div>","62":"<div class=\"md\"><p>ok yes we totally believe you and will accept your explanation at face value<\/p>\n<\/div>","63":"<div class=\"md\"><p>Lol imagine actually being this clown<\/p>\n<\/div>","64":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","65":"<div class=\"md\"><p>You posted an image.<\/p>\n\n<p>Take a look at the 10-year gap between models and then take a look at everyone else.<\/p>\n\n<p>Just because everyone tries to meet quotas doesn&#39;t mean everyone&#39;s the same.<\/p>\n\n<p>In any case, this isn&#39;t about other manufacturers but your stupid claim that BMW isn&#39;t building EVs because they are &quot;researching the technology to build them with less pollution&quot;.<\/p>\n\n<p>If they wanted less pollution they wouldn&#39;t have fired there entire team behind the i3 and then wait 10 years to start again.<\/p>\n<\/div>","66":"<div class=\"md\"><p>You really actually think every person in the world will drive BEV? not a single person in Africa, Asia, south america with ICE, lol.<\/p>\n<\/div>","67":"<div class=\"md\"><p>Engineering Explained did a video about it. He said EVs are cleaner…as long as they aren’t charged with power produced from coal.<\/p>\n<\/div>","68":"<div class=\"md\"><p>I am not talking about overall pollution just that their current cars and future cars put a lot of focus on production emissions. So if you want to buy a car now BMW is a decent choice. And it&#39;s 8 years since the i3 was released. The i division team left mostly in 2015. It&#39;s just BMW now, the i division is no longer a thing and performance EVs will be under the M division. Their current cars were made with NCM 811 battery chemistry in mind (lower costs) and production for that chemistry only started in mid 2020 in China. The i4 prototype was first spied testing in 2018. In late 2020 CATL had problems with NCM 811 battery fires and had to fix the problem so a good thing that BMW waited.<\/p>\n\n<p><a href=\"https:\/\/pushevs.com\/2020\/09\/28\/catl-ncm-811-battery-cells-are-problematic\/\">https:\/\/pushevs.com\/2020\/09\/28\/catl-ncm-811-battery-cells-are-problematic\/<\/a><\/p>\n\n<p>But the reason why the i4 is coming out now is because they waited for the end of life of the old 4 Series Gran Coupe (7 years). Couldn&#39;t produce the old F36 4 Series and make the i4 at the same factory on the same production line. That doesn&#39;t make sense.<\/p>\n\n<p>The i7 is coming out in 2022 because the current 7 Series is reaching end of life.<\/p>\n<\/div>","69":"<div class=\"md\"><p>It will be slower for those regions, definitely, but it won&#39;t take a 100 years for Asia or South America to transition.<\/p>\n\n<p>Do you know how long is a century?? I invite you to think of the world as it was a 100 years ago.<\/p>\n<\/div>","70":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","71":"<div class=\"md\"><p>And how that&#39;s relevant?<\/p>\n\n<p>You claimed something entirely different.<\/p>\n<\/div>","72":"<div class=\"md\"><p>From the article you linked. There are states like West Virginia that still get a large percentage of their power from coal.<\/p>\n\n<p>”Under current conditions, driving an electric car is better for the climate than conventional petrol cars in 95% of the world, the study finds.<\/p>\n\n<p><strong>The only exceptions are countries such as Poland, where the electricity network is still mostly based on coal-fired power generation.<\/strong>”<\/p>\n<\/div>","73":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","74":"<div class=\"md\"><p>What do you mean? Current ICE cars already get better than 25mpg in mixed driving.<\/p>\n<\/div>","75":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","76":"<div class=\"md\"><p>See the table on page 7 of this report:<\/p>\n\n<p><a href=\"https:\/\/www.ucsusa.org\/sites\/default\/files\/attach\/2015\/11\/Cleaner-Cars-from-Cradle-to-Grave-full-report.pdf\">https:\/\/www.ucsusa.org\/sites\/default\/files\/attach\/2015\/11\/Cleaner-Cars-from-Cradle-to-Grave-full-report.pdf<\/a><\/p>\n<\/div>","77":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","78":"<div class=\"md\"><p>Your study proves my point that EVs charged with coal powered electricity are no better for the environment than ICE lol.<\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":0,"19":0,"20":0,"21":0,"22":0,"23":0,"24":0,"25":0,"26":0,"27":0,"28":0,"29":0,"30":0,"31":0,"32":0,"33":0,"34":0,"35":0,"36":0,"37":0,"38":0,"39":0,"40":0,"41":0,"42":0,"43":0,"44":0,"45":0,"46":0,"47":0,"48":0,"49":0,"50":0,"51":0,"52":0,"53":0,"54":0,"55":0,"56":0,"57":0,"58":0,"59":0,"60":0,"61":0,"62":0,"63":0,"64":0,"65":0,"66":0,"67":0,"68":0,"69":0,"70":0,"71":0,"72":0,"73":0,"74":0,"75":0,"76":0,"77":0,"78":0},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null,"77":null,"78":null},"comment_edited":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":1635638157.0,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":1635629607.0,"43":false,"44":false,"45":false,"46":1635692006.0,"47":false,"48":false,"49":false,"50":false,"51":1635704015.0,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":1635704010.0,"65":false,"66":false,"67":false,"68":1635714523.0,"69":false,"70":1635704007.0,"71":false,"72":false,"73":1635704004.0,"74":false,"75":1635704002.0,"76":false,"77":1635703999.0,"78":1635642559.0},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false},"comment_score":{"0":42,"1":9,"2":3,"3":10,"4":4,"5":3,"6":2,"7":1,"8":1,"9":-12,"10":0,"11":0,"12":0,"13":0,"14":1,"15":1,"16":1,"17":1,"18":13,"19":-2,"20":-6,"21":9,"22":10,"23":1,"24":8,"25":3,"26":9,"27":5,"28":3,"29":0,"30":8,"31":1,"32":5,"33":6,"34":2,"35":1,"36":0,"37":1,"38":0,"39":-16,"40":1,"41":1,"42":5,"43":3,"44":0,"45":-1,"46":1,"47":8,"48":4,"49":0,"50":3,"51":2,"52":0,"53":0,"54":0,"55":-2,"56":-1,"57":2,"58":-1,"59":3,"60":1,"61":3,"62":5,"63":3,"64":3,"65":0,"66":-3,"67":1,"68":1,"69":5,"70":1,"71":0,"72":0,"73":2,"74":0,"75":2,"76":1,"77":2,"78":1},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false},"author_id":{"0":"1azusvc6","1":"c5b8z","2":"82uqdz7r","3":"1xs4awb2","4":"5n04t","5":"pt0vni","6":"f2guy","7":"weo312b","8":"qghczi7","9":"jxooa","10":"66rgtnx6","11":"5ioc6t85","12":"c91f7","13":"davvizb0","14":"3w2i281l","15":"3us4b6y3","16":"yry4ma8","17":"ccr25d2d","18":"6h9g3","19":"haohz","20":"jxooa","21":"dsjwn","22":"b9a3c","23":"as01w2","24":"51gcy23v","25":"nyrmfz7","26":"1yk2g3cp","27":"6ghr85yf","28":"4af27","29":"5n04t","30":"ozk56ct","31":"14uiki59","32":"1uq5p2yg","33":"g5cxx","34":"weo312b","35":"51y8aqtw","36":"4af27","37":"as01w2","38":"weo312b","39":"jxooa","40":"51gcy23v","41":"jmkzn","42":"haohz","43":"b9ob3h","44":"jxooa","45":"jxooa","46":"b9a3c","47":"9c3i2","48":"51gcy23v","49":"4af27","50":"1uq5p2yg","51":"","52":"ttmvztv","53":"51y8aqtw","54":"as01w2","55":"jxooa","56":"","57":"jmkzn","58":"haohz","59":"jxooa","60":"b9a3c","61":"heis6","62":"9c3i2","63":"nyrmfz7","64":"","65":"as01w2","66":"jxooa","67":"haohz","68":"b9a3c","69":"heis6","70":"","71":"as01w2","72":"haohz","73":"","74":"haohz","75":"","76":"haohz","77":"","78":"haohz"},"author_name":{"0":"Kuchenblech_Mafioso","1":"silvrado","2":"CircleGravity","3":"RigusOctavian","4":"badcatdog","5":"fazalmajid","6":"RobDickinson","7":"darkstarman","8":"AggressiveDrive1692","9":"sjokosaus","10":"pithy_pun","11":"Foreign-Wasabi4810","12":"Oliver_Dibble","13":"Savantman","14":"timbodacious","15":"thecoolness229","16":"BEVboy","17":"FarioLimo","18":"Fandorin","19":"dbcooper4","20":"sjokosaus","21":"sri_fun","22":"reacTy","23":"izybit","24":"MindfulRoamer","25":"nightman008","26":"bfire123","27":"thebigsad_69420","28":"blazesquall","29":"badcatdog","30":"WoofyChip","31":"Murghchanay","32":"wirthmore","33":"feurie","34":"darkstarman","35":"nowoahgo","36":"blazesquall","37":"izybit","38":"darkstarman","39":"sjokosaus","40":"MindfulRoamer","41":"ChalupaCabre","42":"dbcooper4","43":"TwileD","44":"sjokosaus","45":"sjokosaus","46":"reacTy","47":"smartid","48":"MindfulRoamer","49":"blazesquall","50":"wirthmore","51":"","52":"NullPointerReference","53":"nowoahgo","54":"izybit","55":"sjokosaus","56":"","57":"ChalupaCabre","58":"dbcooper4","59":"sjokosaus","60":"reacTy","61":"Kayyam","62":"smartid","63":"nightman008","64":"","65":"izybit","66":"sjokosaus","67":"dbcooper4","68":"reacTy","69":"Kayyam","70":"","71":"izybit","72":"dbcooper4","73":"","74":"dbcooper4","75":"","76":"dbcooper4","77":"","78":"dbcooper4"}}