{"comment_id":{"0":"d96z6bg","1":"d97a7il","2":"d9797uq","3":"d9713n3","4":"d97joo5","5":"d96z7z9","6":"d9706dp","7":"d97auaq","8":"d97dgot","9":"d98nso9","10":"d99n347","11":"d9axwo2","12":"d97k10u","13":"d9gjwol","14":"d971gj7","15":"d972q44","16":"d974t69","17":"d979kfr","18":"d97byy5","19":"d97g028","20":"d97ihpu","21":"d97ktnh","22":"d97meh4","23":"d97sl3s","24":"d97ucwb","25":"d97w01m","26":"d97yrzf","27":"d9826kq","28":"d982jel","29":"d988fet","30":"d98cpe7","31":"d98e6zf","32":"d98gkud","33":"d98hiw1","34":"d98hs8n","35":"d98pz8u","36":"d98tjzl","37":"d98ylpy","38":"d9906ib","39":"d994ut3","40":"d995lbo","41":"d996o6j","42":"d998szg","43":"d99d7uw","44":"d99f7ya","45":"d99ka2d","46":"d99q6og","47":"d99qmoh","48":"d99qo8g","49":"d99ud3y","50":"d9a3i6k","51":"d9a76qm","52":"d9a9rt6","53":"d9aax2d","54":"d9agkr9","55":"d9aq0zx","56":"d9aruis","57":"d9ataxg","58":"d9avweo","59":"d9b3m0c","60":"d9b42bl","61":"d9bheiu","62":"d9bq71x","63":"d9bv1g9","64":"d9bw5rz","65":"d9cf09t","66":"d9cifpj","67":"d9cwgf1","68":"d9d3i4e","69":"d9dleb4","70":"d9dozs7","71":"d9dpols","72":"d9dwuzq","73":"d9e0ncn","74":"d9e48l1","75":"d9edewd","76":"d9efj2c","77":"d9en11b","78":"d9eto8o","79":"d9ewofu","80":"d9eztyw","81":"d9ff6tf","82":"d9fi51p","83":"d9g2u4l","84":"d9g5t2j","85":"d9g81uo","86":"d9g9yyk","87":"d9gc421","88":"d9gddas","89":"d9gq3gz","90":"d9bp3c6","91":"d973wz1","92":"d97e7ae","93":"d9f89uh","94":"d9d1x0s","95":"d9dfuum","96":"d971a2a","97":"d97g35g","98":"d99n05b","99":"d9e8diq"},"comment_parent_id":{"0":"t3_59av3f","1":"t3_59av3f","2":"t3_59av3f","3":"t3_59av3f","4":"t3_59av3f","5":"t3_59av3f","6":"t3_59av3f","7":"t3_59av3f","8":"t3_59av3f","9":"t3_59av3f","10":"t3_59av3f","11":"t3_59av3f","12":"t3_59av3f","13":"t3_59av3f","14":"t3_59av3f","15":"t3_59av3f","16":"t3_59av3f","17":"t3_59av3f","18":"t3_59av3f","19":"t3_59av3f","20":"t3_59av3f","21":"t3_59av3f","22":"t3_59av3f","23":"t3_59av3f","24":"t3_59av3f","25":"t3_59av3f","26":"t3_59av3f","27":"t3_59av3f","28":"t3_59av3f","29":"t3_59av3f","30":"t3_59av3f","31":"t3_59av3f","32":"t3_59av3f","33":"t3_59av3f","34":"t3_59av3f","35":"t3_59av3f","36":"t3_59av3f","37":"t3_59av3f","38":"t3_59av3f","39":"t3_59av3f","40":"t3_59av3f","41":"t3_59av3f","42":"t3_59av3f","43":"t3_59av3f","44":"t3_59av3f","45":"t3_59av3f","46":"t3_59av3f","47":"t3_59av3f","48":"t3_59av3f","49":"t3_59av3f","50":"t3_59av3f","51":"t3_59av3f","52":"t3_59av3f","53":"t3_59av3f","54":"t3_59av3f","55":"t3_59av3f","56":"t3_59av3f","57":"t3_59av3f","58":"t3_59av3f","59":"t3_59av3f","60":"t3_59av3f","61":"t3_59av3f","62":"t3_59av3f","63":"t3_59av3f","64":"t3_59av3f","65":"t3_59av3f","66":"t3_59av3f","67":"t3_59av3f","68":"t3_59av3f","69":"t3_59av3f","70":"t3_59av3f","71":"t3_59av3f","72":"t3_59av3f","73":"t3_59av3f","74":"t3_59av3f","75":"t3_59av3f","76":"t3_59av3f","77":"t3_59av3f","78":"t3_59av3f","79":"t3_59av3f","80":"t3_59av3f","81":"t3_59av3f","82":"t3_59av3f","83":"t3_59av3f","84":"t3_59av3f","85":"t3_59av3f","86":"t3_59av3f","87":"t3_59av3f","88":"t3_59av3f","89":"t3_59av3f","90":"t3_59av3f","91":"t3_59av3f","92":"t3_59av3f","93":"t3_59av3f","94":"t3_59av3f","95":"t3_59av3f","96":"t3_59av3f","97":"t3_59av3f","98":"t3_59av3f","99":"t3_59av3f"},"comment_created_utc":{"0":1477402091.0,"1":1477416635.0,"2":1477415442.0,"3":1477405040.0,"4":1477428130.0,"5":1477402166.0,"6":1477403678.0,"7":1477417393.0,"8":1477420551.0,"9":1477498764.0,"10":1477547093.0,"11":1477623587.0,"12":1477428547.0,"13":1477985619.0,"14":1477405542.0,"15":1477407279.0,"16":1477409960.0,"17":1477415868.0,"18":1477418749.0,"19":1477423735.0,"20":1477426705.0,"21":1477429532.0,"22":1477431617.0,"23":1477440349.0,"24":1477442716.0,"25":1477444913.0,"26":1477448765.0,"27":1477453761.0,"28":1477454341.0,"29":1477468347.0,"30":1477482309.0,"31":1477485576.0,"32":1477489573.0,"33":1477490962.0,"34":1477491315.0,"35":1477501284.0,"36":1477505475.0,"37":1477511505.0,"38":1477513359.0,"39":1477519122.0,"40":1477520106.0,"41":1477521600.0,"42":1477524638.0,"43":1477530863.0,"44":1477533731.0,"45":1477541440.0,"46":1477556193.0,"47":1477557729.0,"48":1477557882.0,"49":1477569607.0,"50":1477583473.0,"51":1477587947.0,"52":1477591025.0,"53":1477592393.0,"54":1477599203.0,"55":1477612188.0,"56":1477614848.0,"57":1477616994.0,"58":1477620663.0,"59":1477634160.0,"60":1477635299.0,"61":1477666947.0,"62":1477677603.0,"63":1477683349.0,"64":1477684763.0,"65":1477714781.0,"66":1477723534.0,"67":1477760087.0,"68":1477770707.0,"69":1477799996.0,"70":1477808096.0,"71":1477810111.0,"72":1477834947.0,"73":1477842030.0,"74":1477847453.0,"75":1477859171.0,"76":1477861851.0,"77":1477872070.0,"78":1477880849.0,"79":1477884943.0,"80":1477890552.0,"81":1477927453.0,"82":1477930744.0,"83":1477955122.0,"84":1477959438.0,"85":1477962573.0,"86":1477965231.0,"87":1477968352.0,"88":1477970269.0,"89":1478004846.0,"90":1477676337.0,"91":1477408828.0,"92":1477421443.0,"93":1477917326.0,"94":1477768250.0,"95":1477790690.0,"96":1477405296.0,"97":1477423836.0,"98":1477546891.0,"99":1477852820.0},"comment_body":{"0":"<div class=\"md\"><p>Hey! So I recently moved from Hawaii to Nevada (Henderson) and my car is still in Hawaii. I&#39;m thinking of leaving it there for my younger sibling(s) to use when they can drive in a few months and buying myself something new here.  <\/p>\n\n<p>If I do get a new car, it&#39;d be something along the lines of a fun sporty car with daily functionality. Ideally I&#39;d want automatic since I never learned to drive stick (please don&#39;t hate me) but I&#39;m open to the prospect of learning maybe.<\/p>\n\n<p>I&#39;m not really sure what my price range is. Monthly I&#39;d like to pay around $3-500usd but I&#39;m completely new to buying cars so I&#39;m not sure how that translates into msrp.  <\/p>\n\n<p>I&#39;ve considered stuff like a WRX, BRZ, Mustang Eco-boost (which people probably hate here), and some Audi&#39;s. Again, I&#39;m new to buying a car (my parents got me my first car and I&#39;m driving an old Tacoma from my cousin right now) so I really have no clue what I&#39;m doing  <\/p>\n\n<p>edit: also looked at stuff like the 370z and Lexus RC cars, not sure about those either <\/p>\n<\/div>","1":"<div class=\"md\"><p>Location: Northern BC Canada<\/p>\n\n<p>Price range: lease up to 600\/mo or purchase of 25k<\/p>\n\n<p>New or used: New or used<\/p>\n\n<p>Type of vehicle: Wagon\/hatchback<\/p>\n\n<p>Must haves: At least somewhat fun. I&#39;d really like something where you can feel the road. The Fiesta st I drove was a breath of fresh air, and I have driven some other very good handling cars that I quite enjoyed. (Z4 M, sti, M3, Fiesta ST, <\/p>\n\n<p>Intended use: daily driver, occasional weekend trips to the ski hill. would seriously consider autox or tracking it but I think I&#39;ll get a RHD import for that in the spring.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Fiesta st, golf sportwagen, Focus<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: yes<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>I&#39;m currently limping around my 2003 Jetta Wagon TDI, it&#39;s got roughly 400,000 kms on it and I fear it may throw a big repair at me soon. I would really like to buy used (environmentally minded) but trying to see if someone can throw an insane lease deal at me or something.<\/p>\n<\/div>","2":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","3":"<div class=\"md\"><p>Location: KENT, UK<\/p>\n\n<p>Price range: £609-1000<\/p>\n\n<p>New or used: Used (and abused)<\/p>\n\n<p>Type of vehicle: estate <\/p>\n\n<p>Must haves: Cargo Space, non turbo 1.2-1.8l engine <\/p>\n\n<p>Intended use: work and bike tank.<\/p>\n\n<p>Vehicles you&#39;ve already considered: audi a4 avant £700<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Does the vehicle need to have a warranty: not a chance in hell<\/p>\n\n<p>Can you do Minor work on your own vehicle: Potentially<\/p>\n\n<p>Can you do Major work: no but am willing to learn and have car mates <\/p>\n\n<p>Additional Notes: basically I want a car that will work for a year or two. I can&#39;t get away with riding my bike to work anymore as new work dictates I transport tools and people. <\/p>\n\n<p>I&#39;ve found an Audi a4 avant with 120k miles on the clock, 1.8 non turbo pretty shitty but will do the job. \n<a href=\"https:\/\/imgur.com\/tKSxG68\">https:\/\/imgur.com\/tKSxG68<\/a>\nAll opinions and ideas welcome<\/p>\n<\/div>","4":"<div class=\"md\"><p>I&#39;m looking for a weekend driver and a project car. I don&#39;t plan to track the car any time soon, but I&#39;d like to keep that option open. I&#39;m primarily looking at used cars, around the $20k mark or less preferably.<\/p>\n\n<p>I&#39;m waiting until around Spring before I buy something, but I&#39;ve started to put together a list of cars. The problem is, this list is continuing to grow because I keep finding cars I hadn&#39;t considered before. I started off with looking at BRZ\/FRS and Miata, but now I&#39;ve started looking at early Boxsters and 911s in addition to a bunch of other things.<\/p>\n\n<p>So far the list contains:<\/p>\n\n<ul>\n<li>FRS\/BRZ<\/li>\n<li>Miata<\/li>\n<li>Boxster\/Boxster S<\/li>\n<li>911<\/li>\n<li>MR2<\/li>\n<li>S2000<\/li>\n<li>Fiat 124 <\/li>\n<li>Supra<\/li>\n<\/ul>\n\n<p>Out of the above, I&#39;ve driven a BRZ, Miata NB and ND, and recently a 2003 911. Each of them have their own flavor and I liked them all. <\/p>\n\n<p>I&#39;d be happy to drive all of them as a weekend car. <\/p>\n\n<p>For a project car, Miata is probably going to be the best bet due to relatively cheap parts and high availability, in addition to the huge community. But stylistically I like the other cars over the Miatas. The 124 does have the looks, but it&#39;s a pretty new car and doesn&#39;t seem to have quite the aftermarket support just yet. <\/p>\n\n<p>I&#39;d love to get a Porsche but parts looks to be more expensive than any of the other cars on the list. And seems to be a pain to work on. I am aware of the IMS issues with the early Boxsters and aware of the cost of getting that replaced. <\/p>\n\n<p>The S2000 appears to be gaining on popularity, so that may be a good buy especially before they get too expensive. Still have to drive one. I haven&#39;t had the chance to look at the aftermarket\/community support for this.<\/p>\n\n<p>Anyway, my question is, what cars should I consider eliminating from the list above? What should I prioritize either because they are getting rarer or increasing in price?<\/p>\n<\/div>","5":"<div class=\"md\"><p>Location southern wisconsin\nPrice range 30k but could go a bit more \nSports car\nWould prefer a American car but doesn&#39;t have to be\nIntended use as a weekend car\nVehicles I consider late 90s viper, corvette, dodge charger\/challenger srt8. \nNot my first vehicle\nDoes not need a warranty\nI can do both minor and major work\nI am just looking for a fun fast sports car for the summer and weekends.<\/p>\n<\/div>","6":"<div class=\"md\"><ul>\n<li><p>Location: North East US..<\/p><\/li>\n<li><p>Price range: $15-20k<\/p><\/li>\n<li><p>New or used: Used<\/p><\/li>\n<li><p>Type of vehicle: SUV, maybe sedan<\/p><\/li>\n<li><p>Must haves: AWD, Reliability, Cheap Maintenance, Fuel efficient, Cargo Space, <\/p><\/li>\n<li><p>Intended use: Daily Driver<\/p><\/li>\n<li><p>Vehicles you&#39;ve already considered:  RAV4, CRV, maybe Corolla S<\/p><\/li>\n<li><p>Is this your 1st vehicle: No <\/p><\/li>\n<li><p>Does the vehicle need to have a warranty: Would be a plus<\/p><\/li>\n<li><p>Can you do Minor work on your own vehicle: Potentially<\/p><\/li>\n<li><p>Can you do Major work on your own vehicle: No<\/p><\/li>\n<li><p>Additional Notes: This will be my girlfriend&#39;s daily commuter. Have test driven a 2013 RAV4 and 2012 CRV, we both liked the RAV4 a little bit more. Going back to Carmax to look at a few more cars today, might test drive a corolla. CX-5 is also something we would consider but the reliability doesn&#39;t quite match Toyota\/Honda from what we have heard. Girlfriend isn&#39;t a fan of anything Subaru but may be open to giving something a test drive. AWD isn&#39;t necessarily a must-have but would be nice to have something between the two of us that can handle the snow.<\/p><\/li>\n<\/ul>\n<\/div>","7":"<div class=\"md\"><p>Location: Midwest US<\/p>\n\n<p>Price range: $8-11k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Hatchback or sedan<\/p>\n\n<p>Must haves: Would prefer turbo and manual. Something pretty fun to drive. <\/p>\n\n<p>Intended use: Daily driver w\/ some weekend cruising and highway driving thrown in<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2007-09 speed3, MKV GTI<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ): No<\/p>\n\n<p>Additional Notes: I&#39;ve been leaning toward the speed3, and it ticks the boxes I want, but I&#39;ve heard horror stories about engine mounts and smoking turbos. Should I be worried about this or is it not that big of an issue? Any knowledge you have would be appreciated, and I&#39;m open to other suggestions as well!<\/p>\n<\/div>","8":"<div class=\"md\"><p>Location: Upper Midwest US<\/p>\n\n<p>Price range: Up to ~$50k<\/p>\n\n<p>New or used: New or CPO<\/p>\n\n<p>Type of vehicle: Crossover \/ Midsized SUV<\/p>\n\n<p>Must haves: Not cloth - leather (real or synthetic are fine), Sub 6 second 0-60<\/p>\n\n<p>Intended use: Daily driver for my wife, and possibly baby in the next two or so years.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Jaguar F-Pace, Q5 3.0t, SQ5, Macan (probably too $$$), SRT8 Jeep (again $$$$), Ford Explorer Sport 3.5 ecoboost<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ): Not on newer stuff<\/p>\n\n<p>Additional Notes: Quick SUV with decent styling and no cloth is her basic want list.  F-Pace is the current front runner for us ... ideally whatever we get is within 2-3 years old and would carry CPO warranty if used.  Anything else that has zip, some style, and can haul a kid and the shit that goes along with a kid?  Thanks!<\/p>\n<\/div>","9":"<div class=\"md\"><p>I posted this a few days ago in <a href=\"\/r\/whatcarshouldibuy\">r\/whatcarshouldibuy<\/a> and got some helpful responses but wanted to see what you all had to say. <\/p>\n\n<p>Was in a pretty severe accident Saturday that I&#39;m 90% sure totalled my 2010 equinox. The good news is my wife and I are a little sore, but fine and we weren&#39;t at fault. Blue book estimates the cars value at $12k. <\/p>\n\n<ul>\n<li>Location: west Michigan <\/li>\n<li>Budget: $10-14k. the equinox was paid off so the full insurance amount can go towards the new vehicle. Am willing to put another 1-2k in if necessary but would really like to   avoid making payments if possible. <\/li>\n<li>New\/used: used is fine<\/li>\n<li>Type: 4 doors, preferably with cargo space. I really liked my equinox so I&#39;m leaning towards another crossover or a larger sedan. It&#39;s always been our road trip car so extra space would be nice. I don&#39;t need AWD.<\/li>\n<li>Use: daily commute\/road trips. No kids yet but it would probably be good to &quot;future proof&quot; for that too. <\/li>\n<li>cars considered: Top suggestions from the other thread were the CRV and the RAV4. <\/li>\n<li>Other questions: this is my first time making an insurance claim. Is it reasonable to expect being paid close to the kbb value? Is the number the insurance company comes back with negotiable? Thanks for helping me out.<\/li>\n<\/ul>\n\n<p>Edit: <a href=\"http:\/\/imgur.com\/aR5PTzi\">here&#39;s the damage if anyone is interested<\/a><\/p>\n<\/div>","10":"<div class=\"md\"><p>Location: SF Bay<\/p>\n\n<p>Budget: $1k-4k<\/p>\n\n<p>I want the best cheap beater car I can find. Prefer a manual, with 4 seats but 2 doors is OK. I can do some basic wrenching myself. What&#39;s going to be the best combination of semi-fun and semi-reliable? Old VW Rabbit\/GTI? Old Honda Prelude?  Volvo 240?<\/p>\n<\/div>","11":"<div class=\"md\"><p>BRZ or WRX? This question keeps me up at night. I live in socal, so there are ways I could use either car to their advantages. Canyons, dirt, track, etc. <\/p>\n<\/div>","12":"<div class=\"md\"><p><strong>Location:<\/strong> Arizona<\/p>\n\n<p><strong>Price range:<\/strong> &lt;=$30,000 USD<\/p>\n\n<p><strong>New or used:<\/strong> Used preferred, but ideally &lt;30k miles. Will consider new though.<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan or hatch, maybe a small SUV.<\/p>\n\n<p><strong>Must haves:<\/strong> Combined MPG over 25 or so would be nice, but not necessarily  a dealbreaker, large trunk (carrying guitar shit is a pain), newer tech, decent\/good soundsystem(can upgrade, i guess), bluetooth\/aux, somewhat reasonable acceleration (my 2011 outlander sport is  much too slow for my taste). Keyless ignition is a huge bonus.<\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> VW GTI, Subaru WRX, Audi A3 (hatch and sedan), Audi A4<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> Is a big bonus, but would potentially go without if the car is right.<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> One day, but not now.<\/p>\n\n<p><strong>Additional Notes:<\/strong> I&#39;ve debated the GTI, WRX, and Audis for a few reasons. I eyed the GTI out initially because from what I&#39;ve heard everything just makes <em>sense<\/em> in the interior. Something that drives me absolutely insane is poor design choices in little things. A button slightly out of comfortable reach, cupholders a mm too small, just small seemingly insignificant things. I guess the part of me that loves fixing things like that just gets to me too much, so I&#39;d like a car that has really nice attention to detail. I&#39;ve heard the WRX is somewhat of the opposite. The engine is better, easier to work on, and more open to mods. However, I&#39;ve heard the interior has some things to be desired, and from what I&#39;ve seen there isn&#39;t much tech in it. Also, I&#39;ve seen a few statistics saying that WRXs are more likely to be pulled over. Being someone who drives pretty quick normally, I don&#39;t want to stick out too much. My mitsubishi is perfect for that, but goddamn it&#39;s slow. The audis I initially started looking at because the engine is the same\/very similar between the GTI and the A3. I initially counted out the sedan as I wanted a long trunk to put folding tables and guitars, but when I checked one out at the dealership I saw that the seats folded down, giving it a ton of space. Pretty close to the hatchback, but not as much vertical clearance. I drive down to Mexico a fair amount, and being able to fit a cooler, some bags, and some groceries is nice. <\/p>\n\n<p>The newer tech I really enjoy includes things like lane assist, adaptive cruise control, blind spot monitoring, automatic braking if I approach a car too quick, parking sensors, and android integration. While all this is something I really enjoy, I know it may be out of my price range. <\/p>\n<\/div>","13":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","14":"<div class=\"md\"><p>• Location: Currently in Southeast Virginia with the potential to relocate to Lancaster, PA and various other locations ranging from Florida to New Hampshire (job has me rotating a lot)<\/p>\n\n<p>• Price range: $18,000-$28,000 USD<\/p>\n\n<p>• New or used: Either<\/p>\n\n<p>• Type of vehicle: Truck, Hatchback or Sedan<\/p>\n\n<p>• Must haves: FWD or AWD, 4 or 6 Cylinder, Nice Interior, Decent on Maintenance, Reliable, Fun<\/p>\n\n<p>• Intended use: Primarily as a daily driver. Although I don&#39;t have a motorcycle now, there is the potential to get another one, so it would be nice to haul around in the truck bed, but I also don&#39;t really need a truck, so a sedan\/hatchback is fine. <\/p>\n\n<p>• Vehicles you&#39;ve already considered: Nissan Frontier, Toyota Tacoma, GTI, WRX, Civic SI, Mazda 3, Focus ST<\/p>\n\n<p>• Is this your 1st vehicle: No, I&#39;ve had 4 previous cars, including a Bronco, Older Civic, Older Celica, and an Acura.<\/p>\n\n<p>• Does the vehicle need to have a warranty: It would be nice as I know I&#39;ve definitely used my current warranty.<\/p>\n\n<p>•Can you do Minor work on your own vehicle: When I&#39;m not lazy, I can change brake pads, bleed brakes, change alternators and starters, have ripped apart dashboards to replace blower motors, and etc. So, on older cars, yes. I have not worked on a vehicle newer than &#39;95.<\/p>\n\n<p>•Can you do Major work on your own vehicle: I could find my way around a timing belt replacement, but don&#39;t have the space or the means to do so. <\/p>\n\n<p>• Additional Notes: I&#39;m essentially looking for a daily driver that offers a nice interior, and is fun to drive. Reliability and affordable maintenance is a must. I&#39;ve looked into a WRX, and I absolutely love the car, but I see Subaru in the news too much with some pretty major issues and recalls, but I still can&#39;t stop thinking about it. The new civic hatchback looks great as well, but I understand that this isn&#39;t performance oriented. I&#39;ve driven a GTI and I love it, but VW has left a bad taste in my mouth in terms of what I&#39;ve read about the Mexican made vehicles and the emissions scandal. In short, there is no perfect car for me, and I&#39;m going to have to make a compromise. Any advice would be appreciated!<\/p>\n<\/div>","15":"<div class=\"md\"><ul>\n<li><p><strong>Location:<\/strong> United States, Midwest<\/p><\/li>\n<li><p><strong>Price range:<\/strong> Up to ~$55k is about as much as I can do. $40-$50 is probably a good target, but I could be a bit flexible. <\/p><\/li>\n<li><p><strong>New or used:<\/strong> Ideally new, but open to used.<\/p><\/li>\n<li><p><strong>Type of vehicle:<\/strong> Sports Sedan \/ Hatchback<\/p><\/li>\n<li><p><strong>Must haves:<\/strong> AWD, Nice Sound System, Room for Dog in Backseat, Fun to drive spiritedly but still practical as a daily driver.<\/p><\/li>\n<li><p><strong>Intended use:<\/strong> Daily Driver, Weekend Car, MAYBE some occasional track use if I head down that path, but this would be rare.<\/p><\/li>\n<li><p><strong>Vehicles you&#39;ve already considered:<\/strong> VW Golf R, Audi S3, Focus RS<\/p><\/li>\n<li><p><strong>Is this your 1st vehicle:<\/strong> No, currently driving a 2007 Ford Escape.<\/p><\/li>\n<li><p><strong>Does the vehicle need to have a warranty:<\/strong> Yes<\/p><\/li>\n<li><p><strong>Can you do Minor work on your own vehicle:<\/strong> I do regular light maintenance on my motorcycle so I don&#39;t see why that couldn&#39;t be the case here as well. <\/p><\/li>\n<li><p><strong>Can you do Major work on your own vehicle:<\/strong> Probably not.<\/p><\/li>\n<li><p><strong>Additional Notes:<\/strong> Most of what I&#39;ve been looking at have been DSG \/ Paddle Shift cars. I&#39;ve never owned a manual, although have (badly) driven one years ago when I was learning to drive. That being said, I do ride a motorcycle and am comfortable with the concepts of a clutch and shifting, so I&#39;m confident I could learn pretty quickly if something really caught my eye. Generally leaning toward the Dual Clutch option though. <\/p>\n\n<p>Mostly curious to see if there are other obvious choices in this range than the Golf R and S3 (which I recognize are more or less the same car with different fancy bits.) I&#39;m generally a nerdy \/ techy sort of guy, so things like the Virtual Cockpit in the Audi are very interesting to me. At the end of the day I want something reliable, reasonably comfortable, and fun, but some fancy tech would really tie it together for me. <\/p><\/li>\n<\/ul>\n<\/div>","16":"<div class=\"md\"><p>Location: (Specify your country or region): Maryland<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency) Max $30,000<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Crossover\/suv<\/p>\n\n<p>Must haves: AWD, Cargo Space, would love heated seats, but its not needed.<\/p>\n\n<p>Intended use: Daily Driving, road trips, camping<\/p>\n\n<p>Vehicles you&#39;ve already considered: Subaru Forester, Toyota Rav 4 (opinions on these would be great)<\/p>\n\n<p>Is this your 1st vehicle: nope<\/p>\n\n<p>Does the vehicle need to have a warranty: I would like it to.<\/p>\n\n<p>Can you do Minor work on your own vehicle: a little.<\/p>\n\n<p>Can you do Major work on your own vehicle: Nope<\/p>\n\n<p>Additional Notes: Looking to upgrade my Versa to something with more cargo space for when my husband and I road trip\/go camping with our dog.  <\/p>\n\n<p>Thanks!<\/p>\n<\/div>","17":"<div class=\"md\"><p>Location: Nashville, TN, USA<\/p>\n\n<p>Price range: Max ~$16,000<\/p>\n\n<p>New or used: No preference<\/p>\n\n<p>Type of vehicle: CUV\/SUV<\/p>\n\n<p>Must haves: Space big enough for a dog. Decent MPG<\/p>\n\n<p>Intended use: DD, drive 45 min to work, haul the dog around to parks. Potential family car in the future.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Kia Sportage\/Sorento, Hyundai Veracruz, Jeep Compass, Chevrolet Equinox, GMC Terrain\/Acadia<\/p>\n\n<p>Is this your 1st vehicle:  No<\/p>\n\n<p>Does the vehicle need to have a warranty: Not necessarily<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes, but would prefer not to.<\/p>\n\n<p>Can you do Major work on your own vehicle: No.<\/p>\n\n<p>Additional Notes: This car is for my sister. She doesnt know too much about cars. Her fiancee is a bit better, but I don&#39;t think he can do more than an oil change. She wants this car to help ship around their dog, instead of her current Hyundai Sonata. These are the cars she said she was currently looking at. I told her to stray away from the Jeeps because FCA, btu past that I have no idea what cars will be good in this category.<\/p>\n<\/div>","18":"<div class=\"md\"><p>Hey everyone. I am in Massachusetts, looking for a new car in the next year or so. I have narrowed it down to 4 cars. I am as interested in the driving experience as well as a mostly reliable 5-7 years of ownership. I want something fun and practical. I am going to pay for the taxes and fees up front out of pocket and finance the the price of the car only. I will be trading my current car an expect to get $1k for it worst case. My goal is to not finance more than $23k. I have great credit so that won&#39;t be an issue. Here is what I am thinking: 2017 VW Golf Wolfsburg, 2017 VW GTI 4dr S DSG, 2017 Mazda touring 2.5 and finally the 2017 Honda Civic hatch back. I will go automatic. Which ever choice I go for will be getting a Thule rack. I would love to hear people&#39;s thoughts. <\/p>\n<\/div>","19":"<div class=\"md\"><p>I&#39;m looking to sell my WRX and get into something a little cheaper to insure and have some cash for some other projects. I live in Denver, CO. My budget is ~$16k. Looking for something still fun to drive but also economical and can somewhat handle itself in the snow. Needs to be a stick. So far I&#39;ve looked at civic si, accord sport, and Mazda6. Open to any and all suggestions. <\/p>\n<\/div>","20":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","21":"<div class=\"md\"><p>Well I&#39;m 17 and it&#39;s about time to hand the keys to my mom&#39;s CR-V to my sister who will finally be getting her license so I am starting to look at cars. My goal is to save up 3k and my grandparents and mother will match whatever I save up.<\/p>\n\n<p>Location: Missouri<\/p>\n\n<p>Price range: &lt;8k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Either Sedan or Coupe. Also possibly a pickup truck<\/p>\n\n<p>Must haves: Turbo and Manual are preferred, but not necessary. Don&#39;t really care for drivetrain but AWD, FWD is preferred because of Missouri winters. <\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Chevy Cobalt SS, Volvo S60 R, Acura RSX Type S, Acura TL, Sn95 Mustang Cobra, Dodge Neon SRT-4, Golf GTI, Lexus Is300, DSM GSX, any old ass pickup truck<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: No but willing to learn<\/p>\n\n<p>Can you do Major work on your own vehicle: No but willing to learn<\/p>\n\n<p>Additional Notes:<\/p>\n<\/div>","22":"<div class=\"md\"><ul>\n<li><p><strong>Location:<\/strong> Long Island, New York<\/p><\/li>\n<li><p><strong>Price range:<\/strong> &lt;$7500<\/p><\/li>\n<li><p><strong>New or used:<\/strong> Used<\/p><\/li>\n<li><p><strong>Type of vehicle:<\/strong> Anything not a Van\/Truck\/SUV<\/p><\/li>\n<li><p><strong>Must haves:<\/strong> 4 seats, decent fuel efficiency<\/p><\/li>\n<li><p><strong>Intended use:<\/strong> Daily Driver, Commuting on the Highway<\/p><\/li>\n<li><p><strong>Vehicles you&#39;ve already considered:<\/strong> a 2008 Ford Mustang Deluxe, a Chevy Malibu<\/p><\/li>\n<li><p><strong>Is this your 1st vehicle:<\/strong> Yes<\/p><\/li>\n<li><p><strong>Does the vehicle need to have a warranty:<\/strong> No<\/p><\/li>\n<li><p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p><\/li>\n<li><p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p><\/li>\n<li><p><strong>Additional Notes:<\/strong> I am currently considering the 2008 Ford Mustang Deluxe, but it is RWD and I&#39;m not sure if that is a good idea considering the upcoming winter and snow. If anyone can give insight on owning a RWD car in NY it would be appreciated.<\/p><\/li>\n<\/ul>\n<\/div>","23":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","24":"<div class=\"md\"><p>·Location: Southern California<\/p>\n\n<p>Price range: &lt;$3000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or Coupe<\/p>\n\n<p>Must haves: Manual, fairly easy to work on, readily available parts<\/p>\n\n<p>Intended use: Daily Driver and Project Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: None<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Basic fluids and filter changes<\/p>\n\n<p>Can you do Major work on your own vehicle: Looking to learn that as I go\nAdditional Notes:<\/p>\n<\/div>","25":"<div class=\"md\"><p>Looking to buy my first fun to drive car. I currently drive a 2006 Sentra. I would prefer something that isn&#39;t going to be an expensive nightmare to keep running.<\/p>\n\n<p>Location: Lake Erie snowbelt <\/p>\n\n<p>Price range: $20,000-$30,000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports car, luxury sport coupe, sports sedan... anything with decent performance<\/p>\n\n<p>Must haves: Reasonable amount of power, quick, fun, must be driveable year-round in heavy snow<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: G37xS coupe, Evo X, WRX or STi<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Can be 2 or 4 door, manual or auto (although if auto I&#39;d want a good automatic or dual clutch). Leaning toward either the G37xS or the Evo right now. I&#39;ve always heard that Evos are good in snow, but how are the G37s? I&#39;ve thought about a V8 pony car, but I&#39;m worried that it would be a bad choice for a year-round daily driver where I live. Is there anything else worth considering?<\/p>\n<\/div>","26":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","27":"<div class=\"md\"><p>I&#39;m looking at a 2014 Toyota Corolla LE Plus, they listed the price at 12.8k but my dad is going to try and talk the price down. If I got this, it would be my first car. Any advice on if I should get this car or not?<\/p>\n<\/div>","28":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","29":"<div class=\"md\"><p>I live in the central US and am looking for either a 4 door sport sedan or a hatchback. My requirements are performance oriented with a manual transmission, decent amount of luxury type options, and leather\/recaro\/suede seats. I&#39;ll have a budget of roughly 20k but would be willing to spend more.\nCurrently considering Ford Fiesta\/Focus ST, Buick Regal GS, Subaru WRX, Lancer evolution, VW Golf<\/p>\n<\/div>","30":"<div class=\"md\"><blockquote>\n<ul>\n<li><p><strong>Location:<\/strong> (US, MA South)<\/p><\/li>\n<li><p><strong>Price range:<\/strong> ($500-$5000)<\/p><\/li>\n<li><p><strong>New or used:<\/strong>(Used)<\/p><\/li>\n<li><p><strong>Type of vehicle:<\/strong> (Car)<\/p><\/li>\n<li><p><strong>Must haves:<\/strong> (Manual Tranny, 20-30mpg or more, little large cause im 6&#39;4, Auto lock and Auto windows, easy power steering if possible)<\/p><\/li>\n<li><p><strong>Intended use:<\/strong> (Daily Driver)<\/p><\/li>\n<li><p><strong>Vehicles you&#39;ve already considered:<\/strong>  None, currently own a 99 tahoe that only gets 8mpg at best and is rusting out.<\/p><\/li>\n<li><p><strong>Is this your 1st vehicle:<\/strong> no<\/p><\/li>\n<li><p><strong>Does the vehicle need to have a warranty:<\/strong> no<\/p><\/li>\n<li><p><strong>Can you do Minor work on your own vehicle:<\/strong> (fluids, alternator, battery, water pump, brake pad etc) yes<\/p><\/li>\n<li><p><strong>Can you do Major work on your own vehicle:<\/strong> (engine and transmission rebuild, timing belt\/chains, body work etc ) dont have a lift or time<\/p><\/li>\n<li><p><strong>Additional Notes<\/strong> Im down for anything. From a toyo to a chevy I dont care. Just wanna fit and have a manual.<\/p><\/li>\n<\/ul>\n<\/blockquote>\n<\/div>","31":"<div class=\"md\"><p>Location: CT, USA<\/p>\n\n<p>Price range: Probably $20,000 to $30,000<\/p>\n\n<p>New or used: Looking more at used, but would consider new if it was worth the price difference<\/p>\n\n<p>Type of vehicle: Current car is an SUV, would consider other car types if they&#39;re a good fit<\/p>\n\n<p>Must haves: 4WD or AWD, automatic transmission, low maintenance costs, storage space preferable<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Honda CR-V, since it&#39;s what I&#39;m driving now. Wanted a more neutral expert opinion<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc) nope<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ) definitely not<\/p>\n\n<p>Additional Notes: Just need a quality vehicle to get me from point A to point B in various types of weather, that can last a long time and not cost a fortune to maintain<\/p>\n<\/div>","32":"<div class=\"md\"><p>Welp, my Audi&#39;s transmission is officially on the way out. I&#39;ll be getting rid of the car soon and need a daily driver replacement.  <\/p>\n\n<p>Location: Midwest<br\/>\nPrice range: $20,000 Maximum<br\/>\nNew or used: Used<br\/>\nType of vehicle: Sedan\/Coupe\/Hatchback\/Wagon<br\/>\nMust haves: MY2009+,<br\/>\nIntended use: Daily Driver<br\/>\nVehicles you&#39;ve already considered: G37, IS\/ES, TSX, Accord, Avalon, 370z, C6 Corvette<br\/>\nIs this your 1st vehicle: No<br\/>\nDoes the vehicle need to have a warranty: No<br\/>\nCan you do Minor work on your own vehicle: Yes<br\/>\nCan you do Major work on your own vehicle: No  <\/p>\n\n<p>I&#39;m kind of flipping back and forth about getting something fun and sporty, or just buying a cheap Accord, paying off the loan in a few months, and then saving up for a fun car.<\/p>\n<\/div>","33":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","34":"<div class=\"md\"><p>I&#39;m in the market for an SUV and I&#39;ve somewhat narrowed it down to a 1998 Toyota Land Cruiser and a 2008 Jeep Rubicon Unlimited. <\/p>\n\n<p>I&#39;ll be using it for highway driving, mountain trips, backpack camping (not sleeping in car), and offroading. Also, I live in a mountain town that sees snow in the winter.<\/p>\n\n<p>Which choice would be the best value for the money? I&#39;m looking for something both reliable for years to come and capable of handling most anything. Further details are below:<\/p>\n\n<p><strong>1998 Land Cruiser<\/strong><\/p>\n\n<ul>\n<li><p>$10,500<\/p><\/li>\n<li><p>183k miles<\/p><\/li>\n<li><p>rear &amp; center locking differential<\/p><\/li>\n<li><p>leather &amp; exterior in great condition<\/p><\/li>\n<\/ul>\n\n<p><strong>2008 Jeep Rubicon Unlimited<\/strong><\/p>\n\n<ul>\n<li><p>$23,500<\/p><\/li>\n<li><p>68k miles<\/p><\/li>\n<li><p>6 speed manual<\/p><\/li>\n<li><p>Smittybilt steel bumper with winch<\/p><\/li>\n<li><p>PIAA fog lights<\/p><\/li>\n<li><p>Bushwacker fender flares<\/p><\/li>\n<li><p>35 inch tires w\/ 20 inch kmd wheels<\/p><\/li>\n<li><p>navigation<\/p><\/li>\n<li><p>front &amp; rear locking differentials<\/p><\/li>\n<li><p>soft top (no hard top included)<\/p><\/li>\n<li><p>interior &amp; exterior in great condition<\/p><\/li>\n<\/ul>\n<\/div>","35":"<div class=\"md\"><p>Location: Minneapolis<br\/>\nPrice range: 1-3k<br\/>\nUsed<br\/>\nType: Car<br\/>\nMust haves: Auto Trans, FWD<br\/>\nIntended Use: Daily Driver<br\/>\nConsidered: Camaro but realized it&#39;s RWD. Considering Civic for reliability, but they all have really high mileage and I feel like there may be better options.<br\/>\n1st vehicle<br\/>\nDoes not need warranty<br\/>\nI can do minor work but preferably not.<br\/>\nAdditional Notes: Something reliable. <\/p>\n<\/div>","36":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","37":"<div class=\"md\"><p>Location: Atlanta, GA USA<\/p>\n\n<p>Price range:  $14,000 - $16,000 USD<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Doesn&#39;t matter, fast and\/or fun to drive with 4 seat belts.<\/p>\n\n<p>Must haves: Must be fun on twisties and not a dog in a straight line... and 4 seat belts.<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Scion FR-S, Fiesta ST, Focus ST, WRX, Mustang GT, Camero SS, Civic Si<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Mostly I want the car to be fun to drive yet practical to commute in. It doesn&#39;t necessarily HAVE to be fast, but it would help. Oh, and I have to have 4 seats with seat-belts.<\/p>\n<\/div>","38":"<div class=\"md\"><ul>\n<li>Location: Indianapolis<\/li>\n<li>Price range: $15k-25k (that includes an assumed $4k trade-in)<\/li>\n<li>New or used: prefer new.  Used of less than 2 years old might be okay.<\/li>\n<li>Type of vehicle: Hatchback<\/li>\n<li>Must haves: good handling, good pickup, good cargo.  I&#39;d prefer a shark-fin antenna and  quieter ride.<\/li>\n<li>Intended use: daily driver in city and town.  That includes interstate driving.<\/li>\n<li>Vehicles you&#39;ve already considered: 2017 Mazda 3 hatch, Ford Focus, Honda Civic Hatch<\/li>\n<li>Is this your 1st vehicle: no.  I currently own a 2007 Honda Accord.<\/li>\n<li>Does the vehicle need to have a warranty: I&#39;d prefer it<\/li>\n<li>Can you do Minor work on your own vehicle: no<\/li>\n<li>Can you do Major work on your own vehicle: no\nAdditional Notes:  I&#39;m mainly trying to choose between the 2017 Mazda 3 hatch, Ford Focus, Honda Civic Hatch.  I plan on test driving all three within the next few weeks.  I&#39;m open to other suggestions.  I&#39;m currently leaning toward the Honda and Mazda.  Also, I&#39;m not interested in the smaller hatches, such as the Honda Fit.<\/li>\n<\/ul>\n<\/div>","39":"<div class=\"md\"><p>Location: Tempe, AZ\nPrice Range: 6k-7k\nNew or Used: Used\nType of Vehicle: Hatchback, Coupe, Sedan\nMust Haves: Manual trans\nIntended Use: Daily driver\nVehicles Already Considered: GTI, Miata\nNot my first vehicle, can do minor work, major work maybe, doesn&#39;t need a warranty. <\/p>\n\n<p>Looking for something to replace my gas guzzling Tahoe, 8 seats and 4x4 are pretty useless around a college campus so I finally sold it and had a little bit saved up so I&#39;m looking for something that actually suits my situation. Preferably something decently fun to drive and good on gas. Thoughts?<\/p>\n<\/div>","40":"<div class=\"md\"><p>Location: Yukon, Canada (will be buying from alberta though coz wtf yukon prices for used car).<\/p>\n\n<p>Price range: 10,000<\/p>\n\n<p>New or used:used<\/p>\n\n<p>Type of vehicle: sedan\/coupe\/wagon<\/p>\n\n<p>Must haves: winter friendly<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: WRX, Civic Si<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Won&#39;t be buying not until next summer, just looking for opinions. For my budget, dont think I can find a decent wrx but who knows. Really want an awd for winter, but fwd might do too.<\/p>\n<\/div>","41":"<div class=\"md\"><ul>\n<li>Location: BC Canada<\/li>\n<li>Price range: Up to ~$7,000<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Sedan\/Coupe\/Wagon<\/li>\n<li>Must haves: Manual, roof rack or tow hitch (for bike rack)<\/li>\n<li>Intended use: Fun daily driver + road trip car<\/li>\n<li>Vehicles you&#39;ve already considered: Subaru Legacy GT, Outback, Impreza.<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: No<\/li>\n<li>Can you do Minor work on your own vehicle: Yes<\/li>\n<li>Can you do Major work on your own vehicle: Yes<\/li>\n<li>Additional Notes: Important that it&#39;s fun to drive. I&#39;m coming from a Miata and still want to enjoy all the twisty mountain roads around me, I just need something a touch more practical.<\/li>\n<\/ul>\n<\/div>","42":"<div class=\"md\"><ul>\n<li>Location: San Francisco<\/li>\n<li>Price range: $25k - $35k<\/li>\n<li>New or used: New (lease)<\/li>\n<li>Type of vehicle: SUV<\/li>\n<li>Must haves: Uncertain...<\/li>\n<li>Intended use: Family car for road tripping out of town<\/li>\n<li>Vehicles you&#39;ve already considered: Hyundai Tucson Ultimate, Mazda CX-5<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: No. I&#39;ll be leasing.<\/li>\n<li>Can you do Minor work on your own vehicle: no<\/li>\n<li>Can you do Major work on your own vehicle: no<\/li>\n<li>Additional Notes: This is mostly a getaway car. I want to put my dogs in the back, attach a tow bar so I can bring mountain bikes along, and enjoy the drive (I like driving).<\/li>\n<\/ul>\n<\/div>","43":"<div class=\"md\"><p>Thinking about truck. Looking for those that have driven both of these vehicles and can give me a comparison:<\/p>\n\n<p>F-150 XL Regular cab with 2.7 Ecoboost and 3.73 LSD\nRam 1500 Regular Tradesman with 5.7 Hemi and 3.92 LSD<\/p>\n<\/div>","44":"<div class=\"md\"><p>Location: Australia\nPrice range: around $10,000 aud\nNew or used: used\nType of vehicle: sports\nMust haves: rwd and manual\nIntended use: weekend\/track\/project \nVehicles you&#39;ve already considered: 300zx, s13, \nIs this your 1st vehicle: hahhahahah\nDoes the vehicle need to have a warranty: no\nCan you do Minor work on your own vehicle: yes\nCan you do Major work on your own vehicle: yes (qualified)\nAdditional Notes:<\/p>\n\n<p>Used to be into performance cars, stopped owning cars around 2 years ago and just rode sports bikes. tied of all weather riding. want to get back into cars. Currently have my eyes on a particular 300zx TT manual, just want to make sure I&#39;m considering all options. Have most recently had a mx5 and s13, the nissan was nice but they garner a lot of police attention here in aus. mx5 was great, mine had significant suspension modifications and turned amazingly. downside was it was slow. so slow.<\/p>\n\n<p>I only drive for 1 week every 3 and thats not commuting just weekend type driving. am happy to have something thats a little more maintenance intensive, as i am a mechanic and can use bike\/other cars if i need to.<\/p>\n\n<p>I&#39;m currently considering the zed as it reasonably quick sports car. they can be modified to go faster easily which usually happens. did consider the 350z as the bottom end of the 350s are priced similar to a vgc z32, but besides that a lot of reviewers consider the z32 more of a drivers car vs the z33 which is a lot more comfortable apparently. I&#39;m yet to test drive a 350 though, only a 300 and i am happy with what a stock one does.<\/p>\n\n<p>Any suggestions?<\/p>\n<\/div>","45":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","46":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","47":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","48":"<div class=\"md\"><p>Location: England, UK<\/p>\n\n<p>Price range: £5,000 to £15,000<\/p>\n\n<p>New or used: Either, new if it&#39;s a good deal<\/p>\n\n<p>Type of vehicle: City car, hatchback<\/p>\n\n<p>Must haves: Fuel efficient, air conditioning, bluetooth, electric front windows, aux port\/usb<\/p>\n\n<p>Intended use: 30 miles a day for work and occasional long trips on a weekend<\/p>\n\n<p>Vehicles you&#39;ve already considered: Fiesta 1.0 ecoboost titanium<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I&#39;m thinking the fiesta, but it&#39;s a little pricier than I was hoping to spend, however, they have good resale value, finance is 0% and they contribute £900 to your deposit. Also it&#39;s very economical and really fun to drive.<\/p>\n<\/div>","49":"<div class=\"md\"><p>Location: Northern, VA<\/p>\n\n<p>Price range: $15-$25k though I would prefer it to be towards the lower end<\/p>\n\n<p>New or used: Prefer new<\/p>\n\n<p>Must haves: Decent MPG, at least SOME safety features (may be hard at &lt;20k), smooth ride, carplay if possible<\/p>\n\n<p>Intended use: 70 miles a day for work and to drive around town<\/p>\n\n<p>Vehicles considered: 2017 VW Golf (base), 2017 Elantra, 2016 civic...ones like this...do not like mazda 3<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: What to get your opinion on the base Golfs. I really like how compact it is for the city and I hear it&#39;s a great drive.<\/p>\n<\/div>","50":"<div class=\"md\"><p>Location: California Bay Area<\/p>\n\n<p>Price range: Up to 7.5k max, ideally 5k.<\/p>\n\n<p>New or used: Used.<\/p>\n\n<p>Must haves: Safety is important to me. I&#39;d want something with airbags and relatively safe to drive. Also, something reliable would be nice, I don&#39;t want to fix it up and just keep seeing parts fall apart. Cheapish parts, ideally it wouldn&#39;t cost more than 5k to get it running well. <\/p>\n\n<p>Intended use: Looking for a project car that can double as a weekend\/fun car.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Miata, Mustang, Corvette. I like the ease of work and part availability of these cars. Looking around for more options, I tend to prefer a more &quot;aggressive&quot; look (think hellcat) if possible. <\/p>\n\n<p>Is this your 1st vehicle: Nope. <\/p>\n\n<p>Does the vehicle need to have a warranty: Nope.\nCan you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Maybe? Not much experience but I&#39;m a MechE and feel that I can handle most of the tasks as long as there are step by step instructions. <\/p>\n\n<p>Additional Notes: Bonuses would be a convertible, RWD, fairly fuel efficient (say above 20mpg). The ability to do small fixes (change some belts, fluids) or add on a larger project if I have the time\/money (add a supercharger.etc) is a big bonus. Essentially I&#39;m looking for a car to have fun tinkering around with and also as a weekend car. <\/p>\n<\/div>","51":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","52":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","53":"<div class=\"md\"><p>Location: Atlanta<\/p>\n\n<p>Location: USA<\/p>\n\n<p>Price range: $8-12K<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or SUV or Crossover<\/p>\n\n<p>Must haves: Aux input, safe storage space (only thing I really move is guitar gear, but it needs to be safe), would prefer it have under 70K miles<\/p>\n\n<p>Vehicles you&#39;ve already considered: None, really<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Nah<\/p>\n\n<p>Can you do Minor work on your own vehicle: ...not really.<\/p>\n\n<p>Can you do Major work on your own vehicle: Nope<\/p>\n<\/div>","54":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","55":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","56":"<div class=\"md\"><pre><code>    Location: California\n\n    Price range: $6000-$12000\n\n    New or used: Used.\n\n    Type of vehicle: Anything with a lift-gate\/hatch.  Just no sedans, coupes, verts.\n\n    Must haves: Hatch.  Notchy manual preferred.. \n\n    Intended use: DD\n\n    Vehicles you&#39;ve already considered: 2008 BMW X3, Audi A3 hatch\n\n    Is this your 1st vehicle: No..\n\n    Does the vehicle need to have a warranty: No.\n\n    Can you do Minor work on your own vehicle: Yes\n\n    Can you do Major work on your own vehicle: Yes\n    Additional Notes:\n<\/code><\/pre>\n<\/div>","57":"<div class=\"md\"><p>Location: Colorado<\/p>\n\n<p>Price range: 1000-5000<\/p>\n\n<p>New or Used: Used<\/p>\n\n<p>Type: Car<\/p>\n\n<p>Must haves: 4WD\/AWD<\/p>\n\n<p>Use: Project car<\/p>\n\n<p>My first vehicle<\/p>\n\n<p>Can do Minor and some major work<\/p>\n<\/div>","58":"<div class=\"md\"><p>Location: <\/p>\n\n<p>Price range: $10,000-$40,000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or Coupe<\/p>\n\n<p>Must haves: None<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: None really. Coming from 2006 Accord.<\/p>\n\n<p>Is this your 1st vehicle: 2nd<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ) No<\/p>\n\n<p>Thinking I might get a car in the 2012-2014 time frame to avoid the greatest depreciation burden. Primary goals are fun, reliability, comfort, and style.<\/p>\n<\/div>","59":"<div class=\"md\"><p>Location: Virginia, USA<\/p>\n\n<p>Price Range: 30-45k<\/p>\n\n<p>Used<\/p>\n\n<p>Compact\/Mid-sized SUV<\/p>\n\n<p>Must haves: upgraded interior, good gas mileage, safe, some room (I am 6&#39;5&quot;), wife prefers sporty<\/p>\n\n<p>Will be a daily driver, future family vehicle. <\/p>\n\n<p>We have considered: RAV4, CRV, Jeep Cherokee (&amp;Grand), Mazda CX-7. <\/p>\n\n<p>We were gifted a Prius last year with 130K miles and it was recently flooded. My job gives me a take home car, and my wife works from home so the car would not be used besides road trips, which we like to take often. Our other car is a Cadillac SRX 2007 with 110k miles. I hate paying to fix the Cadillac and it&#39;s issues so I would prefer a car that is not expensive to fix. I would be using a shop for all repairs, so something that does not breakdown frequently or the parts are not crazy expensive would be ideal. <\/p>\n\n<p>Thank you for your help! <\/p>\n<\/div>","60":"<div class=\"md\"><ul>\n<li><strong>Location<\/strong>: Buffalo, NY<\/li>\n<li><strong>Price<\/strong>: $275-$350\/mo (<em>LEASE<\/em>)<\/li>\n<li><strong>Type of Vehicle<\/strong>: Full or mid-size SUV<\/li>\n<li><strong>Must Haves<\/strong>- 4WD\/AWD\/can handle Buffalo winters<\/li>\n<li><p><strong>Intended Use<\/strong>: daily to\/from work<\/p><\/li>\n<li><p><strong>Additional notes<\/strong>: Currently have a GMC Denali Terain, which I love, but looking to downgrade a bit as far as price goes<\/p><\/li>\n<\/ul>\n<\/div>","61":"<div class=\"md\"><p>Location: Louisiana, US <\/p>\n\n<p>Price Range: $2-6K<\/p>\n\n<p>New or Used: Used <\/p>\n\n<p>Type of Vehicle: Sedan\/Hatch or Small SUV preferred (may consider any other type as long as I get a good deal)<\/p>\n\n<p>Intended Use: DD, Commuter Car <\/p>\n\n<p>Must Haves: Reliability, easy\/cheap maintenance, decent stock audio and decent safety as a I keep learning how to drive. <\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda 3, Mazda Miata, Toyota Camry, Honda Accord, VW Jetta(mk5) Kia Sportage, Ford Escape. <\/p>\n\n<p>Is this your 1st vehicle: Yes <\/p>\n\n<p>I can do some minor work and willing to learn more about mechanics. <\/p>\n\n<p>I am familiar with manual transmission but I&#39;d appreciate an auto due to traffic during commute and it&#39;s going to be my first car, or any vehicle with a manual that&#39;s easy to drive, I am somehow enthusiastic, but I&#39;d like to enter driving with something more subtle or gentle and then get a faster and more fun car. <\/p>\n<\/div>","62":"<div class=\"md\"><p>• Location: Arizona<\/p>\n\n<p>• Price range: 500-3500<\/p>\n\n<p>• New or used: Used<\/p>\n\n<p>• Type of vehicle: Sports car<\/p>\n\n<p>• Must haves: Manual, rwd, AWD<\/p>\n\n<p>• Intended use: Daily, offroading<\/p>\n\n<p>• Vehicles you&#39;ve already considered: Subaru Impreza, Toyota Pickup\/Taco, Baja bug, Mazda MX5, Nissan 720\/D21 Hardbody<\/p>\n\n<p>• Is this your 1st vehicle: Yes<\/p>\n\n<p>• Does the vehicle need to have a warranty: No<\/p>\n\n<p>• Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: No<\/p>\n\n<p>• Additional Notes: Something that I could take to the track and carve canyons while being able to bash offroad<\/p>\n<\/div>","63":"<div class=\"md\"><p>Location: Texas<\/p>\n\n<p>Price range: $25-45k<\/p>\n\n<p>New or used: Either, prefer used<\/p>\n\n<p>Must haves: Comfort, reliability, fun to drive (if I go with a sedan over SUV), updated tech (I have been driving 6+ year old cars forever, ready for some new technology)<\/p>\n\n<p>Intended use: Daily Driver, work (driving bosses\/clients)<\/p>\n\n<p>Vehicles you&#39;ve already considered:<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes but would prefer taking to a shop<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: I have quite the list. Deep down something tells me to go for a lower price and that I won&#39;t really enjoy the more expensive cars as much as I think. But I am craving getting back into something more fun (grew up on sports cars and sold an e46 M3 a year ago to go to something more practical). The more expensive ones are not an issue financially, I&#39;m just wondering if the thought of them is going to wind up being better than actually owning it. Objectively, Kia\/Jeep seem best. But I really want one of the others. <\/p>\n\n<p>Looking to be talked out of any of the following: <\/p>\n\n<p><strong>Practical Group<\/strong><\/p>\n\n<ul>\n<li><p>2015\/2016 Kia Optima SX. Can get new tech, warranty, reliability for a low price. $26-30k priced out in my area for new or barely used. <\/p><\/li>\n<li><p>2014 Jeep Grand Cherokee Limited or Overland. Priced out between $27-33k in my area for 30-40k miles. This would be pretty practical and could transport people easily. I like the price. <\/p><\/li>\n<li><p>2014\/2015 Ford Explorer. Just throwing in another SUV type. $26-30k for 20-30k miles. <\/p><\/li>\n<\/ul>\n\n<p><strong>Fun Group<\/strong><\/p>\n\n<ul>\n<li><p>2014\/2015 Inifiniti Q50 or Q70. Step above the first three. Good mix of sport and comfort. 30k miles\/$30k to 15k miles\/$40k in my area. <\/p><\/li>\n<li><p>2014 Chevy SS. I grew up on muscle cars. I think I would love this car, just worried about the interior size (I&#39;m 6&#39;2&quot;). 20k miles\/$35k around here. I hate the chrome wheels so would be looking to replace those. <\/p><\/li>\n<li><p>2013\/2014 CTS-V. 44k miles\/$40k to 25k miles\/$50k. I have hear a lot of bad reviews on the CUE system. Car would obviously be fun to drive, maybe the most fun out of the group<\/p><\/li>\n<li><p>2014\/2015 535i. I loved my e46 m3 other than the small interior just wearing me out over time. Can get 20-30k miles for $40k. <\/p><\/li>\n<\/ul>\n<\/div>","64":"<div class=\"md\"><p>Location: New Jersey<\/p>\n\n<p>Price range: $0-$25,000(give or take a bit)<\/p>\n\n<p>New or used: either<\/p>\n\n<p>Type of vehicle: Sporty type car, or sedan<\/p>\n\n<p>Must haves: AWD<\/p>\n\n<p>Intended use: Daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: subaru impreza, crosstrek, jeep wrangler<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: honestly dont know<\/p>\n\n<p>Can you do Minor work on your own vehicle: probably, but will most likely take it to shop<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: i prefer something small and sport looking, and performance would be nice too. a lot of the cars people are recommending with AWD are crossovers, but i don&#39;t really want one of those<\/p>\n<\/div>","65":"<div class=\"md\"><p>Location: New York<\/p>\n\n<p>Price range: $8,000-$10,000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan, Crossover, SUV<\/p>\n\n<p>Must haves: Not terrible in snow, fuel efficiency a plus.<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Honda CR-V, Nissan Rogue, Toyota Rav4, Honda Accord, Toyota Camry, Toyota Corolla<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: Would be a great bonus<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: This is my first car and i&#39;d just love something that can get from one location to another without fear of it breaking down. Reliability, and comfort are my top concerns. Being my first car i&#39;m not looking for the flashiest or fastest of cars. I would love to find some sort of crossover suv and the Mazda cx-3 would be amazing but I just can&#39;t seem to find it anywhere so i&#39;m looking at the Cr-V, and Nissan Rogue but each one I find seems to be pretty high on the miles. Would love something that I could use for about 5 years easily if possible. <\/p>\n<\/div>","66":"<div class=\"md\"><p>If I want to trade my Jaguar for something that&#39;s still just as fast but more fuel efficient? What are my options?<\/p>\n<\/div>","67":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","68":"<div class=\"md\"><ul>\n<li>Location: Oregon<\/li>\n<li>Price range: &lt;$8000 USD<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Car, Sports Car, Sedan<\/li>\n<li>Must haves: <em>diy<\/em> aftermarket (not entirely bolt-on parts, more involved tuning), weigh &gt;3000 lbs<\/li>\n<li>Intended use: Weekend Car, Track Toy, Project Car<\/li>\n<li>Vehicles you&#39;ve already considered: 1994-97 Mazda Miata<\/li>\n<li>Is this your 1st vehicle: Yes<\/li>\n<li>Does the vehicle need to have a warranty: No<\/li>\n<li>Can you do Minor work on your own vehicle: Yes<\/li>\n<li>Can you do Major work on your own vehicle: Yes<\/li>\n<li>Additional Notes: A big thing I liked about the Miata was the amount of work I can do myself vs. buying a company&#39;s bolt-on parts. It doesn&#39;t seem very rewarding for me to do simple bolt-on modifications where the fun of the car is determined by is how much you spent, not the work you did. For example, I would love to buy a turbo kit and tune the car myself (Megasquirt) with some guidance. The reason I can&#39;t go with a Miata however is that my father would like me to have a heavier car. I&#39;m also not a fan of American muscle cars (Mustang, Camaro, etc.) Thanks!!<\/li>\n<\/ul>\n<\/div>","69":"<div class=\"md\"><ul>\n<li>Location: California<\/li>\n<li>Price range: Sub 2k<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Sedan<\/li>\n<li>Must haves: Fuel efficient, cheap replacement parts, less than 100k miles<\/li>\n<li>Intended use: Daily driver; will mostly be using this to go to and from work <\/li>\n<li>Vehicles you&#39;ve already considered: Mazda Protege5<\/li>\n<li>Is this your 1st vehicle: Yes<\/li>\n<li>Does the vehicle need to have a warranty: No<\/li>\n<li>Can you do Minor work on your own vehicle: Yes (keep in mind that I&#39;m a student and have limited tools and space)<\/li>\n<li>Can you do Major work on your own vehicle: Absolutely not<\/li>\n<li>Additional Notes:\nSo I posted on here before asking if I should purchase a used Mazda 3 with a bad tranny and I was told no, to go for a used Mazda Protege5. I waited and miraculously one popped up in my area (a 2002) with a very clean interior and exterior and low miles for only $1950. I asked the owner why he was selling it for cheap and he said it was because of the rust issue which you can see clearly around the back wheels from the picture. Everything else was very well maintained. Should I purchase this knowing about the rust problem or no? Here&#39;s the cl link: <a href=\"https:\/\/modesto.craigslist.org\/cto\/5852705742.html\">https:\/\/modesto.craigslist.org\/cto\/5852705742.html<\/a><\/li>\n<\/ul>\n<\/div>","70":"<div class=\"md\"><p>Location: LA, CA<br\/>\nPrice Range: Under 13k if its something newer with lower miles, otherwise I am looking for something under 8k.<br\/>\nNew or used: used<br\/>\nType of vehicle: sporty<br\/>\nMust haves: Manual<br\/>\nintended use: Daily driving 2 miles to work. Random trips<br\/>\nVehicles considered: Mazda 3, Miata<br\/>\nIs this your 1st vehicle:No<br\/>\nDoes the vehicle need to have a warranty: No<br\/>\nCan you do Minor work on your own vehicle: Yes<br\/>\nCan you do Major work on your own vehicle: No<br\/>\nAdditional Notes: I really like the idea of a miata (&#39;06+ if I can get a decent one for 6-8k) but might need some more practical options. I like the mazda 3 hatches for example. I like minis too but I heard way too many bad things about the cost of upkeep on them. e46 330i is also one of my favorite cars, but again upkeep.<\/p>\n\n<p>Although I&#39;d only be driving it for probably a total of 6000-10000 miles before selling it. <\/p>\n<\/div>","71":"<div class=\"md\"><ul>\n<li>Location: Salt Lake City, UT<\/li>\n<li>Price range: 50k max<\/li>\n<li>New or used: Either<\/li>\n<li>Type of vehicle: AWD Luxury Sports Coupe<\/li>\n<li>Must haves: AWD <\/li>\n<li>Intended use: Daily Driver <\/li>\n<li>Vehicles you&#39;ve already considered: 997 991 4S, M235xi\/M240xi, wanting to stay away from Subaru, Mitsubishi, and Audi.<\/li>\n<li>Is this your 1st vehicle:<\/li>\n<li>Does the vehicle need to have a warranty: No, but it would be a plus<\/li>\n<li>Can you do Minor work on your own vehicle: Yes<\/li>\n<li>Can you do Major work on your own vehicle: With help<\/li>\n<li>Additional Notes: I&#39;m looking to upgrade from my old trusty truck to a new sports car. It must be able to be DD&#39;d during Utah winters. So far the M235xi and a 997 4S have been my major considerations. I have also lightly researched the Lexus RC 350 F Sport, but it doesn&#39;t seem up to par with the M235xi. Are there any other cars out there that I need to consider? I&#39;ll also consider a sedan, but seriously prefer a coupe. <\/li>\n<\/ul>\n\n<p>Thank you!<\/p>\n<\/div>","72":"<div class=\"md\"><p>Location: North East US (we get snow for about 2-3 months)<\/p>\n\n<p>Price range: 40-80k<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: sedan or hatchback.<\/p>\n\n<p>Must haves: 4 doors, 0-60 mph in under 5 seconds, prefer 6 cyl or larger (turbo 4s are getting boring), prefer a longitudinal engine layout.<\/p>\n\n<p>Intended use: Daily Driver, Family Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Golf R, Chevy SS, Cadillac ATSV, Taurus SHO (these are all still on the table, so thoughts about these are welcome)<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: I&#39;m willing to consider warranty invalidating performance mods to get the 0-60 time I&#39;m after.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Prefer not to.<\/p>\n\n<p>Additional Notes:<\/p>\n<\/div>","73":"<div class=\"md\"><p>Location: Southern US, TX <\/p>\n\n<p>Price range: $3,000 max <\/p>\n\n<p>New or used: Used <\/p>\n\n<p>Type of vehicle: Sedan <\/p>\n\n<p>Must haves: V6 <\/p>\n\n<p>Intended use: Daily Driver <\/p>\n\n<p>Vehicles you&#39;ve already considered: 2002-2008 Camry&#39;s, would like thoughts on KIA or Hyundai sedans <\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Can change oil, replace battery\/tires <\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Kind of in a hurry to buy the car and wanted help I won&#39;t get anywhere else<\/p>\n<\/div>","74":"<div class=\"md\"><p>Location: Salt Lake City, Utah (USA)\nPrice Range: 2,000-10,000\nNew or Used: Doesn&#39;t matter.\nType of Vehicle: Sedan\/Sports Car.\nMust Haves: 6 or 8 cylinders, decent fuel efficiency (18+mpg).\nIntended Use: Daily Driver\nVehicles Considered: Honda Accord, Subaru Legacy, Subaru Impreza, Audi A4.\n1st Vehicle: No.\nWarranty: Not needed.\nMinor Work: Yes\nMajor Work: I&#39;ve only rebuilt one engine before and helped my uncle with a few transmissions so that&#39;s iffy.\nNotes: AWD would be nice as it gets very snowy here in the winter. FWD is okay but RWD would sadly probably not be the best idea for me. Also manual would be fantastic.<\/p>\n<\/div>","75":"<div class=\"md\"><p>Location: Northeast U.S. (Snowy in winter)\nPrice: $7k max, would like to stay around 5-6k\nUsed of course\nType: sports coupe\/hatch\/sedan\nMust haves: manual gearbox, before year 2000, not American, not a civic\nIntended use: daily driver\nVehicles I&#39;ve considered: BMW E36, E24, E28, E9, 240sx, mk3 supra, rx7, Subaru, AE86, Porsche 944\nThis will be my first vehicle. I can do minor work and I can learn how to do more major stuff. I would like something that is pretty fast and\/or fun to drive. Which of the vehicles listed above would be the best for me? Or what others have I missed that would be good for me? Thanks.\nEdit: added 944<\/p>\n<\/div>","76":"<div class=\"md\"><p>I love my car, but it is high-mileage, the wrong colour, and a bit too slow. I want a car to keep for many years that puts a smile on my face.<\/p>\n\n<p><strong>Location:<\/strong> Norway<\/p>\n\n<p><strong>Price range:<\/strong> equivalent to $12,000 max<\/p>\n\n<p><strong>New or used:<\/strong> Used. Can be 30+ years old.<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sports Car, Sedan, Hatchback<\/p>\n\n<p><strong>Must haves:<\/strong> Comfortable driving position for a 6&#39;2&quot; driver.<\/p>\n\n<p><strong>Intended use:<\/strong> Weekend\/vacation car. No daily commuting. Can store in garage during winter.<\/p>\n\n<p><strong>Vehicles I&#39;ve already considered:<\/strong> BMW 120i\/130i (5dr hatchback), Saab 900 pre-1993, Alfa Romeo 156 2.0\/2.5, Ford Focus ST.<\/p>\n\n<p><strong>Is this my 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> No<\/p>\n\n<p><strong>Can I do Minor work on my own vehicle:<\/strong> Change fluids, battery, wheels, bulbs and such. Nothing that requires advanced tools or equipment as I don&#39;t have anywhere to work on it (live in the city, park in a lot).<\/p>\n\n<p><strong>Can I do Major work on my own vehicle:<\/strong> No<\/p>\n<\/div>","77":"<div class=\"md\"><p>Just started a new job as a sales engineer where I will be travelling to customers and occasionally bringing them to events using my car. Current car is a 2001 Buick which won&#39;t cut it for this. Getting reimbursed $0.50\/mile when driving to customers.<\/p>\n\n<p><strong>Location:<\/strong> New England, USA<\/p>\n\n<p><strong>Price range:<\/strong> $15,000 - $20-000<\/p>\n\n<p><strong>New or used:<\/strong> Either<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan<\/p>\n\n<p><strong>Must haves:<\/strong> Decent gas mileage, trunk space, leather interior, 4 doors<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> 2010 Lexus ES350, 2013 Infiniti G37, 2013 Toyota Avalon\/Hybrid<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, second. Been driving my first car for 7 years<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> No, but it wouldn&#39;t hurt<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Yes but would like to put this off as long as possible<\/p>\n\n<p>Additional Notes: Going to be hauling about 100 lbs of products in my trunk on the way to customer sites.<\/p>\n\n<p>Thanks!<\/p>\n\n<p>edit: fixed formatting<\/p>\n<\/div>","78":"<div class=\"md\"><p><strong>Location:<\/strong> Colorado<\/p>\n\n<p><strong>Price range:<\/strong> $50,000 max<\/p>\n\n<p><strong>New or used:<\/strong> Either<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Luxury sedan or sports car<\/p>\n\n<p><strong>Must haves:<\/strong> AWD<\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> BMW 328i or Mercedes-benz C300<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Does your vehicle need to have a warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Additional Notes:<\/strong><\/p>\n<\/div>","79":"<div class=\"md\"><p>Location: Boston<\/p>\n\n<p>Price range: $5000 max<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Any that can hold 5 people and be durable enough for a 15 day road trip without any issues\nMust haves: durability<\/p>\n\n<p>Intended use: road trip<\/p>\n\n<p>Vehicles you&#39;ve already considered: none off the bat<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does your vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Not really <\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Renting a car one way will cost me a grand easy so Im thinking of getting something cheap and durable that I can ship back to cali at the end of the trip. Ideally something that would hold its value well so when I sell it again I wont lose a full grand. Also is it possible to buy a used car within 3 days or am I being delusional ( presuming that I can contact people beforehand, 3 days is just the time before the trip that I can see and inspect cars)<\/p>\n<\/div>","80":"<div class=\"md\"><p>My friend has a condo in south Florida where she used to live but now only sporadically spends a week or two throughout the year.  <\/p>\n\n<p>She has a 2008 Toyota Camry hybrid with roughly 95k miles on it that sits outside for the vast majority of the year without much use.  Occasionally a friend of hers will start it and run it.  It needs tires, brakes and a major service soon.  I&#39;m sketched out by the hybrid battery sitting around without much use as well.  Fortunately it is paid off.<\/p>\n\n<p>She needs to have a car there for when she is in town and renting and zip car wouldn&#39;t work.  I&#39;ve tried to suggest ditching the Camry and getting another used sedan\/hatchback of that era or earlier and getting something that won&#39;t be affected as much by sitting without use for months at a time and something that is much simpler to maintain and fix when it does ultimately break down.  I&#39;m not sure what that would be, or if it would just be better to ride it out with the current car in spite of the ever increasing maintenance costs and hybrid system concerns.<\/p>\n\n<p>The budget would have to be within a couple thousand dollars of whatever she could sell the Camry for at carmax, because if she does get rid of it she&#39;s need to do so quickly since she isn&#39;t there very long at any one time.   I don&#39;t think it&#39;s worth m more than 4-5 grand considering its condition.  What does <a href=\"\/r\/cars\">\/r\/cars<\/a> suggest?<\/p>\n<\/div>","81":"<div class=\"md\"><p>I&#39;m looking to get my first &quot;fun&quot; car AKA my first car that i am paying for and having say in. For work and personal reasons, i like the mid size range but i&#39;n flexible on size for the right look. I am not that into most of the new SUV&#39;s available mainly because im not that into the crossover look. I like more refined edges and the more rugged &quot;old school&quot; boxy look. Since i cant drive that fast legally, i much prefer offroad capability. My budget is around 25-35k. I&#39;m wondering what else might be out there...<\/p>\n\n<p>Some of my favorites so far are:<\/p>\n\n<pre><code>Toyota 4runner (not sure if this is safe)\nGMC Acadia\nJeep grand cherokee\n<\/code><\/pre>\n\n<p>Some features i like:<\/p>\n\n<pre><code>Winter capability\nSpace\nSafety\nHigher off the ground than avg.\n<\/code><\/pre>\n\n<p>Thank you in advance!<\/p>\n<\/div>","82":"<div class=\"md\"><p><strong>Location:<\/strong> Germany<\/p>\n\n<p><strong>Price range:<\/strong> 0-12500€ (0~13 600USD)<\/p>\n\n<p><strong>New or used:<\/strong> used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Mid-sized sporty car<\/p>\n\n<p><strong>Must haves:<\/strong> 4 or more seats<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Hyundai Veloster, Toyota GT68<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> no<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Additional Notes:<\/strong> So what I am looking for is quite difficult to find. I am searching for a car to drive on a daily base, taking 3 others with me (which is why I need 4 seats). As I am traveling about 100km (~62miles) a day it should be quite reliable. As fuel is quite expensive in germany my consumption shoud not be too high either. Now comes the tricky part: I want a car that does not look like every other car out there. I want something catchy, something people will look at because they dont see it on a daily base. I also really like the old edgy design so I thought about a Chevrolet Camaro V6 or Ford Mustang V5, but they are out of my reach in terms of consumption and money (mostly money). As stated above I already looked at the Hyundai Veloster and Toyota GT68. Problem ist, the GT only has 2+2 seats, which makes sitting in the back really uncomfortable, so I&#39;am stuck with the Veloster as my only choice. I honestly like the Veloster, but as there are not al lot of them (at least one the german market), there are not many choices of which I could pick one out that satisfies me completely. So does anyone know a car I overlooked on my desperate search?<\/p>\n\n<p>Thanks in advance.<\/p>\n<\/div>","83":"<div class=\"md\"><p>Don&#39;t know if im in the right thread, but has anyone had past experiences with the Lexus IS300 2jz? Im strongly considering to buy one<\/p>\n<\/div>","84":"<div class=\"md\"><p>Hey everyone, starting to think about getting a new car and was wondering what the thoughts were here. <\/p>\n\n<p>Location: Southern California<br\/>\nPrice Range: Around $500-$600\/month lease<br\/>\nNew or Used: New<br\/>\nType: Luxury\/Sports Sedan or Coupe<br\/>\nMust Haves: A little kick when I put my foot on the gas<br\/>\nIntended Use: Daily Driver<br\/>\nVehicles You&#39;ve considered: Maserati Ghibli, Mercedes C43 AMG, BMW M3, Mercedes E350, Audi S4<br\/>\nIs this your 1st vehicle: No<br\/>\nDoes the vehicle need a warranty: Probably not<br\/>\nCan you do minor work: Yep<br\/>\nCan you do major work: No<br\/>\nAdditional Notes: Currently driving a 2009 Accord, so anything is an upgrade really. I&#39;ve been wanting to upgrade for a while but have never really gotten down to it (the Accord runs fine). I want to get something nicer on a lease for a few years to enjoy, then go towards a more &quot;reasonable&quot; car for day to day life at the end of the lease. <\/p>\n<\/div>","85":"<div class=\"md\"><ul>\n<li>Location: NC, USA<\/li>\n<li>Price range: 25000~45000USD<\/li>\n<li>New or used: New preferred<\/li>\n<li>Type of vehicle: Luxury Sports Sedan \/ Coupe<\/li>\n<li>Must haves: Fuel Efficient, reliability, 220hp+, V6 preferred, RWD \/ AWD preferred<\/li>\n<li>Intended use: Daily Driver<\/li>\n<li>Vehicles you&#39;ve already considered: Lexus IS \/ RC, but a bit out of my price range<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: Yes<\/li>\n<li>Can you do Minor work on your own vehicle: No<\/li>\n<li>Can you do Major work on your own vehicle: No<\/li>\n<li>Additional Notes: Currently driving 2013 Toyota Camry, but getting bored of the lack of power and personality. Love the gas mileage though.<\/li>\n<\/ul>\n<\/div>","86":"<div class=\"md\"><p>Location: SC, USA<\/p>\n\n<p>Price range: 2500-5000 USD<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: What would a Civic\/Corolla be classified as?<\/p>\n\n<p>Must haves: Fuel Efficient, reliability, fun to drive, modability (heard civic&#39;s were good for this, but is an extremely minor concern of mine.)<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Toyota Corolla, Honda Civic (both 1997-2000 model years)<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: Not sure if applicable<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Does anyone think 5000 dollars is overkill for a older model Civic or Corolla, or is it a good idea to get the car with the best reliability? I posted about this before, but it seems it will take forever to get 5 grand, so can I lower my budget, or is it best to stick with the 5,000 dollars mark?<\/p>\n\n<p>Edit: Formatting and a few words<\/p>\n<\/div>","87":"<div class=\"md\"><p>• Location: San Francisco Bay Area<\/p>\n\n<p>• Price range: $15,000-$25,000<\/p>\n\n<p>• New or used: New or previous 2 model years, less than 30k miles <\/p>\n\n<p>• Type of vehicle: Subcompact Crossover or Hatchback<\/p>\n\n<p>• Must haves: Fuel Efficiency, Some power, Shorter Length (For easier parking. Not talking Fiat-level. Just something about the length of a 2008 Honda Fit, which I Drive currently. )<\/p>\n\n<p>• Intended use: Commuter vehicle. Drive about 35 miles each day, some of it is bumper to bumper, some of it a lot faster, so the card would have to accommodate both those conditions. Requires enough power to overtake easily.) <\/p>\n\n<p>• Vehicles you&#39;ve already considered: Mazda CX-3, VW GOLF or GTI, Kia Forte5, Hyundai Elantra GT, Scion\/Toyota iM<\/p>\n\n<p>• Is this your 1st vehicle: No<\/p>\n\n<p>• Does the vehicle need to have a warranty: No<\/p>\n\n<p>• Can you do Minor work on your own vehicle: No<\/p>\n\n<p>• Can you do Major work on your own vehicle: No<\/p>\n\n<p>• Additional Notes:<\/p>\n\n<p>I want something to last at least 10 years. I like the feel of DCT but open to something with nice automated-manual.  <\/p>\n<\/div>","88":"<div class=\"md\"><ul>\n<li><strong>Location:<\/strong> Alberta (Canada).<\/li>\n<li><strong>Price range:<\/strong> $4000 - $5000 upfront. I am willing to pay up to  $10000 if I can get financing.<\/li>\n<li><strong>New or used:<\/strong> Used so long as I can get a better looking car.<\/li>\n<li><strong>Type of vehicle:<\/strong> Sedan.<\/li>\n<li><strong>Must haves:<\/strong> None.<\/li>\n<li><strong>Intended use:<\/strong> Daily Driver.<\/li>\n<li><strong>Vehicles you&#39;ve already considered:<\/strong> None.<\/li>\n<li><strong>Is this your 1st vehicle:<\/strong> Yes.<\/li>\n<li><strong>Does the vehicle need to have a warranty:<\/strong> No.<\/li>\n<li><strong>Can you do Minor work on your own vehicle:<\/strong> So long as it can be found on YouTube.<\/li>\n<li><strong>Can you do Major work on your own vehicle:<\/strong> No.<\/li>\n<li><strong>Additional Notes:<\/strong> I want a good looking car. I don&#39;t mind used cars so long as painting is fine and interior doesn&#39;t look nasty.<\/li>\n<\/ul>\n<\/div>","89":"<div class=\"md\"><p>Location: South east Texas \nPrice: under 5-10k would be awesome\nNew or used? Used or vintage\nType: turbocharged or sports\nMust haves: easy to work on, easily accessible parts. Air conditioning \nIntended use: learn to work on \nConsidered: old mustang, camaros, mij, volvo\nNot first car. \nI&#39;ve done small work to cars before. I&#39;ve always wanted to do more!<\/p>\n\n<p>This is where you stop reading the post if you&#39;re easily frustrated. <\/p>\n\n<p>I currently drive a 2008 Volkswagen gti (timing belt version). It is a hardcore commuter with 135k miles on the clock. There is nothing inherently wrong with this car other then bearing the scars of rings long time commuter (chipped windshield, rough interior, countless rock chips, lower front valence missing, 2-3 Fender benders)<\/p>\n\n<p>I figure this car will soldier on for a few more years.<\/p>\n\n<p>What I really want is a car that I can learn to work on. I currently live in an apt, but I may be able to get a garage space. <\/p>\n\n<p>My best guess for getting a performance car that I could dig into and work on in Texas was a mustang. <\/p>\n\n<p>Input, or suggestions on how to learn this stuff are very welcome. <\/p>\n<\/div>","90":"<div class=\"md\"><p>Location: Saudi Arabia.<\/p>\n\n<p>Price range: 90,000-130,000 SAR (Financed).<\/p>\n\n<p>New or used: New.<\/p>\n\n<p>Type of vehicle: Sports Car.<\/p>\n\n<p>Must haves: Fuel efficient.<\/p>\n\n<p>Intended use: Daily Driver, need backseats just incase even with small headroom and legroom.<\/p>\n\n<p>Vehicles you&#39;ve already considered: VW Scirocco and CC, Ford Mustang EcoBoost, Chevrolet Camaro V6, Mercedes-Benz C-Class Coupe (possible to stretch my budget as I am financing the car).<\/p>\n\n<p>Is this your 1st vehicle: Nope, had a 2006 VW passat 2.0 petrol engine and right now a 2009 Mazda CX-9 because my family needed a big suv, not anymore so here I am.<\/p>\n\n<p>Does the vehicle need to have a warranty: Yes.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Can refill wiper water, inflate tire and that&#39;s it.<\/p>\n\n<p>Can you do Major work on your own vehicle: Nope.<\/p>\n\n<p>Additional Notes: prefer a european car that is affordable, reliable and dependable while retaining minimum luxury feel and fun to drive and handle that are not found in econoboxes.<\/p>\n<\/div>","91":"<div class=\"md\"><p>You choose a book for reading<\/p>\n<\/div>","92":"<div class=\"md\"><p>Location: USA (Southwest\/Arizona)<\/p>\n\n<p>Price range: Open to financing a sizable purchase (but not preferred), could do like a $20,000-$30,000 down payment if I had to. If it was an all cash purchase (no financing), I could do up to $40,000. (Note this isn&#39;t my bank account limit, this is simply a personal limit that won&#39;t stretch my finances too far, and will leave me with money to cover maintenance and repairs).<\/p>\n\n<p>New or used: Either, prefer used because of depreciation.<\/p>\n\n<p>Type of vehicle: High-End Luxury\/Supercar<\/p>\n\n<p>Must haves: Automatic transmission<\/p>\n\n<p>Intended use: Daily Driver during the Summer<\/p>\n\n<p>Vehicles you&#39;ve already considered: Maserati Quatroporte, Maserati GT<\/p>\n\n<p>Is this your 1st vehicle: No (Jaguar XJ8, Jaguar XJ6, and a Jaguar XK8 were my prior ones)<\/p>\n\n<p>Does the vehicle need to have a warranty: No, but that&#39;d be nice<\/p>\n\n<p>Can you do Minor work on your own vehicle: I know how to put gas in it. <\/p>\n\n<p>Can you do Major work on your own vehicle: Nope.<\/p>\n\n<p>Additional Notes: Nothing that looks like an 80s\/90s car (Looking at you Lotus Espirit) essentially no cars with that flat hood, pointed front bumper, type of deal. I can&#39;t stand that look. Also not a huge fan of the more conservative German\/American body styles (BMW M5s, Corvettes, and such).<\/p>\n\n<p>Also, yes I know repairs are crazy expensive and tires will run me thousands of dollars. I know this is an expensive purchase and will cost a lot every year to run. I&#39;m just looking for advice on options that fit my criteria.<\/p>\n\n<p>Thanks guys!<\/p>\n<\/div>","93":"<div class=\"md\"><p>You can buy my car..tuned e92 335xi pushing ~420awhp on my daily tune at ~15psi boost :)<\/p>\n<\/div>","94":"<div class=\"md\"><ul>\n<li><p>Location: Chicago (city proper)<\/p><\/li>\n<li><p>Price range: &lt;$30,000<\/p><\/li>\n<li><p>New or used: New<\/p><\/li>\n<li><p>Type of vehicle: SUV<\/p><\/li>\n<li><p>Must haves: 4x4 or AWD<\/p><\/li>\n<li><p>Intended use: Grocery getter\/weekend car\/interstate travel<\/p><\/li>\n<li><p>Vehicles you&#39;ve already considered: Jeep Cherokee, Mazda CX-5, Nissan Murano (will be test-driving all three next weekend)<\/p><\/li>\n<li><p>Is this your 1st vehicle: No, but we&#39;ve been carless for 6 years. <\/p><\/li>\n<li><p>Does the vehicle need to have a warranty: Yes. <\/p><\/li>\n<li><p>Can you do Minor work on your own vehicle: No<\/p><\/li>\n<li><p>Can you do Major work on your own vehicle: No<\/p><\/li>\n<li><p>Additional Notes:<\/p><\/li>\n<\/ul>\n\n<p>No Subaru. I know car people love them, but I do not.<\/p>\n<\/div>","95":"<div class=\"md\"><ul>\n<li>Location: Illinois (About 15 minutes from downtown Chicago)<\/li>\n<li>Price range: &lt;$15000<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: SUV<\/li>\n<li>Must haves: Fuel efficient &amp; Safety Features<\/li>\n<li>Intended use: Daily driving to school &amp; work. Weekend outing(party etc.)<\/li>\n<li>Vehicles you&#39;ve already considered: None so far<\/li>\n<li>Is this your 1st vehicle: Yes<\/li>\n<li>Does the vehicle need to have a warranty: Yes<\/li>\n<li>Can you do Minor work on your own vehicle: No<\/li>\n<li>Can you do Major work on your own vehicle: Not<\/li>\n<li>Additional Notes: Looking for a really safe SUV for the budget that I have. As noted above, safety features on the SUV would be great. Not sure on the specificity of the safety feature since I am not very knowledgeable on the subject cars. Although I just had an accident in which totaled my car ( random tire was flying on the way and totaled my car). Hence I need a possible safest SUV available within reach. It would be great if the said SUV recommendation is aesthetic but I value safety more than anything. Thank you for the recommendations in advance.<\/li>\n<li>Edit: Formatting<\/li>\n<li>Edit 2: &lt;$15000 instead of $150000<\/li>\n<\/ul>\n<\/div>","96":"<div class=\"md\"><p>Location:Massachusetts, MA\nPrice Range: Max $6000\nUsed\nType of Car: Sports Car, Car\nMust Haves: Nothing\nIntended Use: Daily Driver, Fun Car\nVehicles I&#39;ve already considered: Subaru WRX, Mitsubishi Eclipse\nIs this your first car: Yes\nNo warranty\nMinor work: Yes\nMajor Work: No<\/p>\n\n<p>I&#39;m open to anything! Thanks :)<\/p>\n<\/div>","97":"<div class=\"md\"><p>Honestly, Toyota GT86\/BRZ\/FRS<\/p>\n<\/div>","98":"<div class=\"md\"><p>(This is research and questions related to a future purchase)\nLocation: United States, Western North Carolina mountains. \/ \nPrice Range: $60,000 \/ \nCondition: Used \/ \nType: Sports Car \/ \nMust Have: Superb handling for twisty roads and track days, fast throttle response (big turbo lag is a no go), AWD preferred, no convertibles \/ \nVehicles Considered: Nissan Skyline R33 GTR, Porsche 993 \/ \n1st Vehicle:  No \/ \nWarranty: No \/ \nMinor Work: Yes \/ \nMajor Work: No <\/p>\n\n<p>Notes: I finally have a job that, in the next few years once the house is paid off, will allow me to comfortably purchase a car purely for weekend enjoyment.  I live in the middle of some of the best technical mountain roads in the United States and want a car that performs as well as my motorcycle in the twisties and the track.  I do plan on several major upgrades to whatever vehicle I buy, specifically power adders to at least 500 hp at the wheels and a sequential transmission.  Many of our roads are very nice and well groomed, but some can be quite rough, so the car needs to be able to be set up to handle some choppy asphalt on occasion.  <\/p>\n\n<p>I&#39;ve always had my heart set on a R34 Skyline GTR, but the prices of good condition cars seem to be rising and may be out of my budget by the time they are importable to the US.  The R33 are cheaper by a good bit right now and I do like they way they look.  Performance is my main goal, though good looks is a close second.  I want to feel pride in the car and enjoy sharing it with others.  Are there any other cars that are both good looking and handle like a laser beam on rails?<\/p>\n<\/div>","99":"<div class=\"md\"><p>Been getting a lot of that. Thx. <\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1,"77":1,"78":1,"79":1,"80":1,"81":1,"82":1,"83":1,"84":1,"85":1,"86":1,"87":1,"88":1,"89":1,"90":1,"91":1,"92":1,"93":1,"94":1,"95":1,"96":1,"97":1,"98":1,"99":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null,"77":null,"78":null,"79":null,"80":null,"81":null,"82":null,"83":null,"84":null,"85":null,"86":null,"87":null,"88":null,"89":null,"90":null,"91":null,"92":null,"93":null,"94":null,"95":null,"96":null,"97":null,"98":null,"99":null},"comment_edited":{"0":1477402331.0,"1":false,"2":false,"3":1477406146.0,"4":1477428367.0,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":1477429973.0,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":1477506442.0,"37":false,"38":false,"39":false,"40":1477520635.0,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":1550336061.0,"59":false,"60":false,"61":false,"62":1477677941.0,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":1477847703.0,"75":false,"76":1477862047.0,"77":1477875236.0,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":1555889302.0,"92":1477421719.0,"93":false,"94":false,"95":1477792654.0,"96":false,"97":false,"98":false,"99":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":false,"97":false,"98":false,"99":false},"comment_score":{"0":7,"1":8,"2":5,"3":3,"4":4,"5":3,"6":3,"7":3,"8":3,"9":3,"10":3,"11":3,"12":2,"13":2,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1,"77":1,"78":1,"79":1,"80":1,"81":1,"82":1,"83":1,"84":1,"85":1,"86":1,"87":1,"88":1,"89":1,"90":1,"91":1,"92":1,"93":1,"94":0,"95":0,"96":0,"97":0,"98":0,"99":0},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":false,"97":false,"98":false,"99":false},"author_id":{"0":"fdewc","1":"dgbwz","2":"","3":"","4":"o2b3d","5":"sb6nh","6":"12dda3","7":"gputx","8":"6z12m","9":"da5zb","10":"","11":"acxkp","12":"712gn","13":"","14":"","15":"4obkk","16":"d7dbo","17":"a75yv","18":"fz5st","19":"5hhtm","20":"","21":"eihz6","22":"9dcl3","23":"","24":"c3yhh","25":"12dtqx","26":"","27":"kjg53","28":"","29":"114a3f","30":"k6hux","31":"95de5","32":"obqvj","33":"","34":"c7m43","35":"9d29l","36":"","37":"4qj4s","38":"","39":"9phid","40":"ais99","41":"6hedb","42":"3h477","43":"10wd5o","44":"","45":"","46":"","47":"","48":"f1dxo","49":"","50":"jyuu9","51":"","52":"","53":"5zuu5","54":"","55":"","56":"wpz1n","57":"kilyu","58":"3vj2d","59":"9487c","60":"fyb17","61":"12frr3","62":"z0u5k","63":"4wa8v","64":"kzdmb","65":"h8b72","66":"4b9h2","67":"","68":"tzkss","69":"wg42j","70":"m0tav","71":"bidax","72":"gsitu","73":"s4y4x","74":"gvobc","75":"u9n0e","76":"","77":"84n61","78":"6cs7r","79":"679dj","80":"37flm","81":"o3vgl","82":"12i1e5","83":"hs7f4","84":"3ufqu","85":"75oiz","86":"ntiuo","87":"ksthi","88":"b2u3y","89":"","90":"liofp","91":"","92":"nsoev","93":"efisy","94":"6vu4h","95":"","96":"n5t2g","97":"moinq","98":"12eq8d","99":"s4y4x"},"author_name":{"0":"keokl","1":"mocfusing","2":"","3":"","4":"Isogen_","5":"Nintheagle501","6":"throwaway_askcars","7":"squirrel_underwear","8":"Sidekicknicholas","9":"GeneralHabberdashery","10":"","11":"impulse191","12":"WaffIes","13":"","14":"","15":"PrettyCommon","16":"AmberWoo","17":"ledzep15","18":"heyhey91","19":"NordtheNeg","20":"","21":"CaptainSnookumz","22":"Bloxlord","23":"","24":"Thoraxe42","25":"gms57","26":"","27":"heyoitsben","28":"","29":"ActualAutism","30":"SazzyPazz","31":"AmbrosePhoenix","32":"argent_pixel","33":"","34":"Thorwittahaircut","35":"SCAND1UM","36":"","37":"inflammable","38":"","39":"Polarbeareatsswaggot","40":"badogski29","41":"_fortune","42":"jabalsad","43":"Deliwoot","44":"","45":"","46":"","47":"","48":"OGNinjaDon","49":"","50":"ChronicCynic","51":"","52":"","53":"zanmanoodle","54":"","55":"","56":"bunkerjohnson","57":"Kjty21","58":"cardern","59":"bubbavona","60":"chocolate_babies","61":"ashari3","62":"MyIQis76","63":"rainman4","64":"hotrodman","65":"Cris1104","66":"xzzz","67":"","68":"kbuckets","69":"namseoyeon","70":"Enfants","71":"jartin47","72":"__nullptr_t","73":"rodo1116","74":"Champan7","75":"reinhard420","76":"","77":"Gn4rlyBrown","78":"D_Web","79":"thebigm101","80":"atmarcin","81":"-zmw-","82":"llRunner007ll","83":"Vetroza","84":"thenation7","85":"viperabyss","86":"Teknotokon_II","87":"philiptake2","88":"MaikelChumaher","89":"","90":"Arabian_Wolf","91":"","92":"DEVGRU_P","93":"idirtbike","94":"AngryGlenn","95":"","96":"icedearth665","97":"kens325","98":"TangoDeltaFoxtrot","99":"rodo1116"}}