{"comment_id":{"0":"demnzfz","1":"demnitl","2":"den4qhi","3":"depqm92","4":"demnphf","5":"demr970","6":"den46bo","7":"denqewv"},"comment_parent_id":{"0":"t3_5y2im4","1":"t3_5y2im4","2":"t3_5y2im4","3":"t3_5y2im4","4":"t3_5y2im4","5":"t3_5y2im4","6":"t3_5y2im4","7":"t3_5y2im4"},"comment_created_utc":{"0":1488913698.0,"1":1488913198.0,"2":1488932787.0,"3":1489079544.0,"4":1488913399.0,"5":1488917254.0,"6":1488932038.0,"7":1488974164.0},"comment_body":{"0":"<div class=\"md\"><p>I vastly prefer a single own thread for each new car release. Megathreads are messy and hard to have discussion about some individual thing because everything is drowned in the same mess <\/p>\n\n<p>There was already a lot of discussion about different new cars in their own threads and now they&#39;re all deleted and we have this megathread which will get a fraction of the attention those previous threads got   <\/p>\n\n<p>Its just shitty<\/p>\n<\/div>","1":"<div class=\"md\"><p>In <a href=\"\/r\/pcgaming\">\/r\/pcgaming<\/a> we run megathreads regularly for big shows\/conventions and major releases, but we format it a little differently. The idea is the same (to clean up the sub during hot events), but if we remove someone&#39;s post or if they post a link in the megathread we credit them with the source in the thread&#39;s main body. <a href=\"https:\/\/www.reddit.com\/r\/pcgaming\/comments\/3s4q1g\/fallout_4_megathread\/\">Here&#39;s an example with the Fallout 4 megathread.<\/a> It helps with some of the &quot;I got swept up&quot; issues and gives credit to people who dig out good information.<\/p>\n\n<p>Putting some formatting effort into the megathread to make it more useful and easier to read will help, I think. Our users will ask the mod team if we can spin up a megathread if it looks like something is crashing into the sub in high volume.<\/p>\n\n<blockquote>\n<p>If we didn&#39;t, 70% of the daily posts on <a href=\"\/r\/Cars\">\/r\/Cars<\/a> would be &quot;What Car Should I Buy Posts&quot;.<\/p>\n<\/blockquote>\n\n<p>Hah, yeah about that... On <a href=\"\/r\/cars\/new\">\/r\/cars\/new<\/a> there&#39;s a lot of trash that Automod isn&#39;t catching. But that&#39;s probably a discussion for a different feedback thread.<\/p>\n\n<p>Edit: I&#39;ve since joined the mod team so Automod will be straightened out tout suite!<\/p>\n<\/div>","2":"<div class=\"md\"><p>I can appreciate what you&#39;re saying.<\/p>\n\n<p>That being said, nobody likes posting in megathreads and nobody likes even clicking on them.<\/p>\n\n<p>I understand it for events like races and\/or breaking news, but not for car shows.<\/p>\n\n<p>I just want to come to <a href=\"\/r\/cars\">\/r\/cars<\/a> and see the reveal articles on the main page.<\/p>\n<\/div>","3":"<div class=\"md\"><p>Could <a href=\"\/r\/cars\">\/r\/cars<\/a> implement subject filters like how some of the news subs do?<\/p>\n<\/div>","4":"<div class=\"md\"><p>One thing I think might help with the use of those mega threads is if they could be stickied to the top even when sorting by &quot;new&quot; instead of &quot;hot&quot;.<\/p>\n<\/div>","5":"<div class=\"md\"><p>I&#39;m very much pro-megathread. I just wish more people would read the gorram rules and post appropriately. The &quot;What car should I buy&quot; threads are intensely irritating as they <em>still<\/em> happen so frequently, and even with RES filters it&#39;s annoying to see them. The signal:noise ratio drops substantially when people don&#39;t use the megathreads. <\/p>\n<\/div>","6":"<div class=\"md\"><p>I agree. Not sure why everyone hopped on the mod hate bandwagon with that Geneva megathread.<\/p>\n<\/div>","7":"<div class=\"md\"><p>I understand you mods want to reduce your workload, but it ends up giving a worse experience for all of us non-mods. The frontpage should be full of posts of exciting new models presented at Geneva, instead we have one lousy &quot;mega&quot;thread with 47 comments.. <\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null},"comment_edited":{"0":false,"1":1488935611.0,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false},"comment_score":{"0":82,"1":12,"2":7,"3":2,"4":1,"5":-3,"6":-1,"7":0},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false},"author_id":{"0":"","1":"caebw","2":"dehy1","3":"f1b56","4":"cby4h","5":"5iwkv","6":"bd8ca","7":"sfiil"},"author_name":{"0":"springinslicht","1":"code-sloth","2":"Tomes2789","3":"MJOLNIRdragoon","4":"Tangent_","5":"brandonsmash","6":"dannysmackdown","7":"p001n100"}}