{"comment_id":{"0":"dprhcn6","1":"dprncqp","2":"dpsi2ss","3":"dpu9ov1","4":"dpucz89","5":"dps2ljj","6":"dprhstd","7":"dprg7h4","8":"dprtequ","9":"dpt1u8y","10":"dptcqpe","11":"dpug18u","12":"dpvys7b","13":"dpywe8x","14":"dq0brns","15":"dps398p","16":"dptna7h","17":"dpu6b59","18":"dpv2cv9","19":"dpvbmws","20":"dpvkv8k","21":"dpvl67m","22":"dpvldmk","23":"dpxx5fo","24":"dpyp9t7","25":"dpzo4rh","26":"dq01yyn","27":"dprwu1k","28":"dps1hou","29":"dps1s0s","30":"dps7o8h","31":"dpsccn9","32":"dpsdpla","33":"dpsjnz3","34":"dpsk3el","35":"dpu3vnx","36":"dpu643d","37":"dpu6d9e","38":"dpv0aya","39":"dpw2qc1","40":"dpw82rc","41":"dpw9v51","42":"dpwcwej","43":"dpwubvi","44":"dpwztsm","45":"dpx2zdt","46":"dpxcwd6","47":"dpxq97q","48":"dpxuoad","49":"dpy5uxc","50":"dpy7za9","51":"dpy97jp","52":"dpyd1ue","53":"dpyqg31","54":"dpyr4l2","55":"dpz5lm8","56":"dpzialn","57":"dpzodvo","58":"dpzoh1j","59":"dpzqc44","60":"dpzxbtb","61":"dq01wna","62":"dq063oc","63":"dq09cjx","64":"dq1iil8","65":"dq1lksj","66":"dq1po3l","67":"dq1ubpw","68":"dq1z08m","69":"dq27cbk","70":"dq2bytk","71":"dq2ocva","72":"dq2shy5","73":"dq3e8u7","74":"dpyy71w","75":"dpywk17","76":"dps8jhr","77":"dpwt90o","78":"dq1ywrw","79":"dq55o15","80":"dpw5e9b","81":"dpt405z"},"comment_parent_id":{"0":"t3_7coe78","1":"t3_7coe78","2":"t3_7coe78","3":"t3_7coe78","4":"t3_7coe78","5":"t3_7coe78","6":"t3_7coe78","7":"t3_7coe78","8":"t3_7coe78","9":"t3_7coe78","10":"t3_7coe78","11":"t3_7coe78","12":"t3_7coe78","13":"t3_7coe78","14":"t3_7coe78","15":"t3_7coe78","16":"t3_7coe78","17":"t3_7coe78","18":"t3_7coe78","19":"t3_7coe78","20":"t3_7coe78","21":"t3_7coe78","22":"t3_7coe78","23":"t3_7coe78","24":"t3_7coe78","25":"t3_7coe78","26":"t3_7coe78","27":"t3_7coe78","28":"t3_7coe78","29":"t3_7coe78","30":"t3_7coe78","31":"t3_7coe78","32":"t3_7coe78","33":"t3_7coe78","34":"t3_7coe78","35":"t3_7coe78","36":"t3_7coe78","37":"t3_7coe78","38":"t3_7coe78","39":"t3_7coe78","40":"t3_7coe78","41":"t3_7coe78","42":"t3_7coe78","43":"t3_7coe78","44":"t3_7coe78","45":"t3_7coe78","46":"t3_7coe78","47":"t3_7coe78","48":"t3_7coe78","49":"t3_7coe78","50":"t3_7coe78","51":"t3_7coe78","52":"t3_7coe78","53":"t3_7coe78","54":"t3_7coe78","55":"t3_7coe78","56":"t3_7coe78","57":"t3_7coe78","58":"t3_7coe78","59":"t3_7coe78","60":"t3_7coe78","61":"t3_7coe78","62":"t3_7coe78","63":"t3_7coe78","64":"t3_7coe78","65":"t3_7coe78","66":"t3_7coe78","67":"t3_7coe78","68":"t3_7coe78","69":"t3_7coe78","70":"t3_7coe78","71":"t3_7coe78","72":"t3_7coe78","73":"t3_7coe78","74":"t3_7coe78","75":"t3_7coe78","76":"t3_7coe78","77":"t3_7coe78","78":"t3_7coe78","79":"t3_7coe78","80":"t3_7coe78","81":"t1_dpt3b7l"},"comment_created_utc":{"0":1510596291.0,"1":1510602137.0,"2":1510634601.0,"3":1510716552.0,"4":1510720575.0,"5":1510617172.0,"6":1510596740.0,"7":1510595167.0,"8":1510607870.0,"9":1510672080.0,"10":1510682666.0,"11":1510725143.0,"12":1510796767.0,"13":1510942655.0,"14":1511024725.0,"15":1510617900.0,"16":1510692659.0,"17":1510712883.0,"18":1510763275.0,"19":1510772155.0,"20":1510781180.0,"21":1510781482.0,"22":1510781695.0,"23":1510888327.0,"24":1510935393.0,"25":1510976632.0,"26":1511009598.0,"27":1510611078.0,"28":1510615959.0,"29":1510616274.0,"30":1510622908.0,"31":1510627944.0,"32":1510629392.0,"33":1510636926.0,"34":1510637602.0,"35":1510710187.0,"36":1510712665.0,"37":1510712949.0,"38":1510761226.0,"39":1510801410.0,"40":1510808122.0,"41":1510810820.0,"42":1510816192.0,"43":1510847785.0,"44":1510853142.0,"45":1510856155.0,"46":1510865707.0,"47":1510880610.0,"48":1510885628.0,"49":1510900148.0,"50":1510904539.0,"51":1510907473.0,"52":1510917602.0,"53":1510936591.0,"54":1510937283.0,"55":1510952354.0,"56":1510968170.0,"57":1510977029.0,"58":1510977168.0,"59":1510980244.0,"60":1510995994.0,"61":1511009443.0,"62":1511017129.0,"63":1511021672.0,"64":1511092040.0,"65":1511099649.0,"66":1511106861.0,"67":1511112991.0,"68":1511118228.0,"69":1511127025.0,"70":1511132073.0,"71":1511146645.0,"72":1511151445.0,"73":1511192434.0,"74":1510944521.0,"75":1510942819.0,"76":1510623840.0,"77":1510846687.0,"78":1511118122.0,"79":1511277876.0,"80":1510804557.0,"81":1510674316.0},"comment_body":{"0":"<div class=\"md\"><p>Location: Colorado<\/p>\n\n<p>Price range: $30k max<\/p>\n\n<p>New or used: Either. If used, 3 or less years old. Would like some manufacturer warranty still.<\/p>\n\n<p>Type of vehicle: Smaller car ideally. Hatch-ish <\/p>\n\n<p>Must haves: Turbo, kid\/baby-able, 4 doors ideal, but can be tempted for 2. Cannot be ass-terrible even with snow tires on in the snow<\/p>\n\n<p>Desired transmission: Manual ideal, but not required.<\/p>\n\n<p>Intended use: fun DD<\/p>\n\n<p>Vehicles you&#39;ve already considered: GTi, Golf R, Focus RS, Camaro SS 1LE, Fiesta ST, Focus ST, Mustang GT, S2K<\/p>\n\n<p>Is this your 1st vehicle: not at all<\/p>\n\n<p>Does the vehicle need to have a warranty: yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: absolutely<\/p>\n\n<p>Can you do Major work on your own vehicle: absolutely, but dont want to for this car (Read: I want reliable)<\/p>\n\n<p>Additional Notes: I have a boosted E30, and want a DD that does not feel as slow as a fully loaded semi. Ideally, a really fun, modable (hence the turbo req), and practical car. Also, I&#39;ve always enjoyed smaller cars.  <\/p>\n<\/div>","1":"<div class=\"md\"><p>Location: Eastern Pennsylvania. Near Pottstown area. <\/p>\n\n<p>Price Range: $8-10k<\/p>\n\n<p>New or Used: Used<\/p>\n\n<p>Type of Vehicle: Sedan, not too small <\/p>\n\n<p>Must Haves: 4 doors, bluetooth desirable but not required, decent sound, keyless ignition would be awesome but obviously that’s difficult with my price range<\/p>\n\n<p>Desired Transmission: Auto<\/p>\n\n<p>Intended Use: Driving to work and college<\/p>\n\n<p>Vehicles I’ve Considered: Ford Focus, Ford Fusion, Hyundai Elantra, Chevy Cruze <\/p>\n\n<p>1st Vehicle: No<\/p>\n\n<p>Warranty: Would be nice to have<\/p>\n\n<p>Can you do minor work: Some stuff, really depends on it<\/p>\n\n<p>Major Work: No<\/p>\n\n<p>Additional Notes: I’m looking to have around a $2000 down payment and pay the rest over 3 or 4 years so I want a car that will last longer than that. Ideally hoping to get a car that will last around 10 years or so. Has to have 65k miles or less<\/p>\n<\/div>","2":"<div class=\"md\"><p>Im finally working full time and have money saved up for a down payment the absolute max is 25k (financed) and I&#39;ve narrowed it down. <\/p>\n\n<p>13-14 mustang gt <\/p>\n\n<p>Higher mileage v10 m5<\/p>\n\n<p>Blob eye sti<\/p>\n\n<p>Evo x<\/p>\n\n<p>99-04 terminator<\/p>\n\n<p>Pros and cons of each? Any thoughts are appreciated.<\/p>\n<\/div>","3":"<div class=\"md\"><p>Location: USA<\/p>\n\n<p>Price range: Like $25,000-ish, hopefully less for a hobby car.<\/p>\n\n<p>New or used: Used duh<\/p>\n\n<p>Type of vehicle: Anything<\/p>\n\n<p>Must haves: Charm<\/p>\n\n<p>Desired transmission: Manual unless there&#39;s something neat or particularly good about the auto.<\/p>\n\n<p>Intended use: Provide smiles.<\/p>\n\n<p>Vehicles you&#39;ve already considered: S2000s, C3 &#39;Vettes, Isuzu VehiCROSS, Wranglers, old diesel Mercedes sedans.<\/p>\n\n<p>Is this your 1st vehicle: Nope.<\/p>\n\n<p>Does the vehicle need to have a warranty: Lol no.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yarp.<\/p>\n\n<p>Can you do Major work on your own vehicle: Will outsource interior and body work.<\/p>\n\n<p>Additional Notes:\nI like weird cars. I grew up around classic cars from the company Intermeccanica. My first car was a Saab 9-3 Viggen. My second, which I had until very recently, was a 1967 right-hand drive MGB GT. I&#39;ve owned a VW Westfalia Vanagon camper. I currently have a Fiat 500 Abarth which I purchased because of its great gas mileage and the smile it puts on my face when I start it up for my morning commute. I like weird cars.<\/p>\n\n<p>What are some of the weirdest, most charming cars that have the most character. There are a lot of cars that are phenomenal on paper but have no soul, like anything sold by Acura. Then there are cars like the 500 Abarth that have just enough performance to be interesting and have personality in spades.<\/p>\n\n<p>I&#39;m in stage one of beginning to shop for a new hobby car. All limitations are off. I just want something that gives me pride to own the way my MG did and my Abarth does. Are there any SUVs you can think of that have personality? How about sleeper cars, like the E63 AMG\/R63 AMG but affordable to normal people?<\/p>\n\n<p>tl:dr - What are some cars you&#39;ve owned or experienced that made great talking points, raised eyebrows, and generally left you with a smile on your face? Cars that may or may not be good on paper, but are still good cars?<\/p>\n<\/div>","4":"<div class=\"md\"><p>Location: Georgia, specifically around the Dallas-Acworth area<\/p>\n\n<p>Price range: Maximum is 10k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Preferably some type of sports car. A convertible is fine too<\/p>\n\n<p>Must haves: RWD, preferably a V8 but a V6 is fine too I just want something powerful enough. Something easily modded would be nice too<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic. A dual clutch transmission with a semi-manual mode would be nice but not necessary<\/p>\n\n<p>Intended use: Daily driver, but I also want it to be something I can show off to friends<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mustangs, 350Z, Saturn Sky, Challengers. Think I&#39;m leaning most towards a Challenger SXT<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: Preferably<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Probably<\/p>\n\n<p>Additional Notes: I want something that is fun to drive but can also be showed off to friends (powerful, donuts, things like that) and I want it to be something that people notice and say &quot;Woah, check that out&quot; but I don&#39;t know how possible that is with my price range<\/p>\n<\/div>","5":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","6":"<div class=\"md\"><p>Location: Oregon, USA<\/p>\n\n<p>Price range: Definitely under $30k, preferably in the $18k-$25k range<\/p>\n\n<p>New or used: Either (with a preference for newer used)<\/p>\n\n<p>Type of vehicle: Crossover, SUV, Wagon, Hatchback<\/p>\n\n<p>Must haves: Backup camera, bluetooth, decent snow handling (4wd\/awd or just &quot;it&#39;ll be fine with winter tires&quot;), enough room in the back for a ~75 lb dog<\/p>\n\n<p>Desired transmission: Either<\/p>\n\n<p>Intended use: Daily driver\/family car<\/p>\n\n<p>Vehicles you&#39;ve already considered: (None of these really call to me in a big way) Subaru Crosstrek, Subaru Forester, VW Golf, Honda HRV<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Right now I drive an 04 Kia Sorento. I like that with 4wd and the decent clearance I have never felt like any amount of snow was a real impediment to my driving,  and I&#39;d like to keep that. On the transmission side, I&#39;ve driven stick my whole life but am considering switching to automatic because of the type of traffic I often find myself in. <\/p>\n<\/div>","7":"<div class=\"md\"><p>• Location: Dallas<\/p>\n\n<p>• Price range: up to 13,000<\/p>\n\n<p>• New or used: used<\/p>\n\n<p>• Type of vehicle: Sedan<\/p>\n\n<p>• Must haves: Reliability, longevity, good looks, fun<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): doesn&#39;t matter<\/p>\n\n<p>• Intended use: family car<\/p>\n\n<p>• Vehicles you&#39;ve already considered: Camry, Corolla, Mazda 6, G35<\/p>\n\n<p>• Is this your 1st vehicle: first newish vehicle<\/p>\n\n<p>• Does the vehicle need to have a warranty: preferred<\/p>\n\n<p>• Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: no<\/p>\n\n<p>• Additional Notes: Going to finance my first car through a dealership<\/p>\n<\/div>","8":"<div class=\"md\"><p>Location: Austin, TX\nPrice range:  $10-15k\nNew or used:Used\nType of vehicle: (Sedan)\nMust haves: Good safety (got a baby), 4 door, Something standard but on the sporty side\nDesired transmission Automatic\nIntended use: Daily driver\nVehicles you&#39;ve already considered: Subaru Impreza, Honda Civic\nIs this your 1st vehicle:No\nDoes the vehicle need to have a warranty:No\nCan you do Minor work on your own vehicle: Yes\nCan you do Major work on your own vehicle: No\nAdditional Notes: Looking to get something that&#39;s going to last me awhile. Like I said, I want something I can have both a car to drive my kid around but not go full Dad car lol<\/p>\n<\/div>","9":"<div class=\"md\"><p>Location: Ontario, Canada (GTA)<\/p>\n\n<p>Price range: $3000 - $10000 (though preferably around the 7-8k range)<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or Coupe<\/p>\n\n<p>Must haves: No must-haves but would be nice to have as many features as I can for the money and relatively fuel efficient and good on insurance, reliable<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda 3, Honda Civic\/Accord, Hyundai Elantra\/Sonata, Infiniti G35 (I really like this but gas and insurance will probably be more expensive)<\/p>\n\n<p>Is this your 1st vehicle: Yes, and I am a student so I assume insurance will probably be higher<\/p>\n\n<p>Does the vehicle need to have a warranty: No <\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I want something that&#39;s still fun to drive and looks good too, and having leather seats and other more luxurious features would be nice to have as well.<\/p>\n<\/div>","10":"<div class=\"md\"><p><strong>Location<\/strong>: Metro Chicago or Los Angeles<\/p>\n\n<p><strong>Price range<\/strong>: &lt;$20k (~$15k desired)<\/p>\n\n<p><strong>New or used<\/strong>: Used<\/p>\n\n<p><strong>Type of vehicle<\/strong>: Entry-level Luxury and\/or sport; sedan or coupe<\/p>\n\n<p><strong>Must haves<\/strong>:<\/p>\n\n<p><strong>Desired transmission<\/strong> (auto\/manual, etc): Open to both. Think I prefer Manual.<\/p>\n\n<p><strong>Intended use<\/strong>: Some daily driving, more than likely just weekend fun\/errands.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered<\/strong>: Audi A5, MX-5, BMW 3-series, and the Golf R (tho, not really into hatchbacks). I&#39;m open to any suggestions.<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: (fluids, alternator, battery, water pump, brake pad etc) Yes, have and can.<\/p>\n\n<p><strong>Can you do Major work on your own vehicle<\/strong>: (engine and transmission rebuild, timing belt\/chains, bodywork etc ) I have not, but nothing is impossible with the right amount of time.<\/p>\n\n<p><strong>Additional Notes<\/strong>: After borrowing my friend&#39;s S-class AMGs, Ferraris, and the like, I&#39;ve grown accustomed to driving really well-built luxury cars. The problem is I can only afford a small fraction of the cost of those cars. I&#39;ll be moving from downtown Chicago to Los Angeles next year, so I&#39;m going to need to own a car soon. I&#39;m contemplating buying a car before the move and doing a cross-country road trip to move in, however that can also be done via rental car. At this point, I&#39;m just starting to explore options and research so I can be fully prepared when it&#39;s time to pull the trigger.<\/p>\n\n<p>Most important is it should be fun to drive - not handle like complete crap (I know I can&#39;t expect Ferrari handling from a &lt;$20k car). And be comfortable to sit in. Thanks for reading!<\/p>\n<\/div>","11":"<div class=\"md\"><p>Location: Minnesota, USA<\/p>\n\n<p>Price range: Up to $30,000<\/p>\n\n<p>New or used: Preferably new<\/p>\n\n<p>Type of vehicle: Sports car\/sporty sedan<\/p>\n\n<p>Must haves: Winters are a big thing up here in MN. Heated seats, mirrors, and possibly remote start would be preferable. Back seats and a reverse camera are also needed.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Can do either. Auto would be nice for remote start though<\/p>\n\n<p>Intended use: Main car, but used maybe 3-4 times a week for &lt;20 miles at a time<\/p>\n\n<p>Vehicles you&#39;ve already considered: Scion FRS\/BRZ\/86 (wont work because of the snow with rwd, else it would be a must buy), subaru wrx premium (highly considering this one), hatch focus st<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Unsure. It would be nice<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Again, biggest thing is the winters here. I like sporty cars and coupes mostly, but don’t know a whole lot about cars to make a sound decision. This will be my first new car, as I’ve grown up buying used cars off craigslist<\/p>\n\n<p>Edit: Grammar<\/p>\n<\/div>","12":"<div class=\"md\"><p>Location: USA<\/p>\n\n<p>Price range: Less than $25k<\/p>\n\n<p>New or Used: Either<\/p>\n\n<p>Type of vehicle: sedan<\/p>\n\n<p>Must haves: modern safety features, CarPlay\/Android Auto, keyless entry and push to start<\/p>\n\n<p>Desired Transmission: auto<\/p>\n\n<p>Intended use: daily driver<\/p>\n\n<p>Vehicles I&#39;m considering: Honda Civic, Toyota Corolla, open to all other suggestions as well<\/p>\n\n<p>Is this your first vehicle: 3rd<\/p>\n\n<p>Does the vehicle need to have a warranty: Would be nice but not a dealbreaker<\/p>\n\n<p>Can you do minor work on your vehicle: to some extent yes<\/p>\n\n<p>Can you do major work on your vehicle: No<\/p>\n\n<p>Additional Notes: <\/p>\n\n<p>I live in Baton Rouge, LA. We had a horrible flood last year that completely flooded parts of BR and all of some of the outlying cities. I&#39;m nervous about getting used because of the risk of unknowingly getting a flood damaged car, and used cars are really expensive here because of the demand from everyone who lost their cars. I&#39;m cutting my losses on my current car that&#39;s become a money pit. I want a car that will hopefully last for the next 8-10 years since it will be my first car out of college and I&#39;ve already been through 2 used cars in 5 years. <\/p>\n<\/div>","13":"<div class=\"md\"><p>Location: Toronto, Canada (GTA)\nPrice range: $5000 CAD<\/p>\n\n<p>New or used: USED<\/p>\n\n<p>Type of vehicle: Car<\/p>\n\n<p>Must haves: Durable, Reliable, Comfortable for a tall driver (6&#39;3), would prefer manual but i&#39;m looking at panther platform. My ideal car would be a fuel efficient, comfortable hatchback, like a TDI hatch\/wagon. Those seem a bit out of my price range for a used tdi with less than 200k km. <\/p>\n\n<p>Desired transmission: Manual, considering Auto<br\/>\nIntended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Saab 9-3, Saab 9-5, Honda Fit, Accord, Acura CSX, TL, TSX, EL, Hyundai Accent, Elantra<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: YES<\/p>\n\n<p>Can you do Major work on your own vehicle: Not really. I replaced a radiator before. <\/p>\n\n<p>Additional Notes: I&#39;m looking for a vehicle to cover a 200km (125mile) daily commute from Toronto to Barrie. I&#39;m looking at CrownVic\/Marquis\/Town Car because of their reliability and comfort (my friend&#39;s accord coupe has poor headroom on me) but dislike that the panthers are Automatic and have poor fuel economy. I&#39;d prefer a hatchback. My last car was a Saab 9-5 wagon. <\/p>\n<\/div>","14":"<div class=\"md\"><p>I&#39;m 21 work 50 hours a week and drive a lot (probably a few hundred a week). I have an FRS I financed but between payments and insurance I can&#39;t afford it anymore, and I want something more classy and 4 door. Budget is ideally just a few grand (less than $5k). I also need to drive it in the winter (Boston).<\/p>\n\n<p>I&#39;m thinking of a 2000s Lincoln Towncar would fit my needs. I also had a Mercedes 300D in mind but that&#39;s pretty old and I&#39;m not sure about maintenance costs of that. Any other ideas?<\/p>\n<\/div>","15":"<div class=\"md\"><p>Location: Northern KY, USA<\/p>\n\n<p>Price Range: Below $6\/7K<\/p>\n\n<p>New\/Used: USED<\/p>\n\n<p>Type of vehicle: Sedan, Hot hatch, Coupe<\/p>\n\n<p>Must haves: Sporty, Fun, Quick, RWD or AWD, Simple, Mod-able<\/p>\n\n<p>Desired transmission: Manual<\/p>\n\n<p>Intended Use: Weekend driving, Messing around, Slightly tuning, Manual fun when I’m itching for a clutch pedal and gear shifter<\/p>\n\n<p>Vehicles already considered: Subaru Impreza sedan and wagon\/hatchback, Mazda 3 hatchback, VW Mk3 TDi and GLI, Various BMWs<\/p>\n\n<p>First Vehicle: No<\/p>\n\n<p>Need to have a warranty: Not necessarily<\/p>\n\n<p>Can you do minor work: Yes<\/p>\n\n<p>Can you do major work: Probably not, but it depends<\/p>\n\n<p>Additional Information: I drive an automatic Mk6 VW Golf right now and love it. I’m looking for something a little more fun as a side chick. Not to be used as a daily driver, but more just a secondary car that can put a smile on my face and give me more consistent manual transmission use here and there. Just to be used every few days maybe when I’m not going anywhere too important. I’m just not interested in dumping loads of money into a car if I’m not going to be using it as a DD. Honestly I wouldn’t be offended if anyone were to suggest a car that’s not historically a rally or track car. Something modest with a kick works also!<\/p>\n<\/div>","16":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","17":"<div class=\"md\"><p>I&#39;m looking for the most cost effective car that can do 0-100kmh in 4.5 seconds or less and the standing quarter mile in something starting with 12 (12.9 or less) - on street tires. Justification time: had fun cars such as Alfa alfetta, BMW e30, Toyota 86 but never had anything fast. I’ve always wanted a numbers car but when I was a kid I assumed I’d be a millionaire when I grew up... sadly not the case.<\/p>\n\n<p>Location: Sydney, NSW Australia <\/p>\n\n<p>Price: $20,000 to $60,000 AUD<\/p>\n\n<p>New or used: will need to be used probably <\/p>\n\n<p>Type of vehicle: coupe or sedan (no convertibles)<\/p>\n\n<p>Must haves: air con, rear drive or all wheel drive (no fwd)<\/p>\n\n<p>Desired transmission: manual preferred but would go auto if it&#39;s quicker<\/p>\n\n<p>Intended use: will be my only car but I catch the train on to work so mainly weekend driving, occasional track day <\/p>\n\n<p>Happy to do minor mods like headers, tune, e85, intake and exhaust. Not keen to do a major mod like going from NA to FI.<\/p>\n\n<p>Open to 4 cylinder turbos but I have had heaps of 4 cylinder cars so would prefer a 6 or 8 cyl this time.<\/p>\n<\/div>","18":"<div class=\"md\"><p>Location: USA - KS<\/p>\n\n<p>Price range: (3000-7000 $)<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: (Sedan \/ hatchback)<\/p>\n\n<p>Must haves: (can&#39;t think of anything other than cruise control) <\/p>\n\n<p>Desired transmission (auto\/manual, etc):Auto<\/p>\n\n<p>Intended use: (Daily Driver)<\/p>\n\n<p>Vehicles you&#39;ve already considered: Nissan versa 2014 - ford focus 2014<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: (I can learn so yes)<\/p>\n\n<p>Can you do Major work on your own vehicle: (no )<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>So the dealer my family deals with has cars for a decent price<\/p>\n\n<p>Nissan versa 2014 sedan for 5k (44k odometer reading) clean title but hail damage. <\/p>\n\n<p>Ford focus 2014 for 7.5k (15k odometer reading) was totaled for an accident on the front passenger side. <\/p>\n\n<p>I am wondering if the value of the versa is good or should I go all in and buy the ford focus <\/p>\n<\/div>","19":"<div class=\"md\"><ul>\n<li>Location: Orlando, Fl<\/li>\n<li>Price range: Under $35,000<\/li>\n<li>New or used: Either<\/li>\n<li>Type of vehicle: 4 door sports car<\/li>\n<li>Desired transmission (auto\/manual, etc): Automatic<\/li>\n<li>Intended use: Daily Driver<\/li>\n<li>Vehicles you&#39;ve already considered: Lexus 200t<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: Preferred <\/li>\n<li>Can you do Minor work on your own vehicle: Preferably not<\/li>\n<li>Can you do Major work on your own vehicle: No<\/li>\n<li>Additional Notes: Preferably newer than 2015 and under 30,000 miles<\/li>\n<\/ul>\n<\/div>","20":"<div class=\"md\"><p>• Location: Western PA\n• Price range: (Max about 35,000\n• New or used: New\n• Type of vehicle: no preference\n• Must haves: Preferably AWD but not required. Want something fun to drive with lots of power but still plenty of room for 4 adults with 4 golf bags. I also like all the techie bells and whistles. Good gas mileage isn&#39;t that big of a deal but wouldn&#39;t upset me.\n• Desired transmission (auto\/manual, etc): Auto\n• Intended use: Daily Driver. Good for golfing. Preferably room for 4 with bags\n• Vehicles you&#39;ve already considered: just starting to look\n• Is this your 1st vehicle: Currently have GMC Terrain\n• Does the vehicle need to have a warranty: Yes\n• Can you do Minor work on your own vehicle: Yes \n• Can you do Major work on your own vehicle: no\n• Additional Notes:<\/p>\n<\/div>","21":"<div class=\"md\"><ul>\n<li>Location: Houston, TX<\/li>\n<li>Price range: $25k USD<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: 4 - door <\/li>\n<li>Must haves: Leather, sporty-type design<\/li>\n<li>Desired transmission (auto\/manual, etc): Either<\/li>\n<li>Intended use: Commuter\/family car<\/li>\n<li>Vehicles you&#39;ve already considered: SHO, Q50, Lexus models<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: NO<\/li>\n<li>Can you do Minor work on your own vehicle:  YES<\/li>\n<li>Can you do Major work on your own vehicle: YES\nAdditional Notes: Trying to avoid a boring basic sedan if at all possible. <\/li>\n<\/ul>\n<\/div>","22":"<div class=\"md\"><p>Location: USA<\/p>\n\n<p>Price range: $12,000 max<\/p>\n\n<p>New or used: Used (financing)<\/p>\n\n<p>Type of vehicle: Sedan, Coupe, Hatch, Wagon<\/p>\n\n<p>Must haves: Manual transmission, somewhat gas efficient<\/p>\n\n<p>Desired transmission: Manual<\/p>\n\n<p>Intended use: Daily driver for a college student, still want some pep to get around with<\/p>\n\n<p>Vehicles you&#39;ve already considered: GTI, Golf, Nissan Altima coupe, Honda Accord Coupe, Subie Outback, CTS Wagon, Audi A3 Wagon<\/p>\n\n<p>Is this your 1st vehicle: 2nd<\/p>\n\n<p>Does the vehicle need to have a warranty: Would be nice but ¯\\<em>(ツ)<\/em>\/¯<\/p>\n\n<p>Can you do Minor work on your own vehicle: Sure<\/p>\n\n<p>Can you do Major work on your own vehicle: Not so sure<\/p>\n\n<p>Additional Notes: I live in Nevada so working AC is obviously necessary, Bluetooth would be nice but I&#39;m ok swapping that in myself, not too picky otherwise<\/p>\n<\/div>","23":"<div class=\"md\"><p>Who here has driven an MG Midget? How is it?<\/p>\n<\/div>","24":"<div class=\"md\"><p>Location: Louisiana<\/p>\n\n<p>Price range: $30k max<\/p>\n\n<p>New or used: Either.<\/p>\n\n<p>Type of vehicle: Smaller sporty car<\/p>\n\n<p>Must haves: would prefer something with a bit of power but not required<\/p>\n\n<p>Desired transmission: no pref.<\/p>\n\n<p>Intended use: fun and DD<\/p>\n\n<p>Vehicles you&#39;ve already considered: Fiat spider, Mazda Miata, corvettes<\/p>\n\n<p>Is this your 1st vehicle: 3rd 2 PRES have been sports cars<\/p>\n\n<p>Does the vehicle need to have a warranty: not really<\/p>\n\n<p>Can you do Minor work on your own vehicle: absolutely<\/p>\n\n<p>Can you do Major work on your own vehicle: yes but I’d rather professionals do it<\/p>\n\n<p>Additional Notes: I’ve had two sports car previously. My last car a 97 Vette died on me. It had almost 200k miles so it’s ok. It was well loved. I️ want something that’s fun and responsive to drive. I️ cannot have a wide vehicle where I️ live so something tiny would be great.<\/p>\n<\/div>","25":"<div class=\"md\"><p>Location: <\/p>\n\n<ul>\n<li>Indianapolis, Indiana<\/li>\n<\/ul>\n\n<p>Price range: <\/p>\n\n<ul>\n<li>Max of ~$12,000 ($2000 up front, absolute max of $225\/mo 4 years.)<\/li>\n<\/ul>\n\n<p>New or used: <\/p>\n\n<ul>\n<li>Used<\/li>\n<\/ul>\n\n<p>Type of vehicle: <\/p>\n\n<ul>\n<li>Car, Sedan, Crossover, Truck <\/li>\n<\/ul>\n\n<p>Must haves: <\/p>\n\n<ul>\n<li>Room for at least 4 people (including driver), not-horrid gas-mileage.<\/li>\n<\/ul>\n\n<p>Desired transmission (auto\/manual, etc): <\/p>\n\n<ul>\n<li>Auto, I never leaned to drive manual.<\/li>\n<\/ul>\n\n<p>Intended use: <\/p>\n\n<ul>\n<li>Daily Driver.<\/li>\n<\/ul>\n\n<p>Vehicles you&#39;ve already considered: <\/p>\n\n<ul>\n<li>Toyota Venza 2010. (I&#39;ve never been car shopping before, so I&#39;m ABSOLUTELY clueless.)<\/li>\n<\/ul>\n\n<p>Is this your 1st vehicle:<\/p>\n\n<ul>\n<li>First time buying a car. (I&#39;ve been driving a 2005 Hyundai Sonata.)<\/li>\n<\/ul>\n\n<p>Does the vehicle need to have a warranty: <\/p>\n\n<ul>\n<li>Hopefully?<\/li>\n<\/ul>\n\n<p>Can you do Minor work on your own vehicle: <\/p>\n\n<ul>\n<li>Yes.<\/li>\n<\/ul>\n\n<p>Can you do Major work on your own vehicle: <\/p>\n\n<ul>\n<li>No.<\/li>\n<\/ul>\n\n<p>Additional Notes:  <\/p>\n\n<ul>\n<li>Sorry if this isn&#39;t very descriptive. I&#39;m absolutely lost.<\/li>\n<\/ul>\n<\/div>","26":"<div class=\"md\"><p>Location: Turkey<\/p>\n\n<p>Price range: Around €12000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Hatchback<\/p>\n\n<p>Must haves: Fuel efficiency, 0-100kmh in less than 12 seconds<\/p>\n\n<p>Desired transmission: manuel preferred but doesn’t matter that much<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles that i’ve already considered: VW Scirocco (favorite one so far), Renault Clio, Seat Leon, Audi S1, A1 and a3.<\/p>\n\n<p>Is this your first vehicle: yes<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do minor work on your car: yes. As long as it is not costly<\/p>\n\n<p>Can you do major work on your car: no<\/p>\n\n<p>I am university student and im looking for a fun hatch.  VW scirocco is the best match so far but i am open for advices.<\/p>\n<\/div>","27":"<div class=\"md\"><p>Location: Pittsburgh, PA<\/p>\n\n<p>Price range: $9k - $15k <\/p>\n\n<p>New or used: Either, but preferably CPO if used. Obviously very few new cars available in that price range. <\/p>\n\n<p>Type: Small sedan or hatch, something city-friendly <\/p>\n\n<p>Must haves: Fuel efficient <\/p>\n\n<p>Desired transmission: Really want to learn how to drive manual, but either will do. <\/p>\n\n<p>Intended use: College student daily driver, so to and from class. Short, urban drives. <\/p>\n\n<p>Vehicles you&#39;ve already considered: Mitsubishi Mirage, Chevy Spark, pre-owned Honda Civic or Hyundai Elantra <\/p>\n\n<p>Is this your first vehicle: Yes <\/p>\n\n<p>Does the vehicle need to have a warranty: Yes (I feel pretty strongly on this one) <\/p>\n\n<p>Can you do minor work on your own vehicle: I can do oil, tranny fluid, battery...That&#39;s about it! <\/p>\n\n<p>Major work: No sir. <\/p>\n\n<p>Additional notes: If you can&#39;t already tell - I&#39;m a very budget-conscious college student looking for something new or single-owner, with a warranty, that will last me for a long time. My options seem limited to the very cheap subcompact class but let me know what I may have missed! <\/p>\n<\/div>","28":"<div class=\"md\"><p>• Location: Tampa, Florida<\/p>\n\n<p>• Price range: 5-10k<\/p>\n\n<p>• New or used:either but more than likely used<\/p>\n\n<p>• Type of vehicle: coupe, sports car<\/p>\n\n<p>• Must haves: must be fast(either stock or easily modded i.e. turbo\/supercharger, engine swap) practical ish, four seats would be nice but not necessarily a must have<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): either<\/p>\n\n<p>• Intended use: daily driver if it&#39;s somewhat practical or second car. Project car, possible track toy<\/p>\n\n<p>• Vehicles you&#39;ve already considered: Hyundai Genesis, Toyota mr2 Spyder with swapped engine or turbo charged<\/p>\n\n<p>• Is this your 1st vehicle:no. Currently own a hyundai tiburon i4 base model<\/p>\n\n<p>• Does the vehicle need to have a warranty:no<\/p>\n\n<p>• Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: no currently but not afraid to try.<\/p>\n\n<p>• Additional Notes:looking for something unique. And very Batman-y(like wow that looks like the batmobile!! Kind of car. But not the actual batmobile cause let&#39;s be honest. I&#39;m not a billionaire)<\/p>\n<\/div>","29":"<div class=\"md\"><p>Location: Crewe, England. <\/p>\n\n<p>Price range: up to £8000. (Depending on whether I decide to wait a couple more months or not)<\/p>\n\n<p>Used <\/p>\n\n<p>Type of vehicle: Saloon, Coupe or Hatchback.<\/p>\n\n<p>Desired manual but not overly fussy  <\/p>\n\n<p>Must haves: Enough torque (so open to diesels) to make acceleration feel near the better end for this price range. At least a half decent interior. Obviously not perfect, but decent mpg (at least 30mpg for mainly town driving, occasional motorway). Aux or Bluetooth for music. Sat nav and on board screan preferable but not necessary. look decent, but preferably not to overly look at me. <\/p>\n\n<p>Intended use: Daily driver, weekend toy.<\/p>\n\n<p>Vehicles I&#39;ve already considered: Bmw e46 330cd, e90 335d, Jag Xf, Golf Gti, Bmw 123d (longer shaped ones), A3 TDI.<\/p>\n\n<p>It will be my 2nd vehicle.<\/p>\n\n<p>Doesnt need a warranty.<\/p>\n\n<p>I can do minor work, but not major. <\/p>\n\n<p>Thanks!<\/p>\n<\/div>","30":"<div class=\"md\"><p>Not planning to buy in the short term, but if something goes wrong with my current car that costs more than a few hundred to fix I&#39;ll probably get something either new or newer.<\/p>\n\n<p>Mid-state New York<\/p>\n\n<p>Price range: not decided<\/p>\n\n<p>New or used: probably something used but relatively new, with the stuff newer cars have like bluetooth radios<\/p>\n\n<p>Type: car or sports car, maybe like a Mustang, something that accelerates and handles nicely. I was surprised how well this 98 Ford Escort ZX2 of mine does for being 4 cylinders, helps that it&#39;s so light I guess. <\/p>\n\n<p>Must haves: Not sure what else at the moment besides things I&#39;ve already mentioned<\/p>\n\n<p>Desired transmission: automatic but maybe I&#39;ll learn standard some day<\/p>\n\n<p>Intended use: Daily Driver\/any other use<\/p>\n\n<p>Vehicles you&#39;ve already considered: some kind of Mustang, or one of the nicer Teslas<\/p>\n\n<p>Is this your 1st vehicle: it would be my 2nd<\/p>\n\n<p>Does the vehicle need to have a warranty: anything you buy at a dealer has to have some kind, doesn&#39;t it? Pretty sure lemon laws cover it in my state. I don&#39;t buy extra warranties though.<\/p>\n\n<p>Can you do minor work on your own vehicle: I know enough that I&#39;d be able to figure out minor things if I had to, and who can&#39;t do fluids or replace\/charge a battery?<\/p>\n\n<p>Can you do major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Also might want an RV at some point, probably going to get a used one on craigslist for a few thousand. the prices on new ones are insane, they cost more than buying a cheap real house.<\/p>\n<\/div>","31":"<div class=\"md\"><p>Location: Chicago, IL\nPrice range: 3k-10k\nNew or used: Used\nType of vehicle: Sport\nMust haves: RWD or AWD \nIntended use: Daily Driver\nVehicles you&#39;ve already considered: 2nd gen wrx, brz\/frs, V6 camaro (We have a 2014 camaro 2SS)\nIs this your 1st vehicle: Yes\nDoes the vehicle need to have a warranty: no\nCan you do Minor work on your own vehicle: Yes!\nCan you do Major work on your own vehicle: No, not enough time.\nAdditional Notes: Im 15 with a permit, I drive my fathers Camaro SS and mom&#39;s GTI. I drive stick in the camaro. Im fine with power.<\/p>\n<\/div>","32":"<div class=\"md\"><ul>\n<li><p><strong>Location:<\/strong> South-Western Ontario<\/p><\/li>\n<li><p><strong>Price range:<\/strong> ~26,500 CAD<\/p><\/li>\n<li><p><strong>New or used:<\/strong> Preferably new, but can go used if it&#39;s the right car.<\/p><\/li>\n<li><p><strong>Type of vehicle:<\/strong> Hatchback or Crossover<\/p><\/li>\n<li><p><strong>Must haves:<\/strong> Bluetooth<\/p><\/li>\n<li><p><strong>Desired transmission:<\/strong> Manual<\/p><\/li>\n<li><p><strong>Intended use:<\/strong> Daily driver<\/p><\/li>\n<li><p><strong>Vehicles you&#39;ve already considered:<\/strong> Foucs ST, Mazda3, Subaru Crosstrek<\/p><\/li>\n<li><p><strong>Is this your 1st vehicle:<\/strong> No<\/p><\/li>\n<li><p><strong>Does the vehicle need to have a warranty:<\/strong> No<\/p><\/li>\n<li><p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p><\/li>\n<li><p><strong>Can you do Major work on your own vehicle:<\/strong> No <\/p><\/li>\n<li><p><strong>Additional Notes:<\/strong> My bother works at a Ford dealer, so I could get a decent discount through him.<\/p><\/li>\n<\/ul>\n<\/div>","33":"<div class=\"md\"><p>Long Island NY<\/p>\n\n<p>About $10,000 max<\/p>\n\n<p>I&#39;m not really picky on the the type of car tho I&#39;d prefer a sports car or crossover<\/p>\n\n<p>Preferred automatic but wouldn&#39;t mind a manual too much<\/p>\n\n<p>It must be reliable and able to handle some bad weather like snow and heavy rain, I live in a hilly area of Long Island. And although not really a must but a want, I&#39;d like it to be 2005 or newer<\/p>\n\n<p>I&#39;ve considered the 2011 impreza and similar year sonata as well as an 05 mustang (college student with dreams)<\/p>\n\n<p>It&#39;s not my first car, I&#39;m looking to get rid of my first car which is an 01 s10 zr2 pickup<\/p>\n\n<p>It&#39;s gonna be a daily drive tho it&#39;s gonna be for driving to and from Exton PA. Might be going to UTI there next August and will most likely be driving to and fro fairly often, maybe 1 trip once every 1 to 2 weeks or so.<\/p>\n\n<p>I can do basic repairs and some major repairs tho I&#39;m still learning.<\/p>\n<\/div>","34":"<div class=\"md\"><p>Virginia Beach, VA\n$5,000-$8,000\nUsed\n2 or 4 door sedan\nPrefer manual but fine with automatic \nDaily Drive but still want it to have something quick with 200-300hp (preferably a v6) \nLexus IS350, V6 Accord, Volkswagen GTI, Mazdaspeed6, Subaru Legacy Gt\n3rd vehicle\nNo warranty\nI can do all minor week but not really any major work\nJust looking for some other suggestions. Tired of my lancer <\/p>\n<\/div>","35":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","36":"<div class=\"md\"><p>Location:Colorado<\/p>\n\n<p>Price range: $10-$12k (somewhat flexible)<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: sedan, suv, crossover, hatchback, wagon<\/p>\n\n<p>Must haves: all wheel drive, bluetooth, decent headroom<\/p>\n\n<p>Desired transmission (auto\/manual, etc):either one, auto is preferred<\/p>\n\n<p>Intended use: Daily driver, work 1 hour drive away 2-3 times a week, local driving<\/p>\n\n<p>Vehicles you&#39;ve already considered: subaru impreza, subaru legacy, but a smaller SUV would be nice to try<\/p>\n\n<p>Is this your 1st vehicle:no<\/p>\n\n<p>Does the vehicle need to have a warranty: would be nice<\/p>\n\n<p>Can you do Minor work on your own vehicle: very very minor work \nsince I live in an apartment complex<\/p>\n\n<p>Can you do Major work on your own vehicle:no<\/p>\n\n<p>Additional Notes: Purchasing in the next 1-2 weeks, just got into an accident with my current car, which I feel happened due to driving an older and unreliable vehicle. Primarily need a car that would be good in in the snow, 2012 or newer, and one that is safe. Would prefer the car to last another 5-6 years with regular maintenance. Current dream car would be a subaru crosstrek or outback, but those are out of my price range. I would really like some recommendations on other small suvs\/crossovers that also work well in winter weather. Current car very low to the ground (pontiac g6) and gets stuck in the snow a lot. Wouldn&#39;t mind having something that sits up a bit higher and has a bit more cargo room.<\/p>\n<\/div>","37":"<div class=\"md\"><p>I&#39;m helping my mother-in-law select a new car (she&#39;s selling her 2014 Ford Escape because she wants something different), and she&#39;s looking for something that is high like her Jeep Liberty was, but with a smooth, comfortable ride, all-wheel drive and preferably certified used so she doesn&#39;t have to worry about repairs.<\/p>\n\n<ul>\n<li>Location: St. Louis Area<\/li>\n<li>Price range: $8k - $20k<\/li>\n<li>New or used: Used, preferably certified<\/li>\n<li>Type of vehicle: SUV<\/li>\n<li>Must haves: AWD, Smooth, comfortable ride and high seating position<\/li>\n<li>Desired transmission: Automatic<\/li>\n<li>Intended use: Errands, occasional weekend<\/li>\n<li>Vehicles you&#39;ve already considered (top picks right now): Nissan Juke, Nissan Rogue, Hyundai Santa Fe, Mazda CX-5, Lexus RX<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: Preferred<\/li>\n<li>Can you do Minor work on your own vehicle: No<\/li>\n<li>Can you do Major work on your own vehicle: No,<\/li>\n<li>Additional Notes: Sync-like tech is a plus, bluetooth is necessary<\/li>\n<\/ul>\n\n<p>Thanks for all the help!<\/p>\n<\/div>","38":"<div class=\"md\"><p>Location: Ohio<\/p>\n\n<p>Price range: 5-6k (flexible)<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sportscar, Sedan, Wagon<\/p>\n\n<p>Must haves: Manual transmission,  RWD<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: N\/A<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Looking for something in the spring to downgrade to from the WRX<\/p>\n<\/div>","39":"<div class=\"md\"><blockquote>\n<ul>\n<li><strong>Location:<\/strong> (Specify your country or region)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Northern California<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Price range:<\/strong> (Minimum-Maximum in your local currency)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>9-12k<\/p>\n\n<blockquote>\n<ul>\n<li><strong>New or used:<\/strong><\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Used<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Type of vehicle:<\/strong> (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Sports car<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Must haves:<\/strong> (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space etc.)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Modern safety features (abs\/traction control)<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Desired transmission (auto\/manual, etc):<\/strong><\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Manual<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Intended use:<\/strong> (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Weekend Car<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Vehicles you&#39;ve already considered:<\/strong> <\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Mazda Miata MX-5, Porsche Boxster, Honda S2000<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Is this your 1st vehicle:<\/strong><\/li>\n<\/ul>\n<\/blockquote>\n\n<p>No<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Does the vehicle need to have a warranty:<\/strong><\/li>\n<\/ul>\n<\/blockquote>\n\n<p>No<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Can you do Minor work on your own vehicle:<\/strong> (fluids, alternator, battery, water pump, brake pad etc)<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>Yes<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Can you do Major work on your own vehicle:<\/strong> (engine and transmission rebuild, timing belt\/chains, body work etc )<\/li>\n<\/ul>\n<\/blockquote>\n\n<p>No<\/p>\n\n<blockquote>\n<ul>\n<li><strong>Additional Notes:<\/strong><\/li>\n<\/ul>\n<\/blockquote>\n<\/div>","40":"<div class=\"md\"><p>Anyone have any opinions on the diesel Cruze sedan for a college student? I️ understand the fuel costs aren’t really projected to make much of a difference in the long run but it seems like it’d be a fun car to drive with the manual transmission, and the diesel engine would probably last longer with fewer issues, unless i’m mistaken.<\/p>\n<\/div>","41":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","42":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","43":"<div class=\"md\"><p>Location: Southeast USA<\/p>\n\n<p>Price range: $15k +\/- $5k<\/p>\n\n<p>New or used: USED<\/p>\n\n<p>Type of vehicle: Hatch&gt;Sedan<\/p>\n\n<p>Must haves: Fun&gt;Reliability&gt;Fuel Economy&gt;Luxury<\/p>\n\n<p>Desired transmission (auto\/manual, etc): any<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered:  Maxda 3, BMW 328i, Lexus IS 250<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: no <\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: nope<\/p>\n\n<p>Additional Notes:  I want something that is fun to drive but I can put a wife and child into with no problems.  I also want to feel somewhat luxurious in my ride. <\/p>\n<\/div>","44":"<div class=\"md\"><p>Hey everyone, so I was wondering if I should get this car:<\/p>\n\n<p>Location: Portugal<\/p>\n\n<p>Car: BMW 320 from 2001<\/p>\n\n<p>Price: 6,9k€ <\/p>\n\n<p>Vehicles I&#39;ve already considered: I&#39;ve already considered cheaper cars rounding the same age (from behind 2000, rounding 2-3k€) and also more recent cars rounding 5-6k€, but to be honest I think any Mercedes\/BMW will outdo both of those, even though it&#39;s a bit more expensive.<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Warranty: 1 year<\/p>\n\n<p>And finally I can&#39;t really do any work on it, I know the basics of cars but I&#39;m just not confident enough to scramble around some parts on a car of my own.<\/p>\n<\/div>","45":"<div class=\"md\"><p>Location: USA\nI am thinking about buying a &#39;86 or &#39;88 Toyota Supra. The vendor has both and are in my price range, except the &#39;86 is cheaper. I intend to use it as a weekend car and i don&#39;t know how to do major work on it like mods or anything like that, just basic maintenance stuff . But i wanted to know what should i look out for or consider about the car before buying. <\/p>\n<\/div>","46":"<div class=\"md\"><p>Location - Los Angeles, CA<\/p>\n\n<p>Price Range - Under $13,500.<\/p>\n\n<p>Used.<\/p>\n\n<p>Type of vehicle - Coupe, Sedan or Convertible, Luxury or Sports.<\/p>\n\n<p>Must haves: Not an econobox (No Hyundais, Hondas, Toyotas, etc.)<\/p>\n\n<p>Desired Transmission - Either if large luxury car, manual if smaller\/sportier.<\/p>\n\n<p>Intended Use - Daily driver.<\/p>\n\n<p>Vehicles under consideration - BMW 1 series convertible (manual), previous gen Jaguar XJ\/XK series.<\/p>\n\n<p>Will not be a first vehicle. <\/p>\n\n<p>Warranty is not needed.<\/p>\n\n<p>Will not be doing any work on the vehicle.<\/p>\n<\/div>","47":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","48":"<div class=\"md\"><p>Sorry to put this question here but I wanted it to be buried. What day of the week do we do our best cars under $5k? I found a turbo v6 6MT car with AWD for well under KBB. I want someone to buy it before I do something irresponsible. <\/p>\n<\/div>","49":"<div class=\"md\"><p>New Orleans\n*15k\n*Used\n*Sports car and\/or luxury car\n*Preferably RWD, good power, RELIABLE\n*Daily\/delivery vehicle\n*Considering Lexus IS350, Infiniti G35\/37\n*Not my first car, coming from a BRZ\n*Can do minor work. <\/p>\n<\/div>","50":"<div class=\"md\"><p>Location: California, USA<\/p>\n\n<p>Price range: $25,000 - $40,000<\/p>\n\n<p>New or used: New or recent model<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must haves: interior space, trunk space, panoramic sunroof is a huge plus, decent milage, luxury feel<\/p>\n\n<p>Desired transmission (auto\/manual, etc): automatic<\/p>\n\n<p>Intended use: daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2018 Toyota Camry XSE<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: no<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: I currently have a black 2011 Toyota Camry LE and have been considering upgrading to something modern and more luxurious for the last few months. The 2018 Camry XSE looks very appealing especially after adding all the packages to it. Are there any other comparable cars I should be looking at as well? The other cars that have come to my attention, but I have not seriously looked at are used Audi A4\/A6 or something similar (note I&#39;m trying to stay away from another black car so Audi has been difficult to like)<\/p>\n<\/div>","51":"<div class=\"md\"><p>Location: California\nPrice range: 25-40k USD\nNew or used: either\nType of vehicle: sports car \/ compact (sporty)\nMust haves: Speed, handling, good looks, fun\nDesired transmission (auto\/manual, etc): manual\nIntended use: Daily (I do not require the car to be &quot;practical&quot; as some might say. It could have 1 seat and no trunk for all I care.)\nVehicles you&#39;ve already considered: Subaru BRZ, WRX , used Porsche Cayman, used BMW z4, \nIs this your 1st vehicle: no\nDoes the vehicle need to have a warranty: If it is new, yes.\nCan you do Minor work on your own vehicle: As long as it doesn&#39;t void that warranty if it is new.\nCan you do Major work on your own vehicle: I wish.\nAdditional Notes: Fancy interior gizmos are not necessary and to some degree not desirable. I am a fan of bare-bones dashes.<\/p>\n<\/div>","52":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","53":"<div class=\"md\"><p><strong>Location<\/strong>: US Midwest<\/p>\n\n<p><strong>Price range<\/strong>: ~$350 per month (I&#39;m set on leasing)<\/p>\n\n<p><strong>New or used<\/strong>: new<\/p>\n\n<p><strong>Type of vehicle<\/strong>: Not a truck, minivan or SUV, would consider a crossover<\/p>\n\n<p><strong>Must haves<\/strong>: heated seats, room for a stroller, Android auto<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc)<\/strong>: auto<\/p>\n\n<p><strong>Intended use<\/strong>: Daily Driver, Family Car<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered<\/strong>: Buick Regal Sportback\/TourX, VW Jetta wagon<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: leased so hopefully only oil changes<\/p>\n\n<p><strong>Additional Notes<\/strong>: First child on the way so I need room for a stroller etc. Currently have a Ford Focus hatch. Would like a larger sedan or wagon. I like the hatch-sedan look too in the Buick Regal Sportback. But I&#39;m struggling with my budget (upper $20,000s). I would rather put more down to get closer to that monthly payment. <\/p>\n\n<p>Thanks!<\/p>\n<\/div>","54":"<div class=\"md\"><p>Location: (Specify your country or region)\nSan Diego<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency)\n&lt;10k<\/p>\n\n<p>New or used:\nUsed<\/p>\n\n<p>Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)\nTruck\/SUV<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space etc.)\n4x4\/AWD, &gt;15mpg, would like crew cab but not a must <\/p>\n\n<p>Desired transmission (auto\/manual, etc):\nEither<\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.)\nWork Truck<\/p>\n\n<p>Vehicles you&#39;ve already considered: Tacoma,\nF150, 4runner<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc)\nYes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc )\nNo<\/p>\n\n<p>Additional Notes: \nI work on big construction sites (mass grading) and I need something with some clearance and 4wd for sticky situations. I have a 2004 Nissan Frontier SC 4x4 but I&#39;m getting something like 13mpg. It&#39;s worth probably about 8k, I&#39;d like to upgrade to something more fuel efficient but I&#39;m having trouble finding anything to fit my needs. <\/p>\n<\/div>","55":"<div class=\"md\"><ul>\n<li>Price range: Under 100k<\/li>\n<li>New or used: New only<\/li>\n<li>Desired transmission: auto<\/li>\n<li>Intended use: Daily Driver, Fun to Drive<\/li>\n<li>Vehicles you&#39;ve already considered: VW Golf R, Audi S5 Sportback, 2019 Audi A7, Mercedes-Benz C43 sedan or coupe<\/li>\n<li>Is this your 1st vehicle: NO<\/li>\n<li>Does the vehicle need to have a warranty:<\/li>\n<li>Can you do Minor work on your own vehicle: Stock Only, No Modify, keep it simple<\/li>\n<li>Can you do Major work on your own vehicle: Stock Only, No Modify, keep it simple<\/li>\n<li>Additional Notes: Please provide me more recommendation if there is any.<\/li>\n<\/ul>\n<\/div>","56":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","57":"<div class=\"md\"><p>Quick question, where can I go to research used cars in the UK while avoiding those commercialised magazine style YouTube channels?<\/p>\n\n<p>I’m young so want to get the best value for money including insurance.<\/p>\n<\/div>","58":"<div class=\"md\"><ul>\n<li>Location: Maryland<\/li>\n<li>Price Range: &lt;$25,000<\/li>\n<li>New or used: New, or used but less than 2 years old<\/li>\n<li>Type of vehicle: Car, Station Wagon, Hatchback<\/li>\n<li>Must Haves: Reliable, Fuel Economy, Comfortable, Not boring to drive<\/li>\n<li>Desired Transmission: Either<\/li>\n<li>Intended Use: Daily (LOTS of miles)<\/li>\n<li>Vehicles you&#39;ve already considered: Acura ILX, Lexus IS250, Honda Civic Hatchback<\/li>\n<li>Is this your first vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: Yes<\/li>\n<li>Can you do Minor work on your own vehicle: Yes<\/li>\n<li>Can you do Major work on your own vehicle: Yes<\/li>\n<li>Additional Notes: I just got a job in technical sales. I will be doing A LOT of driving (as much as 5k miles a month). I am looking for something that is above all cost effective (fuel economy, insurance, purchase price, cost of parts, resale value, etc.). It also needs to be professional in appearance and reliable. I would like it to be fun to drive as well, but this not a requirement. Also, does a hybrid make sense?<\/li>\n<\/ul>\n<\/div>","59":"<div class=\"md\"><p>I currently have a 2007 Honda Accord EXL V6. It&#39;s been a great car but I need something new, family friendly, and more fun. I have been heavily considering the VW Golf R. It&#39;s small, fast, affordable, and family friendly. I know the direct competitors: Ford Focus RS, Subaru WRX STI, Mitsubishi Evo X (although discontinued), Honda Civic Type R. I think the Golf R is a very well refined equation, but I&#39;m interested to see what you folks have to throw in the ring for me to consider.<\/p>\n<\/div>","60":"<div class=\"md\"><p>Location: Lexington, KY<\/p>\n\n<p>Price range: 3k - 6k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or Sport<\/p>\n\n<p>Must haves: Decent Average MPG<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Commute<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2005 Hyundai Tiburon, 2005 Volvo S40, 06 Mitsubishi Eclipse<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes:\nI currently own a 94 Volvo 850 Turbo and I&#39;ve been looking to get a newer vehicle for a while. I&#39;ve never owned a car younger than 01 and it has gotten stale. I was wondering what might be a good car to keep an eye out for. Something that is a bit more modern than what I have now, you know.<\/p>\n\n<p>Edit: Tried to fix a formatting error, not used to posting on Reddit.<\/p>\n<\/div>","61":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","62":"<div class=\"md\"><p>I&#39;m in the US and looking for something manual. I have ~3500 to spend. I was looking at the more common first cars like e36s, miatas, civics, etc but everyone gets those so I was wondering what were some odd ball cars that still performed pretty well for what they were at my price range with a manual?<\/p>\n<\/div>","63":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","64":"<div class=\"md\"><p>Hi everyone!<\/p>\n\n<p>My girlfriend decided to buy a new car and she&#39;s torn between two SEATs: Ibiza and Arona.<\/p>\n\n<p>They share the same platform, engines and the interior is basically the same so the difference is the extra 2.5K for the Mini SUV and the lack of a panoramic sunroof option.<\/p>\n\n<p>I&#39;ve driven  the Ibiza with the panoramic roof open and it&#39;s a cool option but I&#39;ve been reading about some of the disadvantages, like the extra weight, extra heat during sunny days and what worries me the most are the leaks to the interior.<\/p>\n\n<p>How bad is that? Should I be really worried?<\/p>\n\n<p>Also, she likes the Ibiza FR with the 18&quot; wheels. I know they look amazing in the car but should we be worried about losing performance, comfort and the extra cost of the tires?<\/p>\n\n<p>Thanks in advance<\/p>\n<\/div>","65":"<div class=\"md\"><p>Location: Europe<\/p>\n\n<p>Price range: up to 15.000€<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: wagon\/estate<\/p>\n\n<p>Must haves: enough trunkspace, fuel efficient<\/p>\n\n<p>Desired transmission (auto\/manual, etc): automatic<\/p>\n\n<p>Intended use: family car, driven when needed, mostly short trips, not daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: Toyota Auris TS, Hyundai i30, Audi A4 Avant<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Does the vehicle need to have a warranty: not necessary, but is welcome<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Need a reliable car that will last me up to ten years for a decent price. Enough trunk space to pack stuff for a kid, does not need to be huge however.<\/p>\n<\/div>","66":"<div class=\"md\"><p>Location: (Specify your country or region): Michigan<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency) $10-$15k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.) Sports Coupe, or Anything Sporty<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space etc.) V8 preffered, heated seats, anything else is okay.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): AUTO<\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.) Daily Driver \/ Cars &amp; Coffee worthy<\/p>\n\n<p>Vehicles you&#39;ve already considered: C5 Corvette, 05-14 Mustang GT<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ): No\nAdditional Notes: Would like to get financed, would also travel if something it out of my area for a good deal.<\/p>\n<\/div>","67":"<div class=\"md\"><p>Hi guys,<\/p>\n\n<p>I&#39;d finally like to buy my own car after driving my parents cars<\/p>\n\n<p>I want a manual transmission car, and since I need a cheap\/maintainable car I&#39;ve been looking at the BMW e36<\/p>\n\n<p>What is the maximum amount of km I should consider when looking at used bmws <\/p>\n\n<p>Also winter is coming, so would it be fine to drive this car in the winter? I live in Toronto Canada <\/p>\n\n<p>Any other manual cars you would recommend for a uni student? I was considering e46 but heard they are expensive to maintain, is that true? My budget is 4-6k <\/p>\n\n<p>I&#39;d like a sporty car, and not to expensive to maintain<\/p>\n<\/div>","68":"<div class=\"md\"><ul>\n<li>Location: USA<\/li>\n<li>Price range: max 15k<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Compact sedan or hatchback<\/li>\n<li>Must haves: fun to drive<\/li>\n<li>Desired transmission (auto\/manual, etc): either works<\/li>\n<li>Intended use: weekend car<\/li>\n<li>Vehicles you&#39;ve already considered: VW polo<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Does the vehicle need to have a warranty: Yes<\/li>\n<li>Can you do Minor work on your own vehicle: Yes<\/li>\n<li>Can you do Major work on your own vehicle: No<\/li>\n<li>Additional notes: Looking for a weekend car for road trips and not a daily commute car. Would prefer a reliable brand with low maintenance costs!<\/li>\n<\/ul>\n<\/div>","69":"<div class=\"md\"><p>location: orange county ca\nprice range: 5-6k\ni&#39;m thinking of getting a 96\/97 civic ek hatch.\nthis would be my first &quot;enthusiast&quot; car (currently have a hand me down from mom) and first manual car.\nI&#39;d like to get it stock and do some upgrades to it as I go along\nI&#39;m wondering if there are any prevalent issues with this gen of civic, or any specific forums i can go to get more information.\nThanks!<\/p>\n<\/div>","70":"<div class=\"md\"><p>Location: North California<\/p>\n\n<p>Budget $6k<\/p>\n\n<p>Used <\/p>\n\n<p>Sedan <\/p>\n\n<p>Must haves? Comfy seating for 4, good reliability, good fun handling<\/p>\n\n<p>Desired transmission: manual<\/p>\n\n<p>Daily driver,weekend road tripper<\/p>\n\n<p>Cars I thought of: newer accords, Acura TL, Mazda 3, Audi A4<\/p>\n\n<p>Not first, no warranty needed<\/p>\n\n<p>Can do minor work, might be able to do major work?<\/p>\n\n<p>Notes: what is the reputation for used Audi’s? Do they hold up well at high miles? Will people sneer at me for having an upscale badge?<\/p>\n<\/div>","71":"<div class=\"md\"><p>Location: US of A<\/p>\n\n<p>Price range: Under 35k<\/p>\n\n<p>New or used: NEW<\/p>\n\n<p>Type of vehicle: Sports car, sedan, hatchback<\/p>\n\n<p>Must haves: Good powertrain engine + transmission, japanese brand preferred<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either, if it has to be CVT a good one.<\/p>\n\n<p>Intended use: Daily Use<\/p>\n\n<p>Vehicles you&#39;ve already considered: &#39;17 Accord, Civic Hatchback, New Camry, Mazda 6 (probably wait for the new &#39;18), Kia Stinger? Subaru BRZ, Mazda 3 Hatchback (but I think civics are better)<\/p>\n\n<p>Is this your 1st vehicle: Second, driving 2005 matrix as my first car last 13 years.<\/p>\n\n<p>Does the vehicle need to have a warranty: Basic yes.<\/p>\n\n<p>Additional Notes: Want something nice as this will be my first new car, I&#39;d like four doors and a nice engine + transmission. Hatchback is my preferred style.<\/p>\n<\/div>","72":"<div class=\"md\"><p>Hey everyone!<\/p>\n\n<p>Looking for a car. I&#39;m currently a college student getting some money coming in and was looking for the best option for me, and I&#39;ve narrowed it down to two.<\/p>\n\n<p>My budget is pushing it at $4k. I was thinking of getting a 2008 Mazda 3, but my friends family is selling a &#39;85 Mercedes 190e for only $1000. I learned to drive in the same car and love it to death, and I heard they aren&#39;t terrible to work on. Car is in good condition, new water pump and filters. Heard that it drives great still but I&#39;m gonna go check it out soon.<\/p>\n\n<p>Should I shell out and buy the Mazda or grab the 190e at its price? Hard choice because I love the look of the 190e but the Mazda gets better gas mileage, but I&#39;m not sure if it&#39;s worth the $3000 extra. Help please! <\/p>\n<\/div>","73":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","74":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","75":"<div class=\"md\"><p>Location: Maryland<\/p>\n\n<p>Price range: N\/A (cash sale, when Mom&#39;s estate settles in 2018)<\/p>\n\n<p>New or Used: Used (2-3 years old maximum)<\/p>\n\n<p>Type: Crossover or small SUV, 4WD<\/p>\n\n<p>Transmission: Auto<\/p>\n\n<p>Intended Use: 26 y.o. daughter and her new husband want to travel across the US, and currently drives a 2000 Camry with 200K+ mies and body damage. Need to upgrade her to a reliable, 4WD with fold down rear seats so she can pack a bunch of stuff. This will also be her daily driver.<\/p>\n\n<p>Vehicles Considered: No preconceptions. Want to consider all options. I drive a Jeep Patriot and considered a Jeep for her.<\/p>\n\n<p>I need advice on what she will find comfortable for long trips, large cargo space, decent gas mileage, and &quot;definitely not a station wagon or minivan.&quot;<\/p>\n<\/div>","76":"<div class=\"md\"><p>Location: Ontario, Canada  <\/p>\n\n<p>Price range: $10k-$20k  <\/p>\n\n<p>New or used: Used, CPO, Off-Lease  <\/p>\n\n<p>Type of vehicle: SUV\/Crossover\/Wagon\/Hatchback  <\/p>\n\n<p>Must haves: (AWD, Fuel efficient, Trunk space)  <\/p>\n\n<p>Desired transmission: Auto  <\/p>\n\n<p>Intended use: Daily driving (30min urban commute), venturing into the nearby hills for skiing, hiking, cycling.   <\/p>\n\n<p>Vehicles you&#39;ve already considered: RAV4, CRX-5, Outback, Santa Fe  <\/p>\n\n<p>Is this your 1st vehicle: No. 3rd. Current is a beat-up 2005 Honda Civic.  <\/p>\n\n<p>Does the vehicle need to have a warranty: Preferably, but not required.   <\/p>\n\n<p>Can you do Minor work on your own vehicle: No  <\/p>\n\n<p>Can you do Major work on your own vehicle: No  <\/p>\n\n<p>Additional Notes:  I&#39;ve been looking at vehicles in the 2003-2015 area but locally it seems every one within my price range\/brand has crazy high milage - like 90,000km to 120,000km. And they are still priced around $16-20k. <\/p>\n\n<p>It seems like I would be just as well to buy a 2017 new and spend the extra $5-7k, but I just don&#39;t want to get trapped with higher monthly payments. I&#39;d prefer to put down my $10k in cash as a downpayment and then pay off the used car with a short term loan\/LOC. <\/p>\n<\/div>","77":"<div class=\"md\"><p>Location: Philadelphia Suburbs<\/p>\n\n<p>Price Range: $21k max<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: SUV\/Compact SUV\/ Hatchbacks <\/p>\n\n<p>Must haves: backup camera, decent trunk space, otherwise pretty flexible on this<\/p>\n\n<p>Desired transmission: auto<\/p>\n\n<p>Intended use: Daily, cruising, skiing\/kayaking\/ weekend trips (not camping but needing a duffle bag\/suit case and a case of beer or cooler) <\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda CX-3, Mazda3 hatchback, Honda HR-V, Mazda CX-5, Jeep Grand Cherokee <\/p>\n\n<p>Is this your 1st vehicle: No (if my 10 year old family car counts, first vehicle buying on my own though)<\/p>\n\n<p>Does the vehicle need to have a warranty: very preferred<\/p>\n\n<p>Can you do Minor work on your own vehicle: probably (with help from friends and eventually on my own)<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional notes: Looking to move on a car pretty soon and am just torn and looking for some additional advice. I currently have a 2007 Toyota Rav4 and am not looking to put any additional money into it in order to pass inspection because it keeps getting more expensive and the car is at 196k miles.<\/p>\n\n<p>I am in a position financially to get something on my own. I basically keep going back and forth though because I love smaller sporty cars and crossovers like FiST, FocusST, and CX-3 that have nice body styles. I really like the CX-3 because it is automatic, within my price range for a 2016\/17 Grand Touring model, and has a body style that I is visually appealing to me. I do not need something that is performance based as I am a more casual driver, but the CX-3 seems to still be a nice\/fun drive. <\/p>\n\n<p>My concern comes in with space, I have been so used to having the trunk space of my Rav-4 and it&#39;s really convenient to throw skis, golf clubs, luggage, beer coolers into my trunk or my kayak on the roof while also being able to fit friends in the back seat if necessary. It seems like realistically though, to get a car of this size within my budget I would be looking at a baseline 2015\/16 model. <\/p>\n\n<p>At the end of the day, I&#39;m trying to rationalize how often I really would have people in my backseat and how often I would really need to be taking with me. I know with the CX-3 I would be able to get roof rack\/storage for skis and kayak, but feel like I could get away with a mixture of golf clubs, luggage, and a cooler in the backseats with both or the 60 side folded down. Plus a passenger in the back who knew they would be cramped. One of my best friends has a FiST and has made our mountain trip with 2 passengers and the rest of his car packed to the max. Or I could look into something like an HR-V, that appeals to me less for it&#39;s visual exterior and interior style, but would give me more space. <\/p>\n<\/div>","78":"<div class=\"md\"><p>So my mom has a Nissan Altima for work and after I think 70 or 80 thousand miles she gets a new car and they offer the current car to buy for what the dealer is willing to pay for if u wanted to keep it and own it and my mom said preveious cars she got offered from her work were good prices its prob a 2014 or 15 idk I dont imagine any older. Im 16 and Im saving up for a car would it be a good first car and if so how much would be too much to take it for. Im in IL. I know my username is duramax I love trucks but the prices for a truck are kinda over the amount I can afford where I am lol so maybe when im older<\/p>\n<\/div>","79":"<div class=\"md\"><p>Location: North Korea\n Price range: 20 milli\n New or used: new Type of vehicle: luxury \nMust haves: Fuel efficient \nDesired transmission : Manual \nIntended use: Daily use \nVehicles you&#39;ve already considered: Ferrari la ferrari \nIs this your 1st vehicle:Yes \nDoes the vehicle need to have a warranty: no its heavily aromoured Can you do Minor work on your own vehicle: if you want Can you do Major work on your own vehicle:NOOOO<\/p>\n<\/div>","80":"<div class=\"md\"><p>Subaru<\/p>\n<\/div>","81":"<div class=\"md\"><p>Thanks for the suggestions, those Acuras look like great options.<\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1,"77":1,"78":1,"79":1,"80":1,"81":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null,"77":null,"78":null,"79":null,"80":null,"81":null},"comment_edited":{"0":false,"1":1510603053.0,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":1510610960.0,"9":false,"10":false,"11":1510725981.0,"12":false,"13":1510949239.0,"14":false,"15":false,"16":1510692997.0,"17":false,"18":1510785498.0,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":1511082343.0,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":1510713460.0,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":1510856949.0,"46":false,"47":1510881131.0,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false},"comment_score":{"0":14,"1":7,"2":6,"3":6,"4":7,"5":5,"6":4,"7":3,"8":3,"9":3,"10":3,"11":3,"12":3,"13":3,"14":4,"15":2,"16":2,"17":2,"18":2,"19":2,"20":2,"21":2,"22":2,"23":2,"24":2,"25":2,"26":2,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":0,"75":-1,"76":0,"77":0,"78":0,"79":0,"80":-1,"81":1},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false},"author_id":{"0":"9ntgl","1":"1lk17ry","2":"10fba6","3":"oa86u","4":"mncrm","5":"","6":"c4jnc","7":"dnaol","8":"8n42ico","9":"cgar1","10":"ff2h9","11":"","12":"nigtw","13":"8jaup","14":"axa07","15":"ehwcg","16":"","17":"xo7kt","18":"dvdgi0c","19":"12khh5","20":"7swpd","21":"9kioc","22":"8ni9u","23":"16oobg","24":"1lq5okq","25":"","26":"l7i8hp2","27":"vg8qj7","28":"148l56","29":"t7jm3","30":"9pv3a","31":"","32":"","33":"1ij0g4v","34":"hqfta","35":"","36":"5d1qm","37":"nzi0t","38":"73rtr","39":"7mkuv","40":"1380eo","41":"","42":"","43":"4i0kf","44":"c1qptfh","45":"slhwu","46":"","47":"","48":"77f2g","49":"f5uto","50":"gyxsz","51":"14gf5r","52":"","53":"bd38q","54":"x341f","55":"3tirldw","56":"","57":"c48y4","58":"8nq4i","59":"8u0f8","60":"13vx7e","61":"","62":"11gmsn","63":"","64":"5fc3c","65":"ewp6i","66":"1rv2ch8","67":"xa6cn","68":"9atv3","69":"i7hbk","70":"fmt0r","71":"nk0i0","72":"angi3","73":"","74":"","75":"rilld","76":"e83s4","77":"abd9j","78":"lcumlqs","79":"ljxijcx","80":"","81":"cgar1"},"author_name":{"0":"MisterMiniS","1":"DaveyTheBoxFratelli","2":"NatesNewLife","3":"PotatoWithAnE","4":"SaerynRatax","5":"","6":"ddh0","7":"Stealthpot","8":"iamjackslackofwords","9":"JMODS5710","10":"Sqeeter","11":"","12":"knee-of-justice","13":"bayradbury","14":"Sheehan7","15":"Katryonyx","16":"","17":"tablepancake","18":"Buklawa","19":"PeeThenPoop","20":"ztg5003","21":"Hoopty50","22":"ninjamuffins","23":"telomce","24":"Oracle_of_Ages","25":"","26":"AlvasYavas","27":"afuturisticdystopia","28":"dew911","29":"Republikofmancunia","30":"jimmpony","31":"","32":"","33":"shadowsilver00","34":"Chucho4","35":"","36":"bananapancakez","37":"BuzzwordsAreBoring","38":"disgustedRedditor","39":"PostYourSinks","40":"CommunistFinch","41":"","42":"","43":"redli0nswift","44":"AnonymousIndustries","45":"SpiritDetectiveU","46":"","47":"","48":"Turdsworth","49":"WeeniePops","50":"krisharmas","51":"747Dragon","52":"","53":"realstreets","54":"AshtyR","55":"ChillaxJ","56":"","57":"HalfBakedIndividual","58":"cr0tchp33do","59":"Bbypndabamboo","60":"CleverRat","61":"","62":"derrick_12341","63":"","64":"Flaxh","65":"Vibed","66":"ognickkb","67":"knefeh","68":"longgamma","69":"shanesuss","70":"Datum000","71":"precense_","72":"oprahwinfrey666","73":"","74":"","75":"WVPrepper","76":"maximus9966","77":"OutrageousAnimals","78":"Duramax_","79":"Big-Boy-Bubs","80":"","81":"JMODS5710"}}