{"comment_id":{"0":"dqf9o5h","1":"dqf3emf","2":"dqew98z","3":"dqeu6l4","4":"dqf4uqr","5":"dqfgo6s","6":"dql4vi9","7":"dqf312t","8":"dqfacvz","9":"dqfofsh","10":"dqfrlx1","11":"dqgapm3","12":"dqmjlj1","13":"dqfsj24","14":"dqgo6vz","15":"dqgrd4j","16":"dqgymd0","17":"dqh31m5","18":"dqhgyem","19":"dqhwb6o","20":"dqmer6a","21":"dqn729j","22":"dqg44p4","23":"dqew1e0","24":"dqewzqu","25":"dqex4lc","26":"dqf10pm","27":"dqf2ihn","28":"dqf2ygp","29":"dqf39ob","30":"dqf6mie","31":"dqf7fqh","32":"dqfghir","33":"dqfk5ou","34":"dqfuc8p","35":"dqfv39z","36":"dqfzebc","37":"dqg0h1g","38":"dqg135c","39":"dqg1o3v","40":"dqg81fr","41":"dqg8uri","42":"dqga7gh","43":"dqgft81","44":"dqhbbaw","45":"dqhbu2s","46":"dqhca5j","47":"dqhfddl","48":"dqhzl9c","49":"dqi4ss0","50":"dqi65jz","51":"dqi6aom","52":"dqidyhg","53":"dqifnp3","54":"dqij1dv","55":"dqio2k9","56":"dqip3mu","57":"dqiq6jc","58":"dqiztl1","59":"dqj2l3u","60":"dqj53s9","61":"dqjesh0","62":"dqjfs5h","63":"dqjfvo9","64":"dqjk3bh","65":"dqjmqop","66":"dqjpbpj","67":"dqjs3lm","68":"dqjvyut","69":"dqk4jj9","70":"dqk87a4","71":"dqkbisv","72":"dqki4rb","73":"dqkoeh1","74":"dqkr89h","75":"dqkvzbi","76":"dql2b9u","77":"dql9owx","78":"dqlcsag","79":"dqljfu8","80":"dqmyy1r","81":"dqn3d43","82":"dqn82ro","83":"dqnu2rp","84":"dqoom89","85":"dqor19f","86":"dqoskcp","87":"dqotqzr","88":"dqoxmh9","89":"dqpdxyd","90":"dqpe7mh","91":"dqpgeki","92":"dqpvsie","93":"dqpvy3e","94":"dqeytz6","95":"dqkb266","96":"dqkfd2g","97":"dqmy58h","98":"dqn9h0i","99":"dqf5t7p","100":"dqjfg0t","101":"dqjpwq1","102":"dqop87b"},"comment_parent_id":{"0":"t3_7fwi3u","1":"t3_7fwi3u","2":"t3_7fwi3u","3":"t3_7fwi3u","4":"t3_7fwi3u","5":"t3_7fwi3u","6":"t3_7fwi3u","7":"t3_7fwi3u","8":"t3_7fwi3u","9":"t3_7fwi3u","10":"t3_7fwi3u","11":"t3_7fwi3u","12":"t3_7fwi3u","13":"t3_7fwi3u","14":"t3_7fwi3u","15":"t3_7fwi3u","16":"t3_7fwi3u","17":"t3_7fwi3u","18":"t3_7fwi3u","19":"t3_7fwi3u","20":"t3_7fwi3u","21":"t3_7fwi3u","22":"t3_7fwi3u","23":"t3_7fwi3u","24":"t3_7fwi3u","25":"t3_7fwi3u","26":"t3_7fwi3u","27":"t3_7fwi3u","28":"t3_7fwi3u","29":"t3_7fwi3u","30":"t3_7fwi3u","31":"t3_7fwi3u","32":"t3_7fwi3u","33":"t3_7fwi3u","34":"t3_7fwi3u","35":"t3_7fwi3u","36":"t3_7fwi3u","37":"t3_7fwi3u","38":"t3_7fwi3u","39":"t3_7fwi3u","40":"t3_7fwi3u","41":"t3_7fwi3u","42":"t3_7fwi3u","43":"t3_7fwi3u","44":"t3_7fwi3u","45":"t3_7fwi3u","46":"t3_7fwi3u","47":"t3_7fwi3u","48":"t3_7fwi3u","49":"t3_7fwi3u","50":"t3_7fwi3u","51":"t3_7fwi3u","52":"t3_7fwi3u","53":"t3_7fwi3u","54":"t3_7fwi3u","55":"t3_7fwi3u","56":"t3_7fwi3u","57":"t3_7fwi3u","58":"t3_7fwi3u","59":"t3_7fwi3u","60":"t3_7fwi3u","61":"t3_7fwi3u","62":"t3_7fwi3u","63":"t3_7fwi3u","64":"t3_7fwi3u","65":"t3_7fwi3u","66":"t3_7fwi3u","67":"t3_7fwi3u","68":"t3_7fwi3u","69":"t3_7fwi3u","70":"t3_7fwi3u","71":"t3_7fwi3u","72":"t3_7fwi3u","73":"t3_7fwi3u","74":"t3_7fwi3u","75":"t3_7fwi3u","76":"t3_7fwi3u","77":"t3_7fwi3u","78":"t3_7fwi3u","79":"t3_7fwi3u","80":"t3_7fwi3u","81":"t3_7fwi3u","82":"t3_7fwi3u","83":"t3_7fwi3u","84":"t3_7fwi3u","85":"t3_7fwi3u","86":"t3_7fwi3u","87":"t3_7fwi3u","88":"t3_7fwi3u","89":"t3_7fwi3u","90":"t3_7fwi3u","91":"t3_7fwi3u","92":"t3_7fwi3u","93":"t3_7fwi3u","94":"t3_7fwi3u","95":"t3_7fwi3u","96":"t3_7fwi3u","97":"t3_7fwi3u","98":"t3_7fwi3u","99":"t3_7fwi3u","100":"t3_7fwi3u","101":"t3_7fwi3u","102":"t3_7fwi3u"},"comment_created_utc":{"0":1511817896.0,"1":1511811658.0,"2":1511804468.0,"3":1511802342.0,"4":1511813104.0,"5":1511825303.0,"6":1512090574.0,"7":1511811284.0,"8":1511818588.0,"9":1511834171.0,"10":1511837576.0,"11":1511874073.0,"12":1512160108.0,"13":1511838611.0,"14":1511890148.0,"15":1511893206.0,"16":1511900192.0,"17":1511904277.0,"18":1511919250.0,"19":1511940233.0,"20":1512155417.0,"21":1512187906.0,"22":1511857494.0,"23":1511804245.0,"24":1511805223.0,"25":1511805363.0,"26":1511809268.0,"27":1511810768.0,"28":1511811210.0,"29":1511811520.0,"30":1511814863.0,"31":1511815667.0,"32":1511825097.0,"33":1511829315.0,"34":1511840795.0,"35":1511841720.0,"36":1511847944.0,"37":1511849737.0,"38":1511850852.0,"39":1511851990.0,"40":1511868299.0,"41":1511870296.0,"42":1511873148.0,"43":1511881298.0,"44":1511912819.0,"45":1511913419.0,"46":1511913935.0,"47":1511917458.0,"48":1511948240.0,"49":1511960345.0,"50":1511962414.0,"51":1511962612.0,"52":1511971211.0,"53":1511972883.0,"54":1511976143.0,"55":1511980952.0,"56":1511981918.0,"57":1511982943.0,"58":1511991824.0,"59":1511994478.0,"60":1511997119.0,"61":1512008295.0,"62":1512009438.0,"63":1512009549.0,"64":1512014533.0,"65":1512018096.0,"66":1512022172.0,"67":1512027609.0,"68":1512037759.0,"69":1512053382.0,"70":1512057253.0,"71":1512060477.0,"72":1512066760.0,"73":1512072846.0,"74":1512075611.0,"75":1512080391.0,"76":1512087493.0,"77":1512096056.0,"78":1512099614.0,"79":1512109095.0,"80":1512177157.0,"81":1512182852.0,"82":1512189401.0,"83":1512233546.0,"84":1512270176.0,"85":1512273161.0,"86":1512275008.0,"87":1512276510.0,"88":1512282074.0,"89":1512317803.0,"90":1512318156.0,"91":1512320822.0,"92":1512336541.0,"93":1512336707.0,"94":1511807075.0,"95":1512060034.0,"96":1512064127.0,"97":1512176116.0,"98":1512191639.0,"99":1511814057.0,"100":1512009044.0,"101":1512023188.0,"102":1512270923.0},"comment_body":{"0":"<div class=\"md\"><p>Location: New England, USA<\/p>\n\n<p>Price range: $15-20,000<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must haves: Emergency braking &amp; AWD<\/p>\n\n<p>Transmission: Auto<\/p>\n\n<p>Intended Use: Daily Drive for commute<\/p>\n\n<p>Vehicles considered: Completely open <\/p>\n\n<p>1st vehicle: No<\/p>\n\n<p>Needs a warranty: No<\/p>\n\n<p>Minor repairs: Yes<\/p>\n\n<p>So my wife is currently driving a 2010 Infiniti M35X. She is a great wife but a pretty terrible driver. Granted she puts a lot of miles on her car (bought the M35 with 20K miles and currently has 170K) but she&#39;s been involved in a few rear end collisions. <\/p>\n\n<p>I have come to the conclusion that I will never break her of her bad driving habits and her next vehicle has to have emergency braking. Like actual auto braking vs a system that simply &quot;primes&quot; the brakes.<\/p>\n\n<p>So I&#39;m looking for a nicer used luxury(ish) sedan that will keep her out of other peoples trunks!<\/p>\n<\/div>","1":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","2":"<div class=\"md\"><p>Looking for a used car that I can learn on. I&#39;ve worked as a mechanic for about 6 months full time. I&#39;ve done oil changes, brakes, some interior stuff, a couple rotors, studs, transmission filter, alternator, some spark plugs, some suspension work etc. Nothing major, mostly small work.<\/p>\n\n<p>Location - Alberta<\/p>\n\n<p>Price range - 1000-2500<\/p>\n\n<p>New or used - Used<\/p>\n\n<p>Type - sedan\/sport\/race<\/p>\n\n<p>Must haves - not sure, I don&#39;t know what to look for in a project car.<\/p>\n\n<p>Desired transmission -  manual preferred<\/p>\n\n<p>Intended use - project car<\/p>\n\n<p>Vehicles you&#39;ve already considered - again, not too sure about this one.<\/p>\n\n<p>Is this your first car? - no this will be my 3rd. My first was a focus hatchback. It was good for a first car but I constantly had to do work on it. Then I had a Honda civic (manual) which I&#39;ve been loving so far.<\/p>\n\n<p>Warranty? - no<\/p>\n\n<p>Minor work? Yes<\/p>\n\n<p>Major work? - no, but I want to learn<\/p>\n<\/div>","3":"<div class=\"md\"><p>When shopping for fast 4-doors under 35k, are the Jaguar XFs worth looking into compared to the Civic type R and other sporty dailies?<\/p>\n<\/div>","4":"<div class=\"md\"><ul>\n<li>New Orleans<\/li>\n<li>10k<\/li>\n<li>Used<\/li>\n<li>Car<\/li>\n<li>Preferably Japanese and\/or known for reliability, good MPG, cheap insurance. <\/li>\n<li>I&#39;m a delivery driver and this will be my daily for that job<\/li>\n<li>Auto or manual is fine<\/li>\n<li>I can do minor work, nothing major<\/li>\n<li>Just wanted the cheapest (with relatively low miles) car with great reliability, as I use it for work 5 days a week<\/li>\n<\/ul>\n<\/div>","5":"<div class=\"md\"><p>• Location: USA, Seattle<\/p>\n\n<p>• Price range: $15k max<\/p>\n\n<p>• New or used: Used<\/p>\n\n<p>• Type of vehicle: Sports sedan\/coupe\/hatch<\/p>\n\n<p>• Must haves: RWD or AWD, fun to drive, somewhat nice\/modern interior, four seats<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): Manual or good flappy paddle<\/p>\n\n<p>• Intended use: Daily driver, possible track days<\/p>\n\n<p>• Vehicles you&#39;ve already considered: <\/p>\n\n<p>BMW 1\/3 series<\/p>\n\n<p>Jaguar XF 1st gen - does anyone know anything about these?<\/p>\n\n<p>Audi S4<\/p>\n\n<p>Lexus IS 350 - doesn&#39;t seem as fun but way more reliable<\/p>\n\n<p>Focus\/fiesta ST - not excited about FWD, but I hear so much about them I&#39;d be willing to try it out<\/p>\n\n<p>Volvo S60 - I&#39;m a little confused by the models\/trims on these, but the AWD and power seems nice. Anyone know more about them?<\/p>\n\n<p>• Is this your 1st vehicle: No<\/p>\n\n<p>• Does the vehicle need to have a warranty: No but obviously that would be nice<\/p>\n\n<p>• Can you do Minor work on your own vehicle: No but I&#39;d be willing to learn if it&#39;s easy<\/p>\n\n<p>• Can you do Major work on your own vehicle: No<\/p>\n\n<p>• Additional Notes: I don&#39;t know how to drive manual but I&#39;d love to learn. It has to be more reliable than a 2000 Merc S430 for my wife to approve, but that&#39;s a pretty low bar. The most important thing is that is fun and pretty quick<\/p>\n<\/div>","6":"<div class=\"md\"><p><strong>Location<\/strong>: Downstate New York\/ Long Island<\/p>\n\n<p><strong>Price range<\/strong>: ~$1500<\/p>\n\n<p><strong>New or used<\/strong>: Used Af<\/p>\n\n<p><strong>Type of vehicle<\/strong>: Sports\/Compact<\/p>\n\n<p><strong>Must haves<\/strong>: Manual Transmission\/ Easy to work on<\/p>\n\n<p><strong>Desired transmission<\/strong>: Manual<\/p>\n\n<p><strong>Intended use<\/strong>: POS fun car to learn to drive stick on.<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: Lmao<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle<\/strong>: No<\/p>\n\n<p><strong>Additional Notes<\/strong>: Just looking for something to throw around and have fun with, I was gonna buy an Iphone X but then I realized this would be much better, open to anything fun to drive and cheap to maintain.<\/p>\n<\/div>","7":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","8":"<div class=\"md\"><p>Hey everyone, I’m torn between buying a 240sx ($4k - $7k) soon, or saving up and buying\/importing a Mitsubishi Evo 6 ($10 - $14k). I’m currently driving a 2005 Mazda 3 as a daily driver and it’s boring as all hell, so I need to get something more exciting, and I’m stuck between a 240 or Evo 6. <\/p>\n\n<p>Location: BC, Canada<\/p>\n\n<p>Price range: 4000-7000 for 240sx, or 10,000-14,000 for Evo 6. <\/p>\n\n<p>They will obviously be used cars. <\/p>\n\n<p>Must haves: enjoyability to work on, lots of aftermarket parts, fun to drive<\/p>\n\n<p>Manual transmission necessary <\/p>\n\n<p>It would have to be a daily driver, considering I’m beginning college in September 2018 and will need a year round car. <\/p>\n\n<p>I’ve considered WRX, 300zx, Evo 4<\/p>\n\n<p>This will be my 4th vehicle. <\/p>\n\n<p>Doesn’t need warranty<\/p>\n\n<p>Minor work: Yes, I have all the necessary tools and knowledge <\/p>\n\n<p>Major work: yes\/no. The I can use the old shop I used to work at for major jobs if they have enough room for me. <\/p>\n\n<p>I’m pretty set on saving up for an Evo, because it seems like it would be the most practical for me considering where I live there can get up to 2 feet of snow in the winter. But at the same time, I have the burning desire to get a 240sx and enjoy working and driving it, rather than driving my automatic Mazda 3 until I can afford an Evo. <\/p>\n\n<p>Anyways, I’m probably overthinking all of this, but any input is appreciated 👌🏼<\/p>\n<\/div>","9":"<div class=\"md\"><p>Pennsylvania with a budget of 12-15k.<\/p>\n\n<p>I currently drive a corolla and while it&#39;s a great commuter car I just feel out of place inside of it. I&#39;m looking for something with awd\/4wd and cargo room. I miss having a bit of ride height and the confidence an awd sytem brings during PA winters. I also like to hit some winding roads like most everyone does, but these two things are hard to find in a package deal.<\/p>\n\n<p>Im not near test drive phase yet but here are the cars I&#39;ve been researching:<\/p>\n\n<p>2012ish xterra: love the truck like look and frame, strong powerplant with plenty of room. Apparently by this year Nissan sorted out the smod. A big ol&#39; truck with the bare minimum of creature comforts and tech features is my cup of tea. This is the kind of car I wouldn&#39;t mind seeing a couple dings on or taking through some brush.<\/p>\n\n<p>Cons: I&#39;d never need that much off road prowess, it would see tight gravel roads and the occasional beach at max. I&#39;d imagine it&#39;s driving characteristics to be that of a truck which I&#39;m unsure I could put up with for long. This is the kind of thing I&#39;d like to throw around on weekends, but maybe not live in it day to day.<\/p>\n\n<p>2012ish Tiguan: This is exactly what I&#39;m looking for, I love the boxy styling and the interior is fantastic. It&#39;s a GTI on stilts, so there is still some fun to be had driving it. You can even get an APR tune if you want.<\/p>\n\n<p>Cons: it&#39;s easier to list what doesn&#39;t go wrong on these, when looking into this car it became tiresome keeping track of all the issues people had.<\/p>\n\n<p><strong>2015 CX5<\/strong> I&#39;ve read that these handle well for their size, which is a big pro. The gas mileage is great and it&#39;s the perfect amount of cargo space. I think they look great, too. <\/p>\n\n<p>Cons: I&#39;ve seen a lot of people describe the engine as gutless and without even driving it I&#39;m guessing that&#39;s accurate. That really isn&#39;t a big deal, I&#39;d never tow anything and I&#39;m not looking 0-60 times here. I&#39;d have to drive it to know for sure, which is another con since at the moment it&#39;s a bit outside my budget.<\/p>\n\n<p>2010ish rav4 v6: I like this one a lot, the v6 option seems like a must. The hard lines of the interior look great to me and I actually like the exterior styling. The gas mileage is good, too.<\/p>\n\n<p>Cons: I can&#39;t look at it and not immediately think soccer mom. I saw 10 of them on my way to work. These are really stupid cons but I&#39;ve got to be honest with myself. I think the only way I&#39;d be happy driving one is if I got some meaty tires and a roof rack. Plus the AWD seems shitty.<\/p>\n\n<p>2008 rdx: The shawd has been praised by many a reviewers and the thought of a turbocharged k series in a cross over tickles my fancy. I really like the interior and the way car looks from certain angles. I could throw some gear in the back for a weekend trip and hit some back roads while in a plush interior.<\/p>\n\n<p>Cons: Shitty gas mileage with a premium price tag and weighs 4000lbs. Looks indredibly silly from the side and the front beak is only slighter better than that of the next year&#39;s model.<\/p>\n\n<p>2009 forester XT: I&#39;ve always had a soft spot for foresters. I like the exterior styling on these a little better than the previous generations, there&#39;s just a bit more bulk to them which I think is nice. Subarus lauded AWD system is something I always wanted to get familiar with. That with a turbocharged boxer sounds good to me.<\/p>\n\n<p>Cons: This the only car I can&#39;t stand the stock ride height of. I think I&#39;d have to get coilovers and give it a more wagony sillouete to be happy. Another big con for me is the interior, I despise the flowy curvature of the dashboard.<\/p>\n\n<p>2011 ex35: This is a weird one for me. I think I only like what it could be, which is a true g35 hatchback. The RWD bias and 300 hp alongside infiniti&#39;s road manners sound like a winner for someone who still wants to lift a hatch and throw some gear into it. It&#39;s more car like than anything I&#39;ve been looking at and it seems like a good fit for a no-kids guy like myself. It comes with a ton of tech stuff and has a nice interior.<\/p>\n\n<p>Cons: It doesn&#39;t look good. As a matter of fact I can barely tell what it looks like, everytime I see one it seems to morph and shift with new strange viewing angles. It also doesn&#39;t have a ton of space and the dash board makes it look like two of those baby bouncer things.<\/p>\n\n<p>2012 Glk350: I would never get this car but I&#39;d like to mention it because It checks off all the boxes for me. I&#39;d love to get one of these and do all the wrong things to it. Take it down some rough fire roads, stick a bunch of window decals on it, hammer out some dents, never give it a bath etc...<\/p>\n\n<p>There&#39;s hard lines all over the place, a boxy exterior, perfect size for weekend trips or city driving, a utilitarian interior wrapped in luxury, brawny v6 with a RWD bias. It&#39;s the affluent suburban mothers chariot but I don&#39;t care, I drool over these.<\/p>\n\n<p>Cons: German luxury run away.<\/p>\n\n<p>This is my short list as of now. While I don&#39;t expect too many people to weigh in on a stranger&#39;s decision to buy a car it was helpful to actually write this out.<\/p>\n\n<p>But if you do have suggestions or experience with any of the aforementioned cars I would appreciate it.<\/p>\n<\/div>","10":"<div class=\"md\"><p>Location: US - Cincinnati, OH<\/p>\n\n<p>Price Range: $15,000 - $20,000<\/p>\n\n<p>Used<\/p>\n\n<p>Type: Sports Car (Coupe or Sedan), Hot Hatch<\/p>\n\n<p>Must haves: Not terribly picky. I would like basic tech like backup camera and comfortable seats, as well as a decent stereo and good sounding engine, at least from the interior. I would like something that is reliable and easier to work on. (transverse FWD V6 is a pain to work on in the Maxima)<\/p>\n\n<p>Desired Transmission: Either manual or really good auto (paddle shifters, DCT, ect.)<\/p>\n\n<p>Vehicles I have considered: FRS\/BRZ (2013-2015), Genesis Coupe (2011-2013), Fiesta ST, Focus ST. <\/p>\n\n<p>Not first vehicle. Previous cars include a 2000 Honda Civic automatic and a 2002 Nissan Maxima 6-speed manual.<\/p>\n\n<p>Warranty not required but appreciated. <\/p>\n\n<p>I can do minor work, but live in an apartment so I have limited access to space to work and tools. <\/p>\n\n<p>I will be trading in my 2002 Maxima when I purchase the new vehicle, but it has 150,000 miles, is leaking powersteering fluid, has broken AC, and an occasional misfire, as well as a salvage title, so I do not really expect to get much for it. <\/p>\n\n<p>I am trying to think if there are any potential vehicles that fit my criteria that I have not yet considered. <\/p>\n<\/div>","11":"<div class=\"md\"><p>Have been helping my father\/mother in law search for a new or newish luxury sedan. He likes a little more performance and she likes things a little more refined. <\/p>\n\n<p>Location - Midwest<\/p>\n\n<p>Price range - up to $65k<\/p>\n\n<p>New or used - New or Lightly Used<\/p>\n\n<p>Type - sedan<\/p>\n\n<p>Must haves - AWD, Comfortable, Decent backseat space<\/p>\n\n<p>Desired transmission -  Auto<\/p>\n\n<p>Intended use - Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered - Cars I’ve suggested (Audi A4\/6, Mercedes E Class, BMW 5 Series, Volvo S90) they also drove a Lexus ES and didn’t like it. The other day they went to Infiniti and drove a Q50s Redsport and absolutely loved it. I’m not too familiar with the car, but I told them to hear back to Audi to drive an S4 as more of a direct comparison since they liked all that extra power. Any other suggestions? <\/p>\n\n<p>Is this your first car? - NO<\/p>\n\n<p>Warranty?  Yes<\/p>\n\n<p>Minor work?  No<\/p>\n\n<p>Major work? - No<\/p>\n<\/div>","12":"<div class=\"md\"><p>On the verge of getting a Hyundai sonata or Hyundai Elantra GT. Any thoughts? I know Hyundai has a bad reputation. Would you advise against me getting it? Thanks. <\/p>\n<\/div>","13":"<div class=\"md\"><ul>\n<li>Michigan<\/li>\n<li>$3000-$4000<\/li>\n<li>Used car (I&#39;ve been looking at older Ford Escapes but open to pretty much anything)<\/li>\n<li>Im pretty flexible with the details.  I would like to have reasonable amounts of storage and as good fuel economy I can get at this price range.<\/li>\n<li>Manual\/Automatic doesn&#39;t matter<\/li>\n<li>I&#39;m currently in Uni so this car won&#39;t be used every single day, but I hope to make it last as long as possible after I graduate<\/li>\n<li>I&#39;ve been looking at the Ford Escape and Focus, but open to pretty much anything<\/li>\n<li>This is the first car that I&#39;m buying for myself<\/li>\n<li>I can only do minor work on it <\/li>\n<\/ul>\n\n<p>I&#39;m moving off campus next semester and its time for me to buy a car.  It needs to have enough space to haul a hockey bag. Open to pretty much anything.<\/p>\n<\/div>","14":"<div class=\"md\"><p>California<\/p>\n\n<p>$5-6k<\/p>\n\n<p>Used<\/p>\n\n<p>Sedan\/hatch<\/p>\n\n<p>Manual preferred<\/p>\n\n<p>Need something fun, cheap<\/p>\n\n<p>Daily driver<\/p>\n\n<p>Looking at Mazda’s. Drove my parents’ Mazda5 Protege and I kinda love it. I’m definitely not that experienced, but of the dozen or so cars I’ve driven this had the funnest handling, hands down. It loves corners and has great suspension. It’s noisy and rattley and it’s tires make adorable chirpy noises here and there, and I love the heck out of it.<\/p>\n\n<p>Okay so that out of the way- Protégés are kinda hard to come by for some reason, does anyone know how Mazda 3s or mazdaspeed 3s compare to it in this regard?<\/p>\n<\/div>","15":"<div class=\"md\"><p>Location: Texas<\/p>\n\n<p>Price range: 5000-15000 USD<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: Coupe or sedan<\/p>\n\n<p>Must haves: Paddleshifters, 4 seats or more<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: Daily Driver, weekend car<\/p>\n\n<p>Vehicles you&#39;ve already considered: BMW 335i, TL type s<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: would be nice to have<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: <\/p>\n\n<p>I&#39;m looking for a fun and reliable car with paddleshifters (my dad won&#39;t let me get a manual). I currently have a 2007 BMW 328i and it currently has a lot of things wrong with it and maintenance costs a lot. I was hoping to get something a little more reliable but at the same time I have been considering the 335i since it is a blast to drive and ticks all my boxes but I&#39;m scared of the maintenance costs. I&#39;d really love to hear your suggestions!<\/p>\n<\/div>","16":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","17":"<div class=\"md\"><p>Location: Charleston or Columbia SC  (College) <\/p>\n\n<p>Price Range: Less than 5k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Looking for a fast v6<\/p>\n\n<p>Must haves: Fuel efficient in city driving, four door, space to carry stuff for college<\/p>\n\n<p>Desired transmission: Automatic<\/p>\n\n<p>Auto intended use: Daily drive with the occasional long trips.<\/p>\n\n<p>Vehicles already considered: Nissan Altima, Ford Taurus, and Mercury Sable<\/p>\n\n<p>Is this your first vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Major work: no<\/p>\n\n<p>Additional Notes: I kinda want something that tears of the line after a red line if that is possible.<\/p>\n<\/div>","18":"<div class=\"md\"><p>Where is a reliable place to get 0-40, or 0-60 times?  Most websites I&#39;ve gone to have some cars but do not have others and comparing times from different places is not a good idea.<\/p>\n<\/div>","19":"<div class=\"md\"><p>So I have been on the lookout for a clean-titled, manual G35 sedan near me for a while, and I finally found one.<\/p>\n\n<p>But it&#39;s 300 miles away and <em>much<\/em> cheaper than it should be. I know I could call up some mechanic for a pre purchase inspection, but I&#39;m kinda hesitant because it looks good, but it&#39;s half the price of comparable models across the country.<\/p>\n<\/div>","20":"<div class=\"md\"><p>Location: Cleveland, Ohio area<\/p>\n\n<p>Price range: $2-4k<\/p>\n\n<p>New or used: either but if new will be financing<\/p>\n\n<p>Type of vehicle: car, sedan, sports car, coupe.<\/p>\n\n<p>Must haves: Fuel efficient and quick or fast. For best price<\/p>\n\n<p>Desired transmission (auto\/manual, etc): manual is desired but automatic is okay.<\/p>\n\n<p>Intended use: Daily driver for college<\/p>\n\n<p>Vehicles you&#39;ve already considered: Chevy Sonic RS, Chevy Cruze, Ford Fiesta (regular and ST), Ford Focus (regular and ST) haven&#39;t looked at many used cars<\/p>\n\n<p>Is this your 1st vehicle: No this would be my second<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: Absolutely<\/p>\n\n<p>Can you do Major work on your own vehicle: Possible but probably not<\/p>\n\n<p>Additional Notes: nothing further<\/p>\n<\/div>","21":"<div class=\"md\"><p>Hey guys, <\/p>\n\n<p>I need some help. I am looking at a white Hyundai Tucson w\/19k on it for $26k tomorrow. I read some issues with the 2016 model having issues with the duel clutch transmission, I have also read a few things about the 2017 having similar issues?  <\/p>\n\n<p>Do you own a Tucson and have you had any issues? <\/p>\n\n<p>What do you like\/dislike about the vehicle?<\/p>\n\n<p>Thanks. <\/p>\n<\/div>","22":"<div class=\"md\"><p>cool<\/p>\n<\/div>","23":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","24":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","25":"<div class=\"md\"><p>Looking for an SUV for my dad. He&#39;s got a Chevy trailblazer that&#39;s about 10 years old now and is really starting to have some issues. He wants something that is basically a new trailblazer. He likes the size and doesn&#39;t want it much bigger and likes that it is distinctly SUV looking as opposed to some smaller suv\/crossovers that lean into the minivan realm. He likes that on the freeway the engine cuts itself from a 6 to a 4 cyl for a little efficiency. He needs it to tow 5-7 thousand pounds. I don&#39;t know where to start looking for him. Any suggestions ?<\/p>\n\n<p>To add\nHe doesn&#39;t have a budget because he wants to figure out what is out there. He said if he limits it at 60 he might miss a great one at 65 or something. Personally I think around 60k is a safe bet and new is preferable but cpo is good too<\/p>\n<\/div>","26":"<div class=\"md\"><p>My husband is having trouble finding a used car around $15,000 USD in TN, and I am out of suggestions. What would you suggest that he take a look at?<\/p>\n\n<p>Us:\n-No Kids\n-Auto preferred. Manual is possible\n-We can do minor work to it, and nearly all routine maintenance<\/p>\n\n<p>Needs:\nReliability\nEconomy (20mpg or better)\nNicer touches (Leather, heated seats)\nAgility (more power than 0-60 in 9 seconds)<\/p>\n\n<p>Likes:\nBluetooth Streaming\nNavi\nHauling capacity (occasional DIY stuff)\nSmiles per gallon<\/p>\n\n<p>Past cars:\n2006 Acura MDX (current)\n2007 Acura TSX\n2004 Honda Accord I4<\/p>\n\n<p>We’ve looked at the Honda CRV but deemed it underpowered. I suggested the Mazda 3 Hatch, but he teeters between wanting a smaller car, and an SUV, so I need help.<\/p>\n<\/div>","27":"<div class=\"md\"><p>Location:  DC Metro Area<\/p>\n\n<p>Price Range:  35,000 - 40,000 USD (+\/- 2-3k)<\/p>\n\n<p>New or Used:  Used<\/p>\n\n<p>Type: Luxury Sedan<\/p>\n\n<p>Must Haves:  Good reliability, less than 30k miles, 300+ HP preferable<\/p>\n\n<p>Desired Transmission:  Auto<\/p>\n\n<p>Intended use:  Daily Driver<\/p>\n\n<p>Already considered:  2015 Audi S4, 2016 Audi A4, Lexus IS300\/350<\/p>\n\n<p>First vehicle:  No<\/p>\n\n<p>Need to have warranty:  Yes<\/p>\n\n<p>Minor\/Major work:  No<\/p>\n\n<p>Additional Notes:  Love my &#39;08 TL, but it&#39;s starting to feel a little long in the tooth.  Purposely left out BMW, they are extremely common here and I don&#39;t want to blend in with the rest of the 3-series rolling around here.<\/p>\n<\/div>","28":"<div class=\"md\"><p>Location: New York, USA<\/p>\n\n<p>Price range: $3500-$8500<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports Car, Sedan, Coupe<\/p>\n\n<p>Must haves: A platform with lots of potential<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual, or a very good auto.<\/p>\n\n<p>Intended use: Daily Driver\/Project Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: G35x, 300zx, GLI, B5 S4, BMW 5 Series (E39)<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc) Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc): Yes<\/p>\n\n<p>Additional Notes: My current car’s tranny is shitting the bed and I have no desire to pay twice the car is worth to replace it. So before it falls apart I’d like to have an idea as to what you guys would think is a good recommendation.<\/p>\n<\/div>","29":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","30":"<div class=\"md\"><p>Why should I not buy a 2011 Golf GTI 5 door with the Autobahn package and 110k kilometres for $15,000?<br\/>\nI get two sets of wheels, one for winter tyres and one for summers, but the winters will immediately need to be replaced.   <\/p>\n\n<p>Located in Toronto, so the price is in Canadian Dollars. <\/p>\n<\/div>","31":"<div class=\"md\"><ul>\n<li>Location: Virginia, USA<\/li>\n<li>Price range: Max $20,000<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: sedan<\/li>\n<li>Must haves: Fuel efficient<\/li>\n<li>Desired transmission: auto<\/li>\n<li>Intended use: Daily Driver<\/li>\n<li>Vehicles you&#39;ve already considered: 2013 Acura ILX Hybrid<\/li>\n<li>Is this your 1st vehicle: no<\/li>\n<li>Does the vehicle need to have a warranty:<\/li>\n<li>Can you do Minor work on your own vehicle: no<\/li>\n<li>Can you do Major work on your own vehicle: no<\/li>\n<li>Additional Notes: Still considering the 2013 Acura ILX Hybrid. Need something with less than $40k miles. Plan to commute about 150 miles per day, 5 days per week. Know next to nothing about car maintenance, so need it to be something most mechanics are familiar with or have many dealership locations nearby. Prefer something that wouldn&#39;t be costly to insure.<\/li>\n<\/ul>\n<\/div>","32":"<div class=\"md\"><pre><code>    * Location: (Colorado)\n\n    * Price range: ($4500-$6000)\n\n    * New or used: Used\n\n    * Type of vehicle: (Crossover, Truck, Car)\n\n    * Must haves: (AWD or FWD, at least 6 cylinder OR turbo, reliable)\n\n    * Desired transmission: Auto\n\n    * Intended use: (Daily Driver, Weekend Car, 4WD roads to trailheads, icy and very snowy roads)\n\n    * Vehicles you&#39;ve already considered: Subaru Outback (had one and loved it)\n\n    * Is this your 1st vehicle: No\n\n    * Does the vehicle need to have a warranty: No\n\n    * Can you do Minor work on your own vehicle: Certainly\n\n    * Can you do Major work on your own vehicle: Nothing huge\n\n    * Additional Notes: Just needs enough room for two people and a bike in the back, nothing smaller than the Subaru Outback, but larger is okay. Need at least as much ground clearance as the Outback\n<\/code><\/pre>\n<\/div>","33":"<div class=\"md\"><p>Location: Houston, Texas\nPrice range: Max $3000\nNew or Used: Used\nType of Vehicle: Truck, car, basically anything \nTransmission: Automatic\nMust haves: can&#39;t be a compact. I need something roomy and comfortable for someone who is 6 foot tall\nIntended use: Daily driver, something to be reliable through college\nVehicles I&#39;ve considered: Crown Vic P-71, already have a Honda Element and want another but not likely\n1st Vehicle: no\nWarranty not neeed\nI can do minor work<\/p>\n<\/div>","34":"<div class=\"md\"><p>Location: Salt Lake City, Utah<\/p>\n\n<p>Price range: Under 10k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Hatchback, Coupe\/Sedan<\/p>\n\n<p>Must haves: Fuel efficient, Quick, Good Looks<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either. Don’t know how to drive manual but willing to learn!<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda 3 Hatchback, Ford Focus Hatchback, Honda Civic<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Definitely<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Just getting into the process of buying a car. Don’t really know what I’m looking for. Want something maybe kind of sportier looking with a nice interior. Good gas mileage and quick. (If I’m asking for too much let me know lmao) <\/p>\n<\/div>","35":"<div class=\"md\"><p>Location: NY<\/p>\n\n<p>Price range: 15k-25k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports sedan<\/p>\n\n<p>Must haves: 300+hp, leather, AWD or RWD<\/p>\n\n<p>Desired transmission (auto\/manual, etc): preferably manual<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: G37, IS350, Charger R\/T, Pontiac G8, MB E550, MB S550, BMW 335i, Audi S4, Acura TL SH-AWD, WRX, WRX STi, Mazdaspeed 6<\/p>\n\n<p>Is this your 1st vehicle:No<\/p>\n\n<p>Does the vehicle need to have a warranty:No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc) Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc )No<\/p>\n\n<p>Additional Notes: I want a quick car that can fit 4 people and still be fun. I also drive around 30k miles a year, so reliability is something to consider<\/p>\n<\/div>","36":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","37":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","38":"<div class=\"md\"><p>Posted last week but realized I was probably too wide in scope to get advice, I think I&#39;ve narrowed down my options:<\/p>\n\n<p>Location: North New Jersey (I hit lots of NYC traffic)\nPrice- Up to $22k\nNew\/used- New\nType- Hatchback\/Hot Hatch\nMust haves- Sunroof, comfortable for 44+ miles\/day in traffic\nTransmission- Manual\nIntended Use- Daily Driver \nConsideration Set- VW Golf TSI, Ford Fiesta ST, Honda Fit, Hyundai Veloster \nMinor Work- very small jobs\nMajor Work - no\nOther Notes: Which cars will have a forgiving clutch\/comfortable throw? I&#39;d love to test drive them all but could use some direction to save time. I currently drive a manual wrangler and I love that the biting point is so easy to roll in and out of 1st gear during bad traffic, but hate that when traffic opens up the car just has no zip. Also, If anyone has experience throwing snow tires on a fwd hatch for the winter I&#39;d love to hear your thoughts. Thanks in advance for any help! <\/p>\n<\/div>","39":"<div class=\"md\"><p>Location: Langley, BC, Canada.<\/p>\n\n<p>Price range: CAD $2,500 - $5,000.<\/p>\n\n<p>New or used: Used.<\/p>\n\n<p>Type of vehicle: Hatchback, coupe, wagon, or small SUV.<\/p>\n\n<p>Must haves: Good fuel efficiency, decent looks.<\/p>\n\n<p>Transmission: Auto.<\/p>\n\n<p>Intended use: Commuter for work, trips to Squamish for bouldering.<\/p>\n\n<p>Vehicles I have considered: Acura Integra, Honda civic, Honda accord, Jeep cherokee Sport (pre 2000), Subaru Outback.<\/p>\n\n<p>First vehicle: No.<\/p>\n\n<p>Warranty: No.<\/p>\n\n<p>Can you work on your vehicle: I can do basic things but i&#39;d probably take it to a shop. <\/p>\n\n<p>Notes: <a href=\"https:\/\/vancouver.craigslist.ca\/rds\/cto\/d\/red-acura-integra-for-sale\/6373116309.html\">There&#39;s an Integra im pretty set on unless someone has a better idea.<\/a><\/p>\n<\/div>","40":"<div class=\"md\"><p>Location: Adelaide, Australia<\/p>\n\n<p>Price range: 2000-5000 AUD<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Hatchback, wagon, compact SUV, sedan <\/p>\n\n<p>Must haves:  reliable, safe<\/p>\n\n<p>Desired transmission : Auto<\/p>\n\n<p>Intended use: Daily Driver, road trip<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty:<\/p>\n\n<p>Can you do Minor work on your own vehicle: can change basic oils<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n<\/div>","41":"<div class=\"md\"><p>Location: Eastern Virginian<\/p>\n\n<p>Price range: $25,000 or less <\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: car<\/p>\n\n<p>Must haves: fun to drive<\/p>\n\n<p>Desired transmission: manual<\/p>\n\n<p>Intended use: daily driver<\/p>\n\n<p>Vehicles I&#39;ve already considered: Ford fiesta ST, focus ST, Honda Civic Si, VW golf GTI<\/p>\n\n<p>First vehicle?: No<\/p>\n\n<p>Warranty: ideally<\/p>\n\n<p>Can I do minor or major work: no<\/p>\n\n<p>Additional notes: looking for something that is fun to drive, have highly been considering the Fiesta ST as it is the cheapest. Starting to consider some used cars in the hopes to save money. <\/p>\n\n<p>Edit: formatting<\/p>\n<\/div>","42":"<div class=\"md\"><p>Location: UK<\/p>\n\n<p>Max Price: £17k<\/p>\n\n<p>Either new or used, not fussed really<\/p>\n\n<p>Type of vehicle: Car<\/p>\n\n<p>Must haves: A bit of power, fun to drive, nice looking, nice interior <\/p>\n\n<p>Desired transmission: manual preferably but I wouldn&#39;t mind an automatic <\/p>\n\n<p>Intended use: daily driver <\/p>\n\n<p>Vehicles I&#39;ve already considered: Toyota gt86\/BRB, Mazda MX5, Fiesta ST, Golf GTI, Honda Civic Type R, Audi TT, Ford Mustang <\/p>\n\n<p>First vehicle: No<\/p>\n\n<p>Warranty: would be nice but not a requirement <\/p>\n\n<p>Can I do work: Nope, but I know people who can and I&#39;m willing to learn<\/p>\n<\/div>","43":"<div class=\"md\"><p>I&#39;ve been searching for a few months, already have a few options but want to know if there&#39;s more out there that I&#39;m overlooking.<\/p>\n\n<ul>\n<li><strong>Location:<\/strong> Florida<\/li>\n<li><strong>Price range:<\/strong> Capping out at $35k if buying, up to around $50k if leasing.<\/li>\n<li><strong>New or used:<\/strong> Either\/Or. I&#39;d most likely lease new and buy used.<\/li>\n<li><strong>Type of vehicle:<\/strong> Sport sedan or (large-ish) coupe.<\/li>\n<li><strong>Must-haves:<\/strong> I&#39;m looking for a 0-60 in the low 5s or quicker and a somewhat useable rear seat.<\/li>\n<li><strong>Desired transmission:<\/strong> Any<\/li>\n<li><strong>Intended use:<\/strong> Daily Driver<\/li>\n<li><strong>Vehicles you&#39;ve already considered:<\/strong> Lexus IS 350 F-Sport, Dodge Challenger Scat Pack, Chevy SS<\/li>\n<li><strong>Is this your first vehicle?<\/strong> No.<\/li>\n<li><strong>Does the vehicle need to have a warranty:<\/strong> Yes, preferably<\/li>\n<li><strong>Can you do minor work on your own vehicle?<\/strong> No, apartment management won&#39;t let us do work in the parking lot.<\/li>\n<li><strong>Can you do major work on your own vehicle?<\/strong> No.<\/li>\n<li><strong>Additional notes:<\/strong> A roomy driver&#39;s seat is a plus.<\/li>\n<\/ul>\n\n<p>I&#39;ve already test-driven a 2015 IS 350 and crossed it off the list. Everything was great except the seat was far too narrow and the seat bolster too intrusive.<\/p>\n\n<p>I really like the idea of the Scat Pack, but I haven&#39;t sat in one yet. They seem to hold on to their value particularly well--used prices are higher than you might expect, which sometimes moves a 3 year old well-optioned model out of my price range.<\/p>\n\n<p>There&#39;s a few used and\/or certified Chevy SSs within 200 miles of me and I&#39;m warming up to them. The 2014s are very affordable, the 2015s less so. The 2015s added magnetic ride suspension and I don&#39;t know if that&#39;s really worth the extra $3-5k. The tech in them is also very dated looking compared to the same years of the Challenger, but they&#39;re also very well appointed with standard leather, ventilated seats, remote start etc.<\/p>\n<\/div>","44":"<div class=\"md\"><p>Location: America, california, santa maria<\/p>\n\n<p>Price range: $0 - $5000 (not 100% firm)<\/p>\n\n<p><del>New<\/del> or USED:<\/p>\n\n<p>Type of vehicle: Sport, mustang, chevrolet style<\/p>\n\n<p>Must haves: Looking for the most reliable car at the cheapest price that looks good.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual is prefered but automatic is fine<\/p>\n\n<p>Intended use: Regular driving, rather short distances<\/p>\n\n<p>Vehicles you&#39;ve already considered: Just starting to look<\/p>\n\n<p>Is this your 1st vehicle: drove peugeot 2006, toyota avensis (2008?), volkswagen transporter T5<\/p>\n\n<p>Does the vehicle need to have a warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: anything that I can learn online without putting the car at risk<\/p>\n\n<p>Can you do Major work on your own vehicle: no, looking to learn though<\/p>\n\n<p>Additional Notes: Looking for the best looking car I can get that is as reliable as possible<\/p>\n<\/div>","45":"<div class=\"md\"><p>Location: America, Oklahoma, OKC metro<\/p>\n\n<p>Price range: $0 - ~$12k (somewhat flexible but not much more)<\/p>\n\n<p>New or used: Either, if used then ~2012 or newer<\/p>\n\n<p>Type of vehicle: Car or Small SUV, again fairly flexible<\/p>\n\n<p>Must haves: Pretty good fuel economy, 4 door, 4WD\/AWD preferred<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either<\/p>\n\n<p>Intended use: Daily driver, some longer trips (~300 miles roundtrip)<\/p>\n\n<p>Vehicles you&#39;ve already considered: a wide variety of 4-door sedans or small SUVs<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Preferable<\/p>\n\n<p>Can you do Minor work on your own vehicle: somewhat, but getting better<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Nothing at this time, will edit as I think of anything further<\/p>\n<\/div>","46":"<div class=\"md\"><p>Location: Minneapolis, MN<\/p>\n\n<p>Price range: $7-10k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must Haves: Safe and Reliable.  I am also 6’4, so headroom is a plus<\/p>\n\n<p>Transmission: Auto<\/p>\n\n<p>Intended Use: Daily Drive and 4-5 hour weekend travel.<\/p>\n\n<p>Vehicles considered: Accord, Camry, open to suggestion<\/p>\n\n<p>1st vehicle: No<\/p>\n\n<p>Needs a warranty: No<\/p>\n\n<p>Do repairs myself: Nope<\/p>\n\n<p>I just totaled my 2010 equinox and want to get a sedan (my wife has a 2014 Nissan Rogue so we don’t want another small SUV)<\/p>\n\n<p>Since Minnesota is freezing 6 months of the year and I am transporting my 1 month old, I need a car that is safe, reliable, and ideally auto-start as we have an detached garage. Any advice is appreciated!<\/p>\n<\/div>","47":"<div class=\"md\"><p>-Location: Washington, DC<\/p>\n\n<p>-Price range: anything under ~$5000<\/p>\n\n<p>-New or Used: Used<\/p>\n\n<p>-Type of vehicle: Anything with 5 or more seats, preferably a sedan though<\/p>\n\n<p>-Transmission: Manual<\/p>\n\n<p>-Intended use: Daily driver\/weekend car<\/p>\n\n<p>-Vehicles I&#39;ve already considered: Honda civic, Honda Accord, Acura TL, BMW e30<\/p>\n\n<p>-Is this your 1st Vehicle: Yes<\/p>\n\n<p>-Warranty: no<\/p>\n\n<p>-Can you do minor work: No, but I aim to learn how to do so with this vehicle<\/p>\n\n<p>-Can you do major work: No, but I aim to learn how to do so with this vehicle<\/p>\n<\/div>","48":"<div class=\"md\"><p>Location: USA <\/p>\n\n<p>Price range: $10,000 USD max<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Coupe, Sports Sedan, Hatchback<\/p>\n\n<p>Must haves: 4\/5 seats, Asian<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic<\/p>\n\n<p>Intended use: Daily Driver\/Project Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazdaspeed 3, Lexus IS300, Infiniti G35\/37 (coupe and sedan)<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I am pretty much just looking for something stock that is faster than a 2011 2.0T Hyundai Genesis. Long story short, I have a friend who swears that his Genesis is the best thing since sliced bread, and it would be fun to shut him up for once, because I currently drive a SUV.<\/p>\n\n<p>Edit: I could go American or European and easily beat out his Genesis, but I personally prefer Asian cars more and he wouldn&#39;t accept it unless I beat him with an Asian car.<\/p>\n<\/div>","49":"<div class=\"md\"><p>This is more of a general question, but how much should you take into account reliability reports when leasing a car?  I see BMW and Land Rover and Chrysler makes get trashed here but realistically how much more work would they need in the first 30,000 miles? <\/p>\n<\/div>","50":"<div class=\"md\"><p>Hi everyone, my wife and I are looking to buy her an SUV now that we&#39;ve moved to Denver. This car would be for her daily commute as well as our weekend car for road trips, going up to snowboard, etc. It&#39;s just the two of us in our family. We have two candidates we&#39;ve narrowed it down two (both used), I&#39;d love to get opinions on which way to go, we&#39;re pretty evenly split.<\/p>\n\n<p>Option 1: \n* Used 2015 Santa Fe Sport 2.0T AWD\n* 36K Miles\n* Ultimate package\n* -Heated and cooled seats\n* -Heated steering wheel\n* -Nav\n* -Panoramic sunroof\n* <strong>$25K<\/strong><\/p>\n\n<p>Option 2:\n* Used 2016 Toyota RAV4 Hybrid Limited (AWD)\n* 30K Miles\n* Fully loaded\n* -360 Pano Parking assist\n* -Safety features - auto braking\n* -Heated seats\n* -Heated wheel \n* <strong>$28K<\/strong><\/p>\n\n<p>Edit:\n* Option 1: <a href=\"https:\/\/www.cars.com\/vehicledetail\/detail\/719253857\/overview\/\">https:\/\/www.cars.com\/vehicledetail\/detail\/719253857\/overview\/<\/a>\n* Option 2: <a href=\"https:\/\/www.cars.com\/vehicledetail\/detail\/717572430\/overview\/\">https:\/\/www.cars.com\/vehicledetail\/detail\/717572430\/overview\/<\/a><\/p>\n\n<p>Please help!<\/p>\n<\/div>","51":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","52":"<div class=\"md\"><ul>\n<li><strong>Location:<\/strong> Cleveland Area, Ohio, US<\/li>\n<li><strong>Price range:<\/strong> Soft-limit of $10k<\/li>\n<li><strong>New or Used:<\/strong> Used<\/li>\n<li><strong>Type of Vehicle:<\/strong> Anything close to compact sedan (hatch, ect.)<\/li>\n<li><strong>Must-haves:<\/strong> &gt; 25 combined mpg, touch infotainment w\/ android auto (or ability to swap head unit easily), FWD or AWD preferred (gotta love those NE Ohio winters), something made this decade<\/li>\n<li><strong>Transmission:<\/strong> Auto<\/li>\n<li><strong>Intended Use:<\/strong> Daily<\/li>\n<li><strong>Considered Vehicles:<\/strong> Cruze, Mazda 3, Veloster, GTI(not likely considering price), Malibu<\/li>\n<li><strong>1st Vehicle:<\/strong> First purchase, but not first vehicle<\/li>\n<li><strong>Warranty:<\/strong> Wouldn&#39;t hurt but not 100% necessary<\/li>\n<li><strong>Minor Work:<\/strong> Yes<\/li>\n<li><strong>Major Work:<\/strong> Yes if Chevorlet<\/li>\n<li><strong>Additional Notes:<\/strong> Looking to get a good, cheap car that will last at least the next 5 years. My dad is a mechanic for Chevy, so any GM vehicle could be serviced for free (minus cost of parts). Ideally looking for something a little more peppy then the &#39;05 Malibu Classic I currently drive. <\/li>\n<\/ul>\n<\/div>","53":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","54":"<div class=\"md\"><p>Trying to decide between new cars. I was basically ready to buy a gti but i went on another test drive where the salesman let me push it a bit and I got suddenly pretty disappointed. The ride was no where near as composed or comfortable as I&#39;d remembered from earlier test drives or heard in every review, and more shocking it didn&#39;t feel like it handled well. Like on an exit ramp the car understeered horribly and tried to plough itself straight ahead. I&#39;m going to try it again this afternoon and see if maybe the other one I drove was just fucked up maybe idk.<\/p>\n\n<p>Also figured I&#39;d look at a gli while I&#39;m at it. I know it&#39;s an older platform, less torque, but besides that any tremendous differences I should think of with it? <\/p>\n\n<p>Also thinking of a focus st or wrx. I drove a focus st a while ago and remember it feeling way faster and more confident in the handling but i read comparisons and it seems to be unanimous the gti should handle better. Wrx i never drove and i hear it just feels really cheap and uncomfortable which would be an issue as I&#39;ll be driving almost a hundred miles a day. The focus i also discounted earlier because it only comes in manual and I&#39;ve never daily driven manual so i was worried how annoying and tiring that might be. But I&#39;m starting to rethink that. <\/p>\n\n<p>The gli or focus it looks like i could get fully loaded for about 24k, the gti one trim level down for about 26k, and it seems the wrx goes for msrp pretty much so I could only get base model, but it should hold its value better it looks like. <\/p>\n<\/div>","55":"<div class=\"md\"><p>I&#39;m a college student looking for my first vehicle and have narrowed it down to a few options. I&#39;m pretty much set on a body-on-frame SUV or a truck, as I work a labor job over the summers and I&#39;m constantly outdoors and love fishing, kayaking, camping, and offroading in general. That being said, it has to be reasonably good as a daily as well. I actually prefer a stiffer, more responsive ride, but I&#39;d like for any passengers not not be crammed in the backseat over a longish drive (I&#39;m 6&#39;1&quot; and like my seat kinda far back) I&#39;m not expecting a fuel sipper but I&#39;d like to not get 16mpg highway if possible. My options are as follows:<\/p>\n\n<ul>\n<li><p>Nissan Xterra<\/p><\/li>\n<li><p>Toyota 4Runner<\/p><\/li>\n<li><p>Ford F150<\/p><\/li>\n<li><p>Chevy Colorado\/GMC Canyon<\/p><\/li>\n<li><p>Ram 1500<\/p><\/li>\n<li><p>Jeep Grand Cherokee (Unibody, yes, but still a pretty rugged vehicle)<\/p><\/li>\n<\/ul>\n\n<p>As of now, I&#39;m looking at the Xterra mainly because of the low price, offroad ability, stock rack on top, and beefy 4L engine. My second choice would be the F150 but they&#39;re often expensive used and they&#39;re very big. My work vehicle is a dually F550 and I could parallel park the fucker, but it&#39;s other drivers swiping me that I worry about.<\/p>\n\n<p>Any opinions? <\/p>\n<\/div>","56":"<div class=\"md\"><p>Location: United States - zip code 66202\nPrice range: 15,000 - 25,0000<\/p>\n\n<p>New or used: Used\nType of vehicle: Car... fast car<\/p>\n\n<p>Must haves: Turbo or V8\nDesired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily Driver\nVehicles you&#39;ve already considered: Focus RS (will go up in price to 30k), WRX, Mustang 2016 GT, VW Golf R<\/p>\n\n<p>Is this your 1st vehicle: No\nDoes the vehicle need to have a warranty: No\nCan you do Minor work on your own vehicle:  yes\nCan you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Really looking for a fast car. Car can be 2 doors or 4 doors but I really need enough room for my kids to sit back there so I am assuming 80% of the 2 door coupes will not work. <\/p>\n<\/div>","57":"<div class=\"md\"><p>Location: Eastern Iowa (US)<\/p>\n\n<p>Price range: $10k - $15k<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: sedan\/hatch\/wagon<\/p>\n\n<p>Must haves: ergonomic, adjustable seats<\/p>\n\n<p>Desired transmission (auto\/manual, etc): manual is a plus, cvt is a negative<\/p>\n\n<p>Intended use: daily driver and frequent road-tripper<\/p>\n\n<p>Vehicles you&#39;ve already considered: Fusion, Optima<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: Ideally, yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: don&#39;t plan to<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: A lot of the good deals people talk about aren&#39;t applicable to Iowa&#39;s crappy used car market<\/p>\n<\/div>","58":"<div class=\"md\"><p>Location: DC Metro Area<\/p>\n\n<p>Price: Lease of ~250\/month, willing to go as high as $315. <\/p>\n\n<p>New<\/p>\n\n<p>Type: SUV, sedan, or coupe<\/p>\n\n<p>Must haves: decent equipment (satellite radio and navigation if no android auto\/CarPlay available, heated seats would be nice), fun to drive and decent performance, gas milage not awful (doesn’t need to be Prius levels of good). <\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Vehicles considered: Hyundai Elantra Sport, Infiniti QX50, Infiniti Q50, Mazda CX-5, BMW 328i, Dodge Challenger GT, Wrangler Sport 2D<\/p>\n\n<p>First car: purchased, but not owned. Currently driving my first (an 09 Elantra). <\/p>\n\n<p>Warranty: yes<\/p>\n\n<p>Minor work: yes, but if leased, would be serviced via dealership anyway. <\/p>\n\n<p>Major work: No<\/p>\n\n<p>Additional notes: understanding fully that sporty SUV is an oxymoron, I’m willing to sacrifice features if it means a cheaper sedan or coupe that’s fast. Any SUV option I’d prefer to be decently outfitted in lieu of an ability to have a fun drive. Will be selling or trading in my Elantra as money down. <\/p>\n<\/div>","59":"<div class=\"md\"><p>Location: SF South bay area (sanjose, cupertino, etc)<\/p>\n\n<p>Price range: &lt;30k<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: sedan<\/p>\n\n<p>Must haves: 360 surround camera, adaptive cruise control, carplay, large cabin space to fit baby seats.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: daily driver commute to work and road-tripper<\/p>\n\n<p>Vehicles you&#39;ve already considered: used nissan maxima platinum<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Does the vehicle need to have a warranty: Ideally, yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: possible, but preferably no<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: I&#39;m quite flexible on pricing, could be higher, but i prefer good miles used car. <\/p>\n\n<p>Thanks<\/p>\n<\/div>","60":"<div class=\"md\"><p><strong>Location:<\/strong> Arizona, USA<\/p>\n\n<p><strong>Price range:<\/strong> soft limit $5,000 USD.<\/p>\n\n<p><strong>New or used:<\/strong> Used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Whichever meets my needs best, although if a van, I would prefer a full cargo or full multi passenger over a minivan.<\/p>\n\n<p><strong>Must haves:<\/strong> In order of importance- <\/p>\n\n<p><strong>1)<\/strong> Capability to stow a powerchair inside using a Harmar lift (this cost not to be included in the vehicle price), a hitch lift if a vehicle with a hitch or bolted to the cargo area otherwise. The chair itself weighs 160lbs and is 35&quot; long by 23&quot; wide. The seat folds down, so the overall height is around 3 feet tall (I will get an exact height in a moment).<\/p>\n\n<p><strong>2)<\/strong> Fuel economy. I don&#39;t need 35mpg, but 15 is the bare minimum, and 20 or more would be preferable.<\/p>\n\n<p><strong>Desired transmission:<\/strong> Auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver, weekend trips for myself and one other adult.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Many. Durango, Honda Fit, Ford E-series to name a few. Mainly I&#39;m having difficulty finding cargo specs on the smaller vehicles, and am wary of the fuel economy on the larger vehicles.<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> First needed for the powerchair, not first vehicle.<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> No.<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yep, I can do a lot of minor work with a helper (I have my husband to help with anything physical).<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Not really.<\/p>\n\n<p><strong>Additional Notes:<\/strong> I don&#39;t need any other modifications to the vehicle besides the lift, or if absolutely necessary, the ramp. I can drive a stock automatic without any problems, just not a manual.<\/p>\n<\/div>","61":"<div class=\"md\"><p><strong>Location<\/strong>: <strong>Dallas, TX<\/strong><\/p>\n\n<p><strong>Price range<\/strong>: <strong>6-10k soft cap<\/strong><\/p>\n\n<p><strong>New or used<\/strong>: <strong>Used<\/strong><\/p>\n\n<p><strong>Type of vehicle<\/strong>: <strong>Car<\/strong><\/p>\n\n<p><strong>Must haves<\/strong>: <strong>Fun to drive<\/strong>(and not just fun to drive but fast), <strong>somewhat reliable<\/strong>, <strong>higher than ~18mpg city<\/strong>, (hopefully below 150k miles, but not needed), <strong>Ability to finance<\/strong>(I don&#39;t mind a car payment right now with my current job)<\/p>\n\n<p><strong>Desired transmission<\/strong>: <strong>Manual<\/strong> (this is super important to me, I really want a car with manual transmission)<\/p>\n\n<p><strong>Intended use<\/strong>: <strong>daily driver<\/strong><\/p>\n\n<p><strong>Vehicles you&#39;ve already considered<\/strong>: <strong>All year Civic SI&#39;s<\/strong>( I really want a EP3 but really hard to find one in decent shape),\n<strong>Golf GTI<\/strong> (this is probably my top pick right now since i cant find a decent 06-11 Civic Si 4door in my price range),\n<strong>G35\/G37<\/strong>( honestly kinda hard to find in manual), <strong>M2<\/strong>, <strong><em>Hyundai Genesis<\/em><\/strong>(but everyone on this sub hates these cars? why?)<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: <strong>No<\/strong>, but first manual vehicle<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: <strong>No<\/strong><\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: <strong>Yes<\/strong><\/p>\n\n<p><strong>Can you do Major work on your own vehicle<\/strong>: <strong>No<\/strong><\/p>\n\n<p><strong>Additional Notes<\/strong>: Would prefer <strong>RWD<\/strong>.<\/p>\n\n<p>.<\/p>\n\n<p>Looked at M2 BMW&#39;s(as they look sick as fuck tbh) but I&#39;m a little concerned for the reliability of the car, I&#39;m a little sketched out by BMW&#39;s being under 10k(probably for not great reason? I honestly don&#39;t know why) Is 6-10k a reasonable price range for like anywhere from an 04-08ish 3xxi m2 with below 130k miles? I really don&#39;t know the difference between the different M2 Models.<\/p>\n\n<p>.<\/p>\n\n<p>Also I have low credit, due to being young(18) and just having student loans on my credit report, Am I going to need a cosigner to finance the vehicle if I put roughly 3-4k down?( I don&#39;t really need personal finance help for this, I know I can afford the payments for it easily, but i don&#39;t know if I would be approved)<\/p>\n\n<p>Also looking for something with decent Aftermarket support, as I want a car I can work on and improve upon it.<\/p>\n\n<p><strong><em>Thank you<\/em><\/strong><\/p>\n<\/div>","62":"<div class=\"md\"><p><strong>Location<\/strong>: Philadelphia, PA<\/p>\n\n<p><strong>Price range:<\/strong> $15,000-20,000<\/p>\n\n<p><strong>New or used:<\/strong>  Open to both but, leaning toward used.<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan\/Hatchback.  Should I consider a small SUV?<\/p>\n\n<p><strong>Must haves:<\/strong> Will be street parked, so want a car that has a relatively small wheelbase. Also, need storage for various things (bikes, ski equipment) for trips so I am interested in a hatchback.  I don&#39;t want anything too flashy since it is on the street and do not really car about any of the new technology these cars come with besides bluetooth. <\/p>\n\n<p>Also, the car needs to be reliable over the long term since I plan on owning the car for while (hopefully 10 years). There will be weeks I don&#39;t drive and then weeks I go on a 300 mile road trip so I don&#39;t want to worry about potential problems.  It also, doesn&#39;t have to be fast by any means but I want a car that is enjoyable to drive.  <\/p>\n\n<p><strong>Desired transmission<\/strong>: Auto<\/p>\n\n<p><strong>Intended use:<\/strong> Weekend\/Roadtrips - I primary commute via bicycle but need something to transport biking\/skiing equipment.  I go on a lot of trips to the shore and mountains.  I just want something that can be reliable for the next decade while it gets beat up in the city.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Mazda 3, Honda Civic, Subaru Impreza, Crosstek, Ford Focus<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: No, currently own a 2001 Mercedes E430 but it was passed down through the family.  It has become too unreliable and doesn&#39;t really have enough interior space.  <\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: Not a requirement but would be a good bonus.<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Don&#39;t have a garage so could mostly only do very basic work.<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p>Additional Notes:<\/p>\n<\/div>","63":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","64":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","65":"<div class=\"md\"><p>Location: Alberta, Canada<\/p>\n\n<p>Price range: &lt;$25,000 CAD New, &lt;$15,000 used<\/p>\n\n<p>New or used: Either; would prefer used.<\/p>\n\n<p>Type of vehicle: Hatchback, crossover or SUV<\/p>\n\n<p>Must haves: Bluetooth; keyless\/remote entry; cruise control; if new, requires Android Auto.  Remote start, roof rails, AWD preferred.  <\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily driver + dog hauler<\/p>\n\n<p>Vehicles you&#39;ve already considered: Hyundai Elantra; Honda Fit, HRV; VW Golf Sportwagon, Tiguan; Mazda 3\/CX-3; Subaru Impreza, Crosstrek, Forester; Toyota Corolla iM, CH-R; <\/p>\n\n<p>Is this your 1st vehicle: No, it will be my second.  I currently drive a 1998 civic LX, which is my first car and I&#39;ve had for 14 years.<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I&#39;ve only been looking at new cars so far because I have specific requirements for cargo space and its easier for me to go to a dealership and look at floor models.  I need space to hold two kennels for small-to-medium dogs; a smaller vehicle with fold-flat seats (completely flat, or within 5 degrees would be tolerable if they lock into place) is preferable to a huge SUV.  Reliability is important, and interior quietness is also important.<\/p>\n<\/div>","66":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","67":"<div class=\"md\"><p>Hey guys, I&#39;m considering buy a Golf GTE; my daily commute is going to be 50km (31miles) mainly in congested Parisian region, I currently have a Polo V and I&#39;m quite tall : 196cm (6&#39;4&quot;) and the polo isn&#39;t confortable for me; since I&#39;m going to do a lot of miles I was looking to an upgrade.<\/p>\n\n<p>I should get the ability to recharge at home in the coming months hence why I&#39;m considering a rechargeable hybrid;<\/p>\n\n<p>I&#39;d love to hear <a href=\"\/r\/cars\">r\/cars<\/a> opinion on the matter<\/p>\n\n<p>(I&#39;d be buying the car new for 36 000€ (42kUSD) under a leasing plan; still debating the payment)<\/p>\n<\/div>","68":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","69":"<div class=\"md\"><p>This is a pretty open question, but:\nI&#39;m looking for a used car. I would like a hybrid or something that at least gets good gas mileage (30mpg+). I need a four door with a bit of room. I&#39;ve driven a Kia soul for the past 7 years and I loved it and I&#39;m hoping for something similar. I&#39;ve looked at the Chevy spark, which I like, or even the soul evs or whatever the hybrid model is called. Not looking for anything about 20,000 and would definitely prefer something 8k-13k in US dollars. \nUltimately, I plan on using this car for a long time. My Kia Soul was in good condition and had over 150,000 miles on it, but it has passed away due to a large truck beating it up. <\/p>\n<\/div>","70":"<div class=\"md\"><ul>\n<li>*<em>Location:<\/em> Raleigh, North Carolina and Atlanta, Georgia, USA<\/li>\n<li>*<em>Price range:<\/em> $6k USD max <\/li>\n<li>*<em>New or used:<\/em> Used<\/li>\n<li>*<em>Type of vehicle:<\/em> Hatchback or Sedan <\/li>\n<li>*<em>Must haves:<\/em> Fuel Efficient, Affordable maintenance <\/li>\n<li>*<em>Desired transmission (auto\/manual, etc):<\/em> Auto<\/li>\n<li>*<em>Intended use:<\/em> Daily driver <\/li>\n<li>*<em>Vehicles you&#39;ve already considered:<\/em> 2009-2013 Mazda 3<\/li>\n<li>*<em>Is this your 1st vehicle:<\/em> First self purchase <\/li>\n<li><strong>Does the vehicle need to have a warranty:<\/strong> No<\/li>\n<li>*<em>Can you do Minor work on your own vehicle:<\/em> Yes<\/li>\n<li><p>*<em>Can you do Major work on your own vehicle:<\/em> No <\/p><\/li>\n<li><p>*<em>Additional Notes:<\/em> Fuel efficiency and reliability are really big for me. Also, relatively affordable car insurance. I drive about 300 miles per week. <\/p><\/li>\n<\/ul>\n<\/div>","71":"<div class=\"md\"><p>Location: Houston Texas<\/p>\n\n<p>Price range: low 20s. $18-23k<\/p>\n\n<p>New or used: Certificated\/with warranty<\/p>\n\n<p>Type of vehicle: crossover<\/p>\n\n<p>Must haves: leather seats and good gas mileage<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: Mom&#39;s daily \/ family car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Kia Sorrento, Rav4, Nissan Rogue<\/p>\n\n<p>Does the vehicle need to have a warranty: YES<\/p>\n\n<p>Can you do Minor work on your own vehicle: let&#39;s just say no<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional notes: For my Mom. Reliability is #1 and must comfortably fit 4-5 people and  have good storage. <\/p>\n<\/div>","72":"<div class=\"md\"><p>Looking for a compact SUV around 20k and was thinking Hyundai Tucson, Mazda CX5 or Honda CRV. <\/p>\n\n<p>Looking for reliability, good standard features and good gas mileage. <\/p>\n\n<p>Have no knowledge of cars so any advice\/tips would be immensely appreciated. Thanks! <\/p>\n<\/div>","73":"<div class=\"md\"><p>Location: Maryland<\/p>\n\n<p>Price range: $15-20k<\/p>\n\n<p>New\/ Used: used<\/p>\n\n<p>Type of vehicle: MID-SIZE SUV<\/p>\n\n<p>Must haves: FLAT FOLD DOWN SEATS\/ REAR<\/p>\n\n<p>Desired Transmission: either<\/p>\n\n<p>Intended use: daily\/ camping<\/p>\n\n<p>Vehicles I’ve considered: Toyota 4 runner, Chevy tahoe, Toyota Highlander, Ford Flex<\/p>\n\n<p>Warranty: no<\/p>\n\n<p>Minor work: yes<\/p>\n\n<p>Major work: no<\/p>\n\n<p>Addl notes: I would like to SLEEP in the back of this car. I’d rather not have a full size Explorer or Suburban. I’m also not entirely concerned about 4WD. I’ll take FRD if need be, no biggie.<\/p>\n<\/div>","74":"<div class=\"md\"><p>Location: North-Spain<\/p>\n\n<p>Price range: Max: 44k€<\/p>\n\n<p>New or used: New or up to 7 years old<\/p>\n\n<p>Type of vehicle: Sports Car<\/p>\n\n<p>Must haves: RWD (would be good to be I6\/V6 or V8)<\/p>\n\n<p>Desired transmission: Manual (Didn&#39;t tried Porsche&#39;s PDK or other good automatic transmissions)<\/p>\n\n<p>Intended use: Weekend Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda MX-5 ND 2.0 (New), BMW Z4 E89 sDrive 35i Manual (used from 2010), Porsche Boxter<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: It would be good to have 1 year warranty<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes, I already do this on my BMW E46<\/p>\n\n<p>Can you do Major work on your own vehicle: No, never tried.<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>I want a roadster with a bit of reliability (I already do lot of work on my daily driver) that can give me loads of fun (fun is priority #1).\nI&#39;m very tempted to buy the MX5 ND, new or 1year old. I&#39;m worried about runnning costs of buying a second hand bimmer or Porsche.\nBut also concerned about MX5 power, but I think the MX5 ND might be fast enough for me, my e46 is a N42 318i, so I guess it will be super fast for me.\nMaybe I should just try the three models I&#39;ve considered and make my mind hehe\nThanks!!!<\/p>\n<\/div>","75":"<div class=\"md\"><p>Location: Texas, USA<\/p>\n\n<p>Price Range: Max $30,000 (prefer to be low though).<\/p>\n\n<p>New or Used: New preferable, used perfectly fine.<\/p>\n\n<p>ToV: Sedan\/Hatchback\/Compact nothing way too big.<\/p>\n\n<p>Must Haves: Fuel efficient(will be driving 80+ miles a day on highway), ABS, Aux.<\/p>\n\n<p>Desired Transmission: Auto, but I manual is okay.<\/p>\n\n<p>Intended Use: Daily Driving\/Commuting.<\/p>\n\n<p>Considered Vehicles: Hyundai Ioniq, Honda Civic, Hyundai Sonata, Ford Focus, and similar vehicles.<\/p>\n\n<p>First Car? Yes, I&#39;m a vehicle virgin.<\/p>\n\n<p>Minor Work? No.<\/p>\n\n<p>Major Work? No. <\/p>\n\n<p>Notes: Hybrids and Plug-Ins are welcome, would rather not go fully electric because of the range. Would prefer something with fairly high mpg (the Ioniq&#39;s 54 [?] mpg is very nice) so I can eat instead of fueling up. Thanks for any help!<\/p>\n<\/div>","76":"<div class=\"md\"><p><strong>Location<\/strong>: Midwest\/South USA (and some out in the Rockies)<\/p>\n\n<p><strong>Price range<\/strong>: &lt;$50k<\/p>\n\n<p><strong>New or used<\/strong>: New or lightly used (2013 is the earliest I would consider)<\/p>\n\n<p><strong>Type of vehicle<\/strong>: Luxury Sedan\/Crossover, though I am willing to consider more practical pony cars<\/p>\n\n<p><strong>Must haves<\/strong>: N\/A<\/p>\n\n<p><strong>Desired transmission<\/strong>: Auto<\/p>\n\n<p><strong>Intended use<\/strong>: Daily city driver\/some longer drives<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered<\/strong>: Porsche Macan (used), Tesla Model S (used), Mercedes GLC (new), Audi Q5 (new), Ford Mustang (new), Dodge Challenger (new)<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: No<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: Preferably yes but not required<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: No<\/p>\n\n<p><strong>Can you do Major work on your own vehicle<\/strong>: No<\/p>\n<\/div>","77":"<div class=\"md\"><p><strong>Location<\/strong>: Toronto, Ontario, Canada<\/p>\n\n<p><strong>Price range<\/strong>: $7000 CAD<\/p>\n\n<p><strong>New or used<\/strong>: Used<\/p>\n\n<p><strong>Type of vehicle<\/strong>: Sedan or Luxury<\/p>\n\n<p><strong>Must haves<\/strong>: AWD for winter driving in Canada snow<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc)<\/strong>: Auto<\/p>\n\n<p><strong>Intended use<\/strong>: Daily driver to work\/school (the only car I will have)<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered<\/strong>: Been looking at Lancer&#39;s and was going to swap the headlights\/tail lights to give it a bit of a face lift, but I&#39;ve been told the Lancer isn&#39;t a good choice if I&#39;m looking for something different than the Corolla.<\/p>\n\n<p><strong>Is this your 1st vehicle<\/strong>: Yes (kind of, read below)<\/p>\n\n<p><strong>Does the vehicle need to have a warranty<\/strong>: No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle<\/strong>: Willing to learn through YouTube\/online resources<\/p>\n\n<p><strong>Can you do Major work on your own vehicle<\/strong>: No<\/p>\n\n<p><strong>Additional Notes<\/strong>: Currently own a 2007 Corolla CE that my dad gave me. It runs fine but I&#39;m kinda bored of it and I&#39;m looking to sell it and purchase a different car (something more fun but also practical to drive daily in all seasons). I prefer imports, and not American cars. I&#39;d like to have something that&#39;s fun to drive, looks nice (or can be worked into a nice looking the car with some work), and something that is reliable.<\/p>\n<\/div>","78":"<div class=\"md\"><p>Location: Baltimore, Maryland<\/p>\n\n<p>Price Range: Less than $6000<\/p>\n\n<p>Type of vehicle: Anything with 4 wheels that isn&#39;t a pickup.<\/p>\n\n<p>Must haves: CD player<\/p>\n\n<p>Desired Transmission: Manual! Will settle for auto though.<\/p>\n\n<p>Intended use: Driving to school and this really nice bagel place that&#39;s like 25 minutes from my house.<\/p>\n\n<p>Vehicles already considered: Pontiac Aztek and Mazda 5<\/p>\n\n<p>Is this your 1st vehicle: You&#39;d better believe it!<\/p>\n\n<p>Does the vehicle need to have a warranty: No $6000 car has a warranty!<\/p>\n\n<p>Can I do minor work: Yee<\/p>\n\n<p>Can I do major work: Given enough time, probably.<\/p>\n\n<p>Additional Notes: Baltimore has god awful roads, so cars with nice suspension are very handy.<\/p>\n<\/div>","79":"<div class=\"md\"><p>Location: Louisiana, USA<\/p>\n\n<p>Price Range: ~$8,000 or less<\/p>\n\n<p>New or Used: Used<\/p>\n\n<p>Type of Vehicle: Sedan, Hatchback, Smaller SUV\nMust Haves: Fuel Efficient, Feels Safe, Reliable (Japanese?)<\/p>\n\n<p>Desired Transmission: Automatic<\/p>\n\n<p>Intended Use: I️ plan on using this as my daily driver for the foreseeable future. My drives consists of going to and from school and work mostly, so mostly highway driving. <\/p>\n\n<p>Vehicles You’ve Already Considered: Camry, Corolla, Accord, Civic, Matrix, Fit, RAV4, CRV, Yaris<\/p>\n\n<p>Is This Your First Vehicle: No<\/p>\n\n<p>Does the Vehicle Need to Have a Warranty: No<\/p>\n\n<p>Can You Do Minor Work On Your Own Vehicle: Yes<\/p>\n\n<p>Can You Do Major Work On Your Own Vehicle:\nNo<\/p>\n\n<p>Additional Notes: I️ plan on buying a pretty decent car to use to finish school and probably for as long as I️ can so something reliable would be best. I️ have always heard Toyota and Honda are the best options as far as that goes. When I️ say I️ want the vehicle to “feel safe” I️ mean that I️ would prefer something that won’t make me feel like I’ll die if I️ ever hit something lol. This is what kinda makes me turn away from the smaller cars like the Yaris but I️ don’t know if that’s even a reasonable concern. Also I’m somewhat tall (6’1”) so I️ was also worried about some cars making me cramped over long periods of time (which is why I️ considered the SUVs) but again not sure if they are that much roomier anyway. I️ thought hatchbacks might be the middle ground since they have a little more room but have better gas mileage, but I️ don’t really know what I’m talking about lol.Thanks!<\/p>\n<\/div>","80":"<div class=\"md\"><p>Stupid question can i buy a car with moms credit even though she&#39;s lives in another state? I&#39;m in CA she&#39;s in CT.<\/p>\n<\/div>","81":"<div class=\"md\"><p>Location: Texas\nPR: max 10k\nUsed\nType: Sports\/Muscle car\nMust haves: Has to be rear wheel drive and at least 6 cylinder\nTransmission: auto or manual idc\nUse: Going to drive this car every day\nPossible cars: Looked at 350z and camaro\nNot my first car\nDoes not need warranty\nI can do minor work but nothing crazy\nI&#39;m still in High School and am buying this car myself, price really can&#39;t change. I honestly want something that&#39;s just really fun to drive and looks aight. Thanks!<\/p>\n<\/div>","82":"<div class=\"md\"><p><strong>Location:<\/strong> New England<\/p>\n\n<p><strong>Price range:<\/strong> 8-10k<\/p>\n\n<p><strong>New or used:<\/strong> used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> reliable toy<\/p>\n\n<p><strong>Must haves:<\/strong> Fast acceleration, cheap\/easy to maintain, fun, decent looking <\/p>\n\n<p><strong>Desired transmission<\/strong>: manual preferred <\/p>\n\n<p><strong>Intended use:<\/strong> Second car <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> 2nd gen M3, Mustang GT, Audi S4<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, my daily driver is a 2013 Mercedes C300<\/p>\n\n<p><strong>Does the vehicle need to have a warranty:<\/strong> no<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> no<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> mo<\/p>\n\n<p><strong>Additional Notes:<\/strong> I have a 2013 Mercedes C300 as a daily driver. I love it to death. Such a fun car and hasn’t given me any issues. However, I do want something as a toy to go a bit faster in\/play around with. I don’t mind dumping money here and there for repairs or mods but I do not want it to be a money pit. As my daily is going to remain the Mercedes, I do not want to spend a ton of money on this car so the 8-10k price range is comfortable. I love the Audi S4 but realize that I might run into some reliability issues (and wonder if it’s truly that much more fun than the Benz). I absolutely love the second gen M3 but I’m having trouble finding a decent one in that price range. Mustang GT post 2005 seems like it could be an option. Also, I would like to finance this car with a few grand down. <\/p>\n<\/div>","83":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","84":"<div class=\"md\"><p>Looking for an old reliable beater to gut to the bare essentials for kicks. Is a mid 90&#39;s Sentra 1.6 l my best bet? $500 budget, utah.<\/p>\n<\/div>","85":"<div class=\"md\"><p>Location: Northeast US<\/p>\n\n<p>Price range: $20,000-$30,000<\/p>\n\n<p>New or used: Either.<\/p>\n\n<p>Type of vehicle: Coupe\/Sedan<\/p>\n\n<p>Must haves: AWD, preferably navigation.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily\/track driving<\/p>\n\n<p>Vehicles you&#39;ve already considered: Subaru BRZ, Subaru WRX STI, Ford Focus, Dodge Charger<\/p>\n\n<p>Is this your 1st vehicle: Yep<\/p>\n\n<p>Does the vehicle need to have a warranty: Preferably.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes.<\/p>\n\n<p>Can you do Major work on your own vehicle: No, but willing to learn.<\/p>\n\n<p>Additional Notes: None.<\/p>\n<\/div>","86":"<div class=\"md\"><pre><code>    Location: Toronto, Canada\n\n    Price range: 30K CAD\n\n    New or used: New\n\n    Type of vehicle: SUV (Santa FE 2018 or RAV4)\n\n    Must haves: Reliability, Comfort \/ Leg room, Features\n\n    Desired transmission (auto\/manual, etc): Auto\n\n    Intended use: Daily \/ Work\n\n    Vehicles you&#39;ve already considered: CRV (don&#39;t like the shape)\n\n    Is this your 1st vehicle: No\n\n    Does the vehicle need to have a warranty: Yes\n\n    Can you do Minor work on your own vehicle: No\n\n    Can you do Major work on your own vehicle: No\n\n    Additional Notes: Looking to compare the 2018 models of RAV4 and Santa-FE. I think it is the last year for this generation for both models. Which of the two would be recommended?\n<\/code><\/pre>\n\n<p>Thanks<\/p>\n<\/div>","87":"<div class=\"md\"><ul>\n<li>Location: Queens, NY<\/li>\n<li>Price range: $5000 - $6000<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Coupe\/Sedan<\/li>\n<li>Must haves: MPG, Reliability, A car for a first time driver, To get to work from Point A to Point B but also decent for a weekend city driving<\/li>\n<li>Desired transmission (auto\/manual, etc): Automatic<\/li>\n<li>Intended use: Daily Driver <\/li>\n<li>Vehicles you&#39;ve already considered: Honda Civic\/Accord, Mazda 3<\/li>\n<li>Is this your 1st vehicle: Yes<\/li>\n<li>Does the vehicle need to have a warranty: Preferably<\/li>\n<li>Can you do Minor work on your own vehicle: No<\/li>\n<li>Can you do Major work on your own vehicle: No<\/li>\n<\/ul>\n<\/div>","88":"<div class=\"md\"><p>Location: Vancouver BC<\/p>\n\n<p>Price range: up to $4k<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Coupe (maybe sedan)<\/p>\n\n<p>Must haves: Nothing really<\/p>\n\n<p>Desired transmission: Manual (possibly Auto)<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Integra, early 2000&#39;s Preludes, 2001 Celica<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Does the vehicle need to have a warranty: No.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes.<\/p>\n\n<p>Can you do Major work on your own vehicle: Yes.<\/p>\n<\/div>","89":"<div class=\"md\"><p>Location: UK<br\/>\nPrice range: £2000-£5000<br\/>\nType of vehicle: Car. Sedan or Estate.<br\/>\nMust haves: Creature comforts such as cruise control, air conditioning, etc. Plenty of boot space. Preferably 30+ mpg.<br\/>\nDesired transmission (auto\/manual, etc): Automatic<br\/>\nIntended use: Motorway cruiser for long distance trips<br\/>\nVehicles you&#39;ve already considered: Mid 2000s BMW 3 series, Jaguar X-Type, Mercedes C-class<br\/>\nIs this your 1st vehicle: No, would be a second car<br\/>\nDoes the vehicle need to have a warranty: No<br\/>\nCan you do Minor work on your own vehicle: Yes<br\/>\nCan you do Major work on your own vehicle: Potentially<br\/>\nAdditional Notes: NB Miata is my daily driver at the moment, but it sucks for long journeys on the motorway. I plan to do several 2-300 mile journeys and would prefer something more economical and comfortable for those trips.<\/p>\n<\/div>","90":"<div class=\"md\"><p>Alright, I crashed my Miata a few days ago and it looks like it&#39;ll have to go :( So I&#39;m wondering about a next car to keep my mind off the poor girl. I&#39;m looking for something that&#39;s good for a long commute, fun to drive (I love the Miata driveability), but maybe something different at the same time. <\/p>\n\n<p>Location: Bay Area, CA<\/p>\n\n<p>Price range: 10k USD<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: RWD Sports Car<\/p>\n\n<p>Must haves: At least 25mpg, RWD, Great Handling, Reliability, ABS\/Airbags, Character\/Fun to drive<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: NB Miata and Turbo, BRZ\/FRS (How are buying these used?), BMW E36\/E39 M3?, Honda S2000 (I think 10K&#39;s hard for this one), Nissan 370Z? (Don&#39;t know anything about these), Porsche Boxster (How&#39;s the maintenance?)<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, water pump, brake pad etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission rebuild, timing belt\/chains, body work etc ): Timing belt\/chains yes, maybe on the other ones. <\/p>\n<\/div>","91":"<div class=\"md\"><p>Location: Reno, Nevada<\/p>\n\n<p>Price Range: 10000-32000<\/p>\n\n<p>New or used: New or Used Up to 30000 miles<\/p>\n\n<p>Type Of Vehicle: Car, Sports Car, Sedan, Luxury<\/p>\n\n<p>Must Haves: Dual Zone, Quiet Cabin, Android Auto, 4WD nice to have<\/p>\n\n<p>Desired Transmission: Auto<\/p>\n\n<p>Intended Use: Daily Driver<\/p>\n\n<p>Vehicles Considered: Toyota Camry SE, Honda Accord Sport, Audi A3 Quattro, Volkswagen Golf GTI, Chevrolet Volt, BMW 328i, BMW 328d, Mercedes C300<\/p>\n\n<p>Is This Your 1st Vehicle: No<\/p>\n\n<p>Does the vehicle need to have a warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n<\/div>","92":"<div class=\"md\"><p>Looking to buy a new car (it has to be new) so far my top picks are either a mini cabrio or a mazda mx5, so thats my budget (25-30k ish) any other options I should look at? <\/p>\n<\/div>","93":"<div class=\"md\"><p>Location: Northeast US\nPrice range: &lt;$65k\nNew.\nType of Vehicle: Ideally wagon or hatchback, open to crossovers and SUVs, but I prefer the sportier driving experience of a wagon.\nMust haves: Modern technology, huge trunk (for a big dog cage), leather\nDesired transmission: If somehow this exists in a manual, that would be fantastic, but I’ve kind of accepted that I will probably have to get an auto.\nIntended use: Daily driver, road trips with two kids, wife, dog, luggage\nVehicles you’ve already considered: Audi S5 Sportback (too small), BMW 3 Wagon (too small), Mercedes E Wagon (I’d like to avoid mercedes if possible for personal reasons)\nIs this you’re first vehicle: no\nDoes the vehicle need to have a warranty: yes\nCan you do minor work: no\nCan you do major work: no\nAdditional notes: I’m coming from an escalade, the least reliable car ever. I would like this one to be a lot more reliable.<\/p>\n<\/div>","94":"<div class=\"md\"><p>Location: Southern California\nPrice: 1000-5500USD\nUsed\nType: Sports Car or fast sedan\nMust Haves: American or German Made, able to be faster than 5.5s 0-60 without a lot of work put in to it, decent looks\nTransmission: Either\nIntended Use: project car\nCars Considered: 800ci, Camaro\nThis will be my second car, RDX turbo is my daily\nNo warranty\nI can do Minor work, Major work is dependent on me having tools so for the most part no.<\/p>\n<\/div>","95":"<div class=\"md\"><p>I’m a 17 year old guy, my first car was a lemon so I’m looking to buy something that I can use to drive for a decent amount of time that won’t fall apart on me. Preferably something that is easy to work on and a v8<\/p>\n\n<p>Location - Staten Island Nyc <\/p>\n\n<p>Price range - 1000-2500<\/p>\n\n<p>New or used - Used<\/p>\n\n<p>Type - sedan\/sport\/race\/suv<\/p>\n\n<p>Must haves - decent looking, will last, over 200hp<\/p>\n\n<p>Desired transmission -  Automatic but I️ could learn to use a manual<\/p>\n\n<p>Intended use - everyday car<\/p>\n\n<p>Vehicles you&#39;ve already considered - Crown Victoria<\/p>\n\n<p>Is this your first car? - no this will be my second car, first car was a 2003 Monte Carlo SS lemon<\/p>\n\n<p>Warranty? - no<\/p>\n\n<p>Minor work? Preferably not but not a big deal<\/p>\n\n<p>Major work? - no<\/p>\n<\/div>","96":"<div class=\"md\"><p>Location: San Francisco<\/p>\n\n<p>Prive range: 10k-13k<\/p>\n\n<p>New or Used: Used<\/p>\n\n<p>Type of Vehicle: Sedan, Hatchback, Coupe<\/p>\n\n<p>Must Haves: good gasmileage<\/p>\n\n<p>Desired Transmission: Either<\/p>\n\n<p>Intended Use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Ford Fiesta, Ford Focus, Subaru WRX, VW Golf, <\/p>\n\n<p>Warranty: no<\/p>\n\n<p>Minor Work: Currently Learning<\/p>\n\n<p>Major Work: No<\/p>\n\n<p>Additional Notes: This is the first car being bought specifically for me. I love cars and I love driving and I want something I can daily drive but is still fun to drive and I love Rally, Rallyx and drifting and I would like something I can also maybe mess around a little in. I&#39;d also like it be something relatively easy to work on so I can learn.<\/p>\n<\/div>","97":"<div class=\"md\"><p>Location: USA, Florida\nPrice range: 1000-3,500 USD\nNew or used: USED\nType of vehicle: Car, preferably a coupe\nMust haves: I prefer something that is good on gas and reliable, I&#39;m going to mainly be using this car for work\/school, with some leisure.\nDesired transmission: auto, not sure about manual..\nIntended use: Daily Driver, Work Car, Weekend Car.\nVehicles you&#39;ve already considered: Honda Civic EX 1996\nIs this your 1st vehicle: Yes\nCan you do Minor work on your own vehicle: My pop knows quite a bit, and said he would help me out.\nCan you do Major work on your own vehicle: Check above.<\/p>\n\n<p>Additional Notes: Like I said, just looking for something that is nice looking, reliable and good on gas. This is my first car and I don&#39;t want to get raped by my insurance.<\/p>\n<\/div>","98":"<div class=\"md\"><p>Is a Mitsubishi Lancer a good choice? I want something that&#39;s a sporty looking car and they don&#39;t make Evolution X&#39;s anymore soo..?<\/p>\n<\/div>","99":"<div class=\"md\"><ul>\n<li>Location: Mississippi<\/li>\n<li>Price range: Under $35,000 New or used: New<\/li>\n<li>Type of Vehicle: Car, Sports Car, SUV<\/li>\n<li>Must Haves: V6, Fuel Efficient, reliable<\/li>\n<li>Desired transmission: Auto <\/li>\n<li>Intended Use: Daily Drive, gonna be driving to high school everyday in this.<\/li>\n<li>Vehicles Cosidered: Dodge Charger, Dodge Challenger, Jeep Wrangler<\/li>\n<li>1st Vehicle?: Yes <\/li>\n<li>Warranty: idk?<\/li>\n<li>Minor work?: probably not <\/li>\n<li>Major work?: no<\/li>\n<li>Additional notes: Im 16 and will be getting my first car soon to drive to school, my brother has a 2017 Camaro so I do not want the same car as him. I’m 6’4 so space would be good<\/li>\n<\/ul>\n<\/div>","100":"<div class=\"md\"><p>Ah that&#39;s interesting because I always loved how much steering feel and feedback I got from my 328i. If the is350 doesn&#39;t give me that same response then I think I might cross that off the list.<\/p>\n<\/div>","101":"<div class=\"md\"><p>Audi S5 Sportback or VW Golf R.<\/p>\n\n<p>What Car Should I Buy.<\/p>\n<\/div>","102":"<div class=\"md\"><p>Pontiac G8 GT or Chrysler 300\/dodge charger <\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1,"77":1,"78":1,"79":1,"80":1,"81":1,"82":1,"83":1,"84":1,"85":1,"86":1,"87":1,"88":1,"89":1,"90":1,"91":1,"92":1,"93":1,"94":1,"95":1,"96":1,"97":1,"98":1,"99":1,"100":1,"101":1,"102":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null,"77":null,"78":null,"79":null,"80":null,"81":null,"82":null,"83":null,"84":null,"85":null,"86":null,"87":null,"88":null,"89":null,"90":null,"91":null,"92":null,"93":null,"94":null,"95":null,"96":null,"97":null,"98":null,"99":null,"100":null,"101":null,"102":null},"comment_edited":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":1512536967.0,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":1511904594.0,"18":false,"19":false,"20":1512155795.0,"21":false,"22":false,"23":false,"24":false,"25":1511806155.0,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":1511913159.0,"45":false,"46":false,"47":false,"48":1511949554.0,"49":false,"50":1511969441.0,"51":false,"52":false,"53":1511973709.0,"54":false,"55":false,"56":1511982172.0,"57":false,"58":1512005300.0,"59":false,"60":1511997499.0,"61":1512008935.0,"62":false,"63":false,"64":1512014846.0,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":1512064368.0,"97":false,"98":false,"99":false,"100":false,"101":false,"102":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":false,"97":false,"98":false,"99":false,"100":false,"101":false,"102":false},"comment_score":{"0":8,"1":8,"2":6,"3":5,"4":5,"5":3,"6":4,"7":3,"8":3,"9":3,"10":3,"11":3,"12":3,"13":2,"14":2,"15":2,"16":2,"17":2,"18":2,"19":2,"20":2,"21":2,"22":3,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1,"77":1,"78":1,"79":1,"80":1,"81":1,"82":1,"83":1,"84":1,"85":1,"86":1,"87":1,"88":1,"89":1,"90":1,"91":1,"92":1,"93":1,"94":1,"95":1,"96":1,"97":1,"98":1,"99":0,"100":0,"101":0,"102":0},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false,"77":false,"78":false,"79":false,"80":false,"81":false,"82":false,"83":false,"84":false,"85":false,"86":false,"87":false,"88":false,"89":false,"90":false,"91":false,"92":false,"93":false,"94":false,"95":false,"96":false,"97":false,"98":false,"99":false,"100":false,"101":false,"102":false},"author_id":{"0":"q4vmq","1":"","2":"j7cuuvp","3":"","4":"f5uto","5":"l6ehv","6":"na4lb","7":"","8":"wj7jxk","9":"8t129","10":"748ee","11":"n12gm","12":"c0uuq","13":"mftjz","14":"fmt0r","15":"15vld1","16":"","17":"xgwgh","18":"xgwgh","19":"rlxph","20":"q0r91","21":"mxukx","22":"l7b8oei","23":"","24":"","25":"99ir29h","26":"x6olt","27":"fkzmq","28":"","29":"","30":"cekmy","31":"175p30","32":"","33":"14h7bp","34":"3g8v1ld","35":"146lrh","36":"","37":"","38":"npr3e","39":"68gqm","40":"","41":"gqade","42":"c4xsx","43":"4tahj","44":"awt3n","45":"bt8v0","46":"13oncl","47":"","48":"fapw2","49":"","50":"16934z","51":"","52":"151kka","53":"","54":"n95cy","55":"rpljs","56":"zhlc9","57":"37gu1","58":"dsc00","59":"1yy8g","60":"cvd3e","61":"ilov9","62":"dtlls","63":"","64":"","65":"emta7","66":"","67":"6gynx2t","68":"","69":"rw4x5","70":"j7ku9ma","71":"m1hn3","72":"c0uuq","73":"5qpho","74":"42alx","75":"","76":"55opg","77":"ntuph","78":"ll75k4m","79":"8s3hq","80":"151uv0","81":"tw2ts","82":"zv9cd","83":"","84":"863as","85":"gzp46qv","86":"7c9fw","87":"8ehzq","88":"n19pe","89":"","90":"jyuu9","91":"","92":"1159id","93":"zilug","94":"16mlmh","95":"16d3j9","96":"btuy5","97":"u8i99","98":"33fk4p1","99":"r22cn","100":"15vld1","101":"3tirldw","102":"107zu7"},"author_name":{"0":"OceanGrownPharms","1":"","2":"7696435notathrowaway","3":"","4":"WeeniePops","5":"coffeebribesaccepted","6":"xxmcapxx","7":"","8":"frasermcd","9":"napping1","10":"sabianplayer","11":"jhoosteen","12":"chrisstuffher","13":"2manylemons","14":"Datum000","15":"emad_s123","16":"","17":"GotTouchofMalice","18":"GotTouchofMalice","19":"HHcougar","20":"Amxela","21":"Pipno1","22":"hcorean","23":"","24":"","25":"Peacemaker_58","26":"hors3y","27":"Ovechtricky","28":"","29":"","30":"TheMeanestPenis","31":"cyu2013","32":"","33":"pattycake-actual","34":"trwolf18","35":"devin312","36":"","37":"","38":"Heads_Or_Tayls","39":"TheMa9icTurtle","40":"aosroyal","41":"olkiller","42":"Xanderwho","43":"Seref15","44":"arcmokuro","45":"chrobbin","46":"dreggerz2016","47":"","48":"Nightmaarez","49":"","50":"cguajardo","51":"","52":"hoon_bair","53":"","54":"VoiceInside","55":"Dan_E26","56":"NerdzRcool","57":"TheRonMan","58":"tyrannosaurus_r","59":"ViscountVics","60":"lexianne","61":"rainsniper90","62":"jaqulle999","63":"","64":"","65":"gingeredbiscuit","66":"","67":"twotimesthreeequals","68":"","69":"BeastaBubbles","70":"sabakiode","71":"Supercars_Official","72":"chrisstuffher","73":"IRENE420","74":"downboat","75":"","76":"Kaarboer","77":"Equilibris","78":"ojmayoistheGOAT","79":"FamousBump3","80":"sadnessless","81":"Primiean","82":"Dappered_","83":"","84":"wataDs","85":"madrigal30","86":"netseccat","87":"HootyAye","88":"ItsMarkham","89":"","90":"ChronicCynic","91":"","92":"soyelsimba","93":"treeofeden","94":"JeremyFreud","95":"ThrowawayEmuson","96":"frax681","97":"DeadGravityyy","98":"LicenseToChill93","99":"danieldaniel1108","100":"emad_s123","101":"ChillaxJ","102":"Dillwagon"}}