{"comment_id":{"0":"dwayetf","1":"dwbdihb","2":"dwdxa7r","3":"dwb2q0k","4":"dwazl7j","5":"dwc5bz6","6":"dwd289d","7":"dwkhpyj","8":"dwms8qz","9":"dwazedk","10":"dwbbgvn","11":"dwbcxft","12":"dwbdgvf","13":"dwbhif9","14":"dwbhryi","15":"dwcadpm","16":"dwdbwbw","17":"dwdx463","18":"dwk90h8","19":"dwlhfs3","20":"dwlxf7e","21":"dwm7yy6","22":"dwmj98d","23":"dwk970k","24":"dwl94o3","25":"dwdt1ne","26":"dwbbdvj","27":"dwbdkfi","28":"dwbfts1","29":"dwbnije","30":"dwbooxl","31":"dwbp3ur","32":"dwbwdtr","33":"dwc302p","34":"dwcf2qf","35":"dwcol1n","36":"dwcuju7","37":"dwcwjfv","38":"dwddt4j","39":"dwdjphg","40":"dwdk8jc","41":"dwdn81m","42":"dwdufty","43":"dwgldko","44":"dwhkwht","45":"dwjze53","46":"dwjzxd7","47":"dwkfnew","48":"dwl605f","49":"dwl6mok","50":"dwl8rvq","51":"dwlalav","52":"dwll3qk","53":"dwlsm7o","54":"dwm667j","55":"dwn89sn","56":"dwn9iw9","57":"dwnarma","58":"dwneeye","59":"dwnrgst","60":"dwnb7en","61":"dwnc9s0"},"comment_parent_id":{"0":"t3_878b8d","1":"t3_878b8d","2":"t3_878b8d","3":"t3_878b8d","4":"t3_878b8d","5":"t3_878b8d","6":"t3_878b8d","7":"t3_878b8d","8":"t3_878b8d","9":"t3_878b8d","10":"t3_878b8d","11":"t3_878b8d","12":"t3_878b8d","13":"t3_878b8d","14":"t3_878b8d","15":"t3_878b8d","16":"t3_878b8d","17":"t3_878b8d","18":"t3_878b8d","19":"t3_878b8d","20":"t3_878b8d","21":"t3_878b8d","22":"t3_878b8d","23":"t3_878b8d","24":"t3_878b8d","25":"t3_878b8d","26":"t3_878b8d","27":"t3_878b8d","28":"t3_878b8d","29":"t3_878b8d","30":"t3_878b8d","31":"t3_878b8d","32":"t3_878b8d","33":"t3_878b8d","34":"t3_878b8d","35":"t3_878b8d","36":"t3_878b8d","37":"t3_878b8d","38":"t3_878b8d","39":"t3_878b8d","40":"t3_878b8d","41":"t3_878b8d","42":"t3_878b8d","43":"t3_878b8d","44":"t3_878b8d","45":"t3_878b8d","46":"t3_878b8d","47":"t3_878b8d","48":"t3_878b8d","49":"t3_878b8d","50":"t3_878b8d","51":"t3_878b8d","52":"t3_878b8d","53":"t3_878b8d","54":"t3_878b8d","55":"t3_878b8d","56":"t3_878b8d","57":"t3_878b8d","58":"t3_878b8d","59":"t3_878b8d","60":"t3_878b8d","61":"t3_878b8d"},"comment_created_utc":{"0":1522066338.0,"1":1522082777.0,"2":1522187165.0,"3":1522072149.0,"4":1522068139.0,"5":1522109066.0,"6":1522158958.0,"7":1522475590.0,"8":1522600072.0,"9":1522067863.0,"10":1522080896.0,"11":1522082237.0,"12":1522082736.0,"13":1522086553.0,"14":1522086792.0,"15":1522114326.0,"16":1522168111.0,"17":1522187002.0,"18":1522463044.0,"19":1522530223.0,"20":1522548778.0,"21":1522563870.0,"22":1522588979.0,"23":1522463277.0,"24":1522520839.0,"25":1522183248.0,"26":1522080819.0,"27":1522082835.0,"28":1522085028.0,"29":1522091922.0,"30":1522092964.0,"31":1522093334.0,"32":1522099919.0,"33":1522106616.0,"34":1522119453.0,"35":1522133882.0,"36":1522148025.0,"37":1522151652.0,"38":1522169815.0,"39":1522174988.0,"40":1522175458.0,"41":1522178133.0,"42":1522184493.0,"43":1522301116.0,"44":1522347926.0,"45":1522451206.0,"46":1522451845.0,"47":1522472029.0,"48":1522517348.0,"49":1522518048.0,"50":1522520432.0,"51":1522522508.0,"52":1522534415.0,"53":1522543044.0,"54":1522560644.0,"55":1522617775.0,"56":1522619198.0,"57":1522620628.0,"58":1522624973.0,"59":1522641075.0,"60":1522621147.0,"61":1522622404.0},"comment_body":{"0":"<div class=\"md\"><p>Location: Northeast US<\/p>\n\n<p>Price range: Under 20k (17-18k preferable)<\/p>\n\n<p>Lease or Buy: Either<\/p>\n\n<p>New or used: Either (probably used for better deals)<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must haves: Fuel efficiency, AWD optional, Heated seats\/cold weather package desired<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either<\/p>\n\n<p>Intended use: Daily Driver\/family car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda6, Chevy Malibu, Honda Accord, Audi A3<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: If required<\/p>\n\n<p>Additional Notes: Would be will ing to sacrifice size for performance. (I.e. A3 instead of Accord). Just looking for any opinions based on real life decisions.<\/p>\n<\/div>","1":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","2":"<div class=\"md\"><p>Location: Atlanta, GA<\/p>\n\n<p>Price range: &lt;8k USD<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports Sedan\/Coupe<\/p>\n\n<p>Must haves: <\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily Driver, but want to have fun with it too<\/p>\n\n<p>Vehicles you&#39;ve already considered: <\/p>\n\n<p>Is this your 1st vehicle: No <\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: No, would love to learn<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes:  My car finally died.  Had it since HS and its gone.  Was hoping to keep it for 2 more years so I could easily afford what I really wanted (Alfa Romeo Giulia).  Looking for basically a bridge car that I could have for 2 years and be able to at least still have some value when trying to resell. <\/p>\n<\/div>","3":"<div class=\"md\"><p>Location: Eastern Massachusetts \nPrice range: $10K-$25K<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: 2-door or smaller 4\/5 door car<\/p>\n\n<p>Must haves: AWD, back up camera, enjoyable ride<\/p>\n\n<p>Desired transmission: Automatic<\/p>\n\n<p>Intended use: Daily Driver, Weekend Car.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Golf R, 328i or 428i (2-door or gran coupe) but can be hard to find decent ones in the price range. <\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: It&#39;d be nice, would pay a bit extra for a Bumper to Bumper Doug DeMuro loved warranty.<\/p>\n\n<p>Can you do Minor work on your own vehicle: I can do the simplest stuff but rarely have the time to do the slightly more involved stuff like brake pads. <\/p>\n\n<p>Can you do Major work on your own vehicle: Nope<\/p>\n\n<p>Additional Notes: I have a 2015 Nissan Altima 2.5s that just bores me to tears. I&#39;m looking to get rid of it and replace it with something I&#39;ll actually find fun to drive around. I think my issue is some of the stuff I&#39;m looking at is a bit above my budget. Even used many BMW 3 and 4 series and Audi A5s are in the $25-$30K range. My wife has a Subaru Imperza Hatch that we can use for errands and whatnot so my car really only needs to haul me around and make me smile. I don&#39;t need a massive horsepower king but fun through windy roads is what I care about. <\/p>\n<\/div>","4":"<div class=\"md\"><p>Location: South Florida, US<\/p>\n\n<p>Price range: 25k-30k, obviously want a good price but am willing to pay a bit more for better quality, longer life\/lower maintenance costs down the road.<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must haves: Fuel efficient, smooth ride, long life\/low maintenance\/ reliable<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2018 Camry SE and 2018 Accord<\/p>\n\n<p>Is this your 1st vehicle: First car that I’ll be buying myself<\/p>\n\n<p>Do you need a Warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I currently drive a 2007 Accord that I&#39;ve put 167,000 miles on. It&#39;s been needing more and more work done to it and am interested in getting a new car to last another 10 years. I currently don&#39;t even have an AUX or USB port so the Camry lacking Apple car\/Android auto won&#39;t be a deal breaker for me. <\/p>\n<\/div>","5":"<div class=\"md\"><p><strong>Location:<\/strong> Southern California, United States<\/p>\n\n<p><strong>Price range:<\/strong> 30k -\/+<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Japanese Sports Car<\/p>\n\n<p><strong>Must haves:<\/strong> I kind of don&#39;t want another FWD car because that&#39;s all I&#39;ve had my entire life, but if it&#39;s a good FWD car, I suppose I wouldn&#39;t mind<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Prefer manual, but a good auto tranny is also acceptable <\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> WRX<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Not needed, but nice to have<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yup, I normally do minor work on my own cars<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> To an extent. I&#39;m no mechanical by any means, but if a task looks fairly easy, I don&#39;t mind taking it on.<\/p>\n\n<p><strong>Additional Notes:<\/strong> So I was pretty set on a 2018 Subaru WRX, but I don&#39;t know anymore. With the Honda Civic Type-R just releasing and only costing about 6k more (granted that pushes it out of my price range), I feel that Type-R is leagues better than the WRX in nearly every aspect. And yeah, I know a more fair comparison would be the STi, but I don&#39;t know, the WRX doesn&#39;t really seem like it&#39;s worth it anymore. The WRX doesn&#39;t even have apple car play\/android auto and it&#39;s freaking 2018... <\/p>\n<\/div>","6":"<div class=\"md\"><p>Location: Orlando<\/p>\n\n<p>Price range: 17k-25k <\/p>\n\n<p>Lease or Buy: Buy (Unless someone thinks a lease is a better option?)<\/p>\n\n<p>New or used: Used most likely with under 30k miles<\/p>\n\n<p>Type of vehicle: Sports or Sporty Sedan<\/p>\n\n<p>Must haves: Looks sharp, fun to drive, won&#39;t TANK in depreciation, Android Auto would be a plus<\/p>\n\n<p>Desired transmission : Automatic (manual seems fun, but would be hell with my commute on I-4 with awful traffic all the time)<\/p>\n\n<p>Intended use: Daily Driver and road trips for a single guy<\/p>\n\n<p>Vehicles you&#39;ve already considered: Nissan Maxima, Audi A3\/4, Infiniti Q50, Hyundai Genesis, Acura TLX, Mustang<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Possibly<\/p>\n\n<p>Can you do Minor work on your own vehicle: Somewhat<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I hydroplaned and totaled my Mustang which was valued below what I owed due to me putting 32,000 miles on it in 1.5 years and after a deductible, I was under water 2k. I really did enjoy the drive of the car, but the interior was about as bare bones as you could get. Cloth seats, dialpad, tiny little old screen. (and the RWD did not fair well in good ol&#39; Florida rain) <\/p>\n\n<p>I am almost totally deadset on getting a Maxima, but my overthinking has started to get me to question my decision with people complaining about the depreciation, FWD, shitty infotainment center, and how large it is. I personally really enjoyed my test drives, loved the interior (really annoyed the 16 and 17 didn&#39;t have android auto), and the BIGGEST proponent is that we have a close family friend who owns a Nissan Dealership and is going to the manufacturer sale on April 4th, which could save me thousands on my Maxima. I could end up in a 2016 or 2017 SL Leathered and featured out Maxima in the low 20s. <\/p>\n\n<p>I have been suggested to check out the BRZ\/86 which I have always had my eyes on, but seems to be pretty tiny and with the automatic &quot;the 86 feels more like a small, loud, underpowered, cramped coupe and less like a budget sports car&quot; according to one reviewer which is how I felt when I sat in one, although didn&#39;t get a chance to test drive. I could be totally wrong. <\/p>\n\n<p>I checked out the Hyundai Genesis Coupe (having owned a 2007 Hyundai Tiburon) and the driving honestly really didn&#39;t impress me. It felt very stiff, had decent handling, and not as much get up and go as I was expecting. <\/p>\n\n<p>The Lexus RC350 looked sharp but is out of my price range, the ....Lexi? Lexuses? ones I could afford didn&#39;t really wow me. <\/p>\n\n<p>I&#39;m really not interested in a BMW, I&#39;ve heard too many horror stories of repair costs<\/p>\n\n<p>I was worried about the repair costs of Audi as well, the A3 seemed way too small for me, but the A4 has me intrigued. I didn&#39;t get a chance to test drive it, but it seems juuuust at the edge of my max for my budget with the miles. Also still worried about luxury repair costs. <\/p>\n\n<p>I test drove a 2014 Infiniti Q50 and really enjoyed it, although enjoyed the Maxima better. The dual screen was a tad awkward, and I of course also worry about luxury costs of maintenance. Would love to get in a Q60S but out of my price range. <\/p>\n\n<p>Am I being stupid with wanting to get something sporty and not just getting a reliable Honda or Toyota boring sedan? Or maybe a Sonata 2.0 sport or Civic Sport? Is the Nissan Maxima with a heavy discount a horrible idea or am I just overthinking? I&#39;m 23, making decent money but I&#39;m not like pushing $75k+. I drive a lot and enjoy driving and like to incorporate technology. <\/p>\n\n<p>(The Kia Stinger looks super interesting...but $30-40K with no deals may be hard) <\/p>\n<\/div>","7":"<div class=\"md\"><p>Location: Outskirts of Philadelphia, PA<\/p>\n\n<p>Price range: 20K max.<\/p>\n\n<p>Lease or Buy: Open to either. Leaning towards buying<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Car, but open to anything<\/p>\n\n<p>Must haves: Fun Ride, Fuel Efficient, Bluetooth. Bonus Points for Turbo, Super Bonus Points for a Bright\/Cool Color<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic all the way. <\/p>\n\n<p>Intended use: Daily Drive for work that&#39;s ~10 miles away one way. I stay home frequently when not at work, but like to take night drives to destress and listen to music.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Chevy Sonic, Honda Fit<\/p>\n\n<p>Is this your 1st vehicle: Currently have a VW Beetle that I inherited from my sister, The bug has seen some rough stuff in her day, will probably die next winter..I have this feeling it will.  In the meantime, gathering money and research before it completely falls apart.<\/p>\n\n<p>Do you need a Warranty: Probably, to be on the safe side.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Nope, but if it&#39;s an easy fix and easy to learn, I&#39;m very willing to learn.<\/p>\n\n<p>Can you do Major work on your own vehicle: Nope<\/p>\n<\/div>","8":"<div class=\"md\"><p>Location: North Carolina<\/p>\n\n<p>Price range: 6-8k<\/p>\n\n<p>Lease or Buy: buy<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: car<\/p>\n\n<p>Must haves: some trunk space, not a ton.  decent reliability.  prefer rwd, but open to a lot of things<\/p>\n\n<p>Desired transmission (auto\/manual, etc): manual preferred, but will make automatic exceptions (eg mercedes, lexus gs, acura)<\/p>\n\n<p>Intended use: daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: mazda3, civic si, audi a3, mercedes e, mercedes c, charger, lexus gs, acura tl<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes:<\/p>\n<\/div>","9":"<div class=\"md\"><ul>\n<li>Location: Croatia<br\/><\/li>\n<li>Price range: ~50 000 HRK (~8500 USD, ~7000 €)<br\/><\/li>\n<li>Buy<br\/><\/li>\n<li><strong>Used<\/strong><br\/><\/li>\n<li>Type of vehicle: I don&#39;t know the difference between those. NOT a real off-road<br\/><\/li>\n<li>Must haves: <strong>big trunk while having 5 seats, be higher from ground to not scratch off of rocks and small holes when passing mountain roads<\/strong><\/li>\n<li>Manual or automatic transmission<br\/><\/li>\n<li>Intended use: <strong>Going on field works through macadam and other bumpy mountain roads (most important)<\/strong> as well as use in the city (not daily).<br\/><\/li>\n<li>This is my 1st vehicle<br\/><\/li>\n<li>Additional notes: <strong>I am looking for &quot;normal&quot; cars which are better at the mentioned categories\/tasks than other cars, and not real off-road vehicles<\/strong>. I really have no idea about cars.<\/li>\n<\/ul>\n<\/div>","10":"<div class=\"md\"><p>I&#39;m pretty dead set on a 2016-2018 Nissan Maxima.<\/p>\n\n<p>I really liked the SL trim model, but the 17 and 16 do not have android auto, which would be a huge bonus for me.<\/p>\n\n<p>I&#39;m not quite sure it is worth the amount I would have to pay more to get a 2018, or having to sacrifice the trim level for android auto.<\/p>\n\n<p>Any recommendations? Is it absolutely impossible to upgrade the in-car software via the SD Card? the 2017 can use CarPlay for Apple but not Android Auto and the 2016 has neither. I&#39;ve heard of Best Buy and Geek Squad updating firmware before, is it possible to do without completely changing my entertainment system and losing features such as backup camera?<\/p>\n<\/div>","11":"<div class=\"md\"><p>Location: Metro Detroit\/Southeast MI<\/p>\n\n<p>Price Range: Up to 5,000 USD <\/p>\n\n<p>Lease or Buy: Buy <\/p>\n\n<p>New or Used: Used<\/p>\n\n<p>Type of Vehicle: Coupe, Sedan, Hatch, Wagon, basically anything <\/p>\n\n<p>Must Haves: If American then V8 but otherwise V6 or possibly a 4 banger depending on the car, somewhat reliable, sporty feel and somewhat modifiable<\/p>\n\n<p>Desired Transmission: Manual<\/p>\n\n<p>Intended Use: Daily driver<\/p>\n\n<p>Vehicles You’ve Already Considered: SN95 Mustang, Third Gen Camaro, Fourth Gen Camaro, Acura RSX, BMW 3 Series<\/p>\n\n<p>Is This Your First Vehicle: Yes<\/p>\n\n<p>Do You Need A Warranty: No <\/p>\n\n<p>Can You Do Minor Work On Your Own Vehicle: Yes<\/p>\n\n<p>Can You Do Major Work On Your Own Vehicle: Somewhat <\/p>\n\n<p>Additional Notes: I notice that many cars have a lot of rust in my area, and it’s pretty unavoidable. I’m not planning to sell it later on and I’m willing to drive this vehicle until it costs too much to fix. <\/p>\n<\/div>","12":"<div class=\"md\"><p>Location: Washington DC<\/p>\n\n<p>Price Range: Up to 52,000 USD <\/p>\n\n<p>Lease or Buy: Buy <\/p>\n\n<p>New or Used: New<\/p>\n\n<p>Type of Vehicle: 4 door sedan<\/p>\n\n<p>Must Haves: Usual tech, navigation touch screen and all, preferably the behind the steering wheel screen as well, rear camera, heated front seats and heated steering wheel (can be extra cost options like the heated steering wheel for the Audi) <\/p>\n\n<p>Desired Transmission: Automatic <\/p>\n\n<p>Intended Use: Daily driver mainly in city, but often take long trips from dc to New York and other places <\/p>\n\n<p>Vehicles You’ve Already Considered: Audi A4  with prestige upgrades, Mercedes c300<\/p>\n\n<p>Is This Your First Vehicle: No, but it is the first one I’m buying on my own. <\/p>\n\n<p>Do You Need A Warranty: Preferably <\/p>\n\n<p>Can You Do Minor Work On Your Own Vehicle: Yes<\/p>\n\n<p>Can You Do Major Work On Your Own Vehicle: No<\/p>\n\n<p>Additional Notes: Not really a fan of BMW’s so not interested in those. I’m looking for more luxury and comfort not so much performance, better acceleration is nice though. Looking for a 2017\/2018\/2019 model year.  I’m also not buying it until late May most likely, so if anything is not out yet but coming out in the next 1-3 months it can still be considered. <\/p>\n\n<p>It may be worth noting this will be the first luxury car I’ve owned or anyone I know has. Information about extra costs that may come with owning a “luxury” sedan would be appreciated. <\/p>\n<\/div>","13":"<div class=\"md\"><p>Location: (Specify your country or region) Alberta, Canada<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency) max 25K canadian<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.) Sedan, Coupe, Sport Sedan<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.) Heated Seats, Ability to play music from phone (I&#39;m sick of my cassette aux cord), would prefer over 200Hp, but will settle for 175hp+, must be reliable (no german cars)<\/p>\n\n<p>Desired transmission (auto\/manual, etc): manual<\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.) Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Civic Ex-T, Civic Si, Accord V6, Mazda3 GT, Altima, Elantra GT<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Prefered but not mandatory<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) No<\/p>\n\n<p>Additional Notes: All prices are in Canadian, leaning towards New (even if it means financing longer) because the last 5 used cars my parents have bought have required major repairs in the 2 years following purchase.<\/p>\n<\/div>","14":"<div class=\"md\"><ul>\n<li><p>LOCATION: OHIO<\/p><\/li>\n<li><p>PRICE RANGE: $24,000-$40,000<\/p><\/li>\n<li><p>BUY<\/p><\/li>\n<li><p>NEW or USED: NEW or CPO.  I’m happy with my CPO Cruze. <\/p><\/li>\n<li><p>TYPE: Want either a coupe, midsize sedan, midsize suv, or a truck.  My heart leans towards truck or 5.0L Rustang, but my wallet leans towards turbo-4 coupe. <\/p><\/li>\n<li><p>MUST-HAVES: heated seats, remote start, Apple CarPlay, sporting or off-road potential depending on vehicle type, <\/p><\/li>\n<li><p>TRANS: ideally a manual, but the market isn’t in my favor anymore. <\/p><\/li>\n<li><p>Use: Daily Driver if good mpg. Wife’s vehicle if bad on gas. I can take the Cruze to work once she learns and masters stickshift.  <\/p><\/li>\n<li><p>CONSIDERED: 2018-19 Civic Si coupe, 2014-16 Mustang Ecoboost\/5.0, 2016-18 Tacoma TRD Sport, 2015-18 Colorado Z71\/Canyon SLT, 2014-19 Edge Sport\/ST, 2015-18 Fusion Sport<\/p><\/li>\n<li><p>CARS I DO NOT WANT: Anything Fiat\/Chrysler, hatchbacks, anything from Nissan or Infiniti<\/p><\/li>\n<li><p>IS THIS YOUR FIRST VEHICLE: Jesus, no. This will be number 12. <\/p><\/li>\n<li><p>WARRANTY: Definitely. <\/p><\/li>\n<li><p>MINOR WORK: Yea. I can change tires, brakes, other maintenance items, and swap motor mounts on my Focus. Could probably do anything if needed, but I’d rather not. <\/p><\/li>\n<li><p>MAJOR WORK: possibly, but I prefer not to try. <\/p><\/li>\n<li><p>TIMEFRAME: End of 2018. Gonna try to snag a leftover 2018 for a good price during model year end sales, but can grab a year or two old CPO if that doesn’t fit the budget.  <\/p><\/li>\n<\/ul>\n\n<p>Only limitation is the life of my Focus. It has 201,000 on it and needs to survive til the end of the year. The later, the better prepared we’ll be financially. I can limp it along if need be. Ugh <\/p>\n<\/div>","15":"<div class=\"md\"><p>Location: Canada<\/p>\n\n<p>Price range: Less than $50,000-ish<\/p>\n\n<p>Lease or Buy: Lease<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Sedan\/Luxury Sedan\/Hatchback<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2018 Toyota Camry XSE, 2018 Honda Accord, 2018 Mercedes CLA 250, 2018\/2019 Mercedes C 300, 2019 Mercedes A-class<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Do you need a Warranty: Yes?<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<hr\/>\n\n<p>I&#39;m looking for a new car. It needs to be under around $50,000 (Canadian).<\/p>\n\n<p>My current shortlist is the following (with the prices in brackets, after choosing my options and packages):<\/p>\n\n<hr\/>\n\n<p><strong><a href=\"https:\/\/www.toyota.ca\/toyota\/en\/vehicles\/camry\/overview\">2018 Toyota Camry XSE<\/a> ($36,670):<\/strong><\/p>\n\n<p>I have two issues with this car. First, the front doesn&#39;t look too great in my opinion. Secondly, and more importantly, it doesn&#39;t come with Android Auto.<\/p>\n\n<p><strong><a href=\"https:\/\/www.honda.ca\/accord_sedan\/\">2018 Honda Accord<\/a> ($40,971):<\/strong><\/p>\n\n<p>Good all-around car, but it&#39;s a bit boring and too old-people looking.<\/p>\n\n<p><strong><a href=\"https:\/\/www.mercedes-benz.ca\/en\/vehicles\/class\/cla\/coupe\">2018 Mercedes CLA 250<\/a> ($44,820):<\/strong><\/p>\n\n<p>I&#39;ve always loved Mercedes&#39; cars. It&#39;s on the more expensive end, but it is better looking than the others. My main worry with getting the CLA is I have a feeling it&#39;s on the cusp of getting a complete redesign, inside and out, if the latest designs of the new A-class and CLS are any indication.<\/p>\n\n<hr\/>\n\n<p>There are two other cars I&#39;d be willing to consider. The first being the <strong><a href=\"https:\/\/www.mercedes-benz.ca\/en\/vehicles\/class\/c-class\/sedan\">2018 Mercedes C 300 Sedan<\/a> ($52,840)<\/strong>, however, it&#39;s on the more expensive end (a little over my budget). Or maybe I should wait for the 2019 model, which goes on sale later this year? The second being the new <strong><a href=\"https:\/\/www.mercedes-benz.ca\/content\/canada\/mpc\/mpc_canada_website\/en\/home_mpc\/passengercars\/home\/vehicles\/future_vehicles\/a-class-hatch.html\">2019 Mercedes A-class<\/a> (price unknown)<\/strong>, however, this isn&#39;t supposed to arrive in Canada until the end of the year as well.<\/p>\n\n<p>What do you think? Is there any other car you might suggest, or should I go with something on my list? Or wait it out? In what order would you rank the cars, from best to worst?<\/p>\n\n<p>Thanks!<\/p>\n<\/div>","16":"<div class=\"md\"><p>Location: Biloxi, MS<\/p>\n\n<p>Price range: $10,000-$28,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Car<\/p>\n\n<p>Must haves: Fuel efficient 30+ mpg preferred, fun to drive, sedan also preferred but not mandatory.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either. Would really like a manual tho.<\/p>\n\n<p>Intended use: Daily Driver, 60 mi one way commute.<\/p>\n\n<p>Vehicles you&#39;ve already considered: Civic, Civic Si, Corolla, Camry<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Maybe.<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Would like to avoid this but have done in the past.<\/p>\n\n<p>Additional Notes:\nLong commutes are way better when you enjoy what you drive. Upgraded sound system (quality not volume) and comfy seats also a plus. Really liking the Civic SI. wife wants me to get a prius LOL<\/p>\n<\/div>","17":"<div class=\"md\"><p>Location: Southern California<\/p>\n\n<p>Price range: $0-$35k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New, or newer used model<\/p>\n\n<p>Type of vehicle: Sedan or Hatchback<\/p>\n\n<p>Must haves: Hybrid, trunk space, heated\/cooled seats, fuel efficient, not outdated on tech, awd if possible, enough headroom in rear to seat a six foot tall person if possible<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: Daily Driver, bonus if it can be fun to drive<\/p>\n\n<p>Vehicles you&#39;ve already considered: Hyundai Ioniq, Camry Hybrid<\/p>\n\n<p>Is this your 1st vehicle: No, own a 2004 mustang<\/p>\n\n<p>Do you need a Warranty: Preferrable<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n<\/div>","18":"<div class=\"md\"><p>Location: Canada<\/p>\n\n<p>Price range: up to $30k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: either<\/p>\n\n<p>Type of vehicle: Van\/SUV, anything with 6+ seats<\/p>\n\n<p>Must haves: <\/p>\n\n<p>Desired transmission (auto\/manual, etc): Must be Auto<\/p>\n\n<p>Intended use: Vehicle to drive family around<\/p>\n\n<p>Vehicles you&#39;ve already considered:<\/p>\n\n<p>Is this your 1st vehicle: no, currently have 2002 dodge grand caravan<\/p>\n\n<p>Do you need a Warranty: <\/p>\n\n<p>Can you do Minor work on your own vehicle: no<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: Removable seats, at least the very back is required.<\/p>\n<\/div>","19":"<div class=\"md\"><p>Location: Upstate NY in snow country\nPrice range: $40-50K Lease or Buy: Buy New or used: Prefer new but would take lightly used Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.): Luxury small 4 door sedan such as a Audi A4, Lexus IS, or Acura TLS (Heard BMW 3 series no good this year cause new version coming out next year)<\/p>\n\n<p>Or I was thinking about a small Luxury SUV. The question is I&#39;m not sure I need an SUV, I have an Acura TSX now and I seem to get by folding down the back seats for skiis, bikes, etc. It&#39;s just me, I don&#39;t have a wife and kids.<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.): Trunk space, nice interior seats that hug an athletic dude (I don&#39;t need huge seats but like ones that hug you), great stereo sound (assuming a car will have better sound than SUV?), heated seats, front wheel drive (bonus AWD) because I drive in snow in upstate NY alot.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.) Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Lexus IS, Audi A4, Acura TLX<\/p>\n\n<p>Additional Notes: Would like a car that is safe, reliable, and very comfortable on the inside. I care more about the interior than exterior. Good sporty bucket seats is a nice feature(i&#39;m not a big person so I like to feel hugged by my seat). I like to feel comfortable in my car and listen to music and enjoy my drive. I&#39;m not super concerned on the power of the car but enjoy handling.<\/p>\n<\/div>","20":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","21":"<div class=\"md\"><p>Location: New England<\/p>\n\n<p>Price Range: $0-$3000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or Used: Very Used<\/p>\n\n<p>Type of Vehicle: Sedan\/Wagon\/Hatch<\/p>\n\n<p>Must Haves: Four real seats, decent\/fun driving dynamics, manual transmission<\/p>\n\n<p>Desired transmission: Manual<\/p>\n\n<p>Intended use: Daily\/occasional autocross<\/p>\n\n<p>Vehicles you&#39;ve already considered: SAAB 9000, Mk3 VW Jetta TDI, Honda Civic Wagovan, Merkur XR4Ti, Volvo 240<\/p>\n\n<p>Is this your first vehicle: First street car in my name. I have a 240 wagon LeMons car and share my current 240 wagon with my dad.<\/p>\n\n<p>Do you need a warranty: HA<\/p>\n\n<p>Can you do minor work on your own vehicle: I sure can.<\/p>\n\n<p>Can you do major work on your own vehicle: Yup.<\/p>\n\n<p>Additional notes: Looking for something fun, practical and quirky to daily. I&#39;m partial to Euro stuff but will consider anything really.<\/p>\n<\/div>","22":"<div class=\"md\"><p>Location: Cleveland, OH\nPrice range: $28-36K\nBuy\/ New\nType: SUV, Crossover\nMust haves: AWD, heated steering, trunk space, smooth ride\nTransmission: Auto\nUse: daily drive, future kid incoming \nVehicles considered: 19-Santa Fe, 19\/20-Rav4, \n1st Vehicle: No\nWarranty: Yes\nRepairs: Change tire is it\nOther notes: Have had 4Runner, 3series, and currently a ‘15 IS350 Fsport. Im 6’4” and need more room for myself and fam. Needs to drive decent in snow. Thanks all!<\/p>\n<\/div>","23":"<div class=\"md\"><p>Location: USA SoCal<\/p>\n\n<p>Price range:0k-5k<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: car,sports car<\/p>\n\n<p>Must haves: AWD or RWD v8 unless you can convince me a v6 is better<\/p>\n\n<p>Desired transmission : manual<\/p>\n\n<p>Intended use:  Weekend Car\/Track Toy\/Project Car<\/p>\n\n<p>Vehicles you&#39;ve already considered:(perfer 02 for the f body) 97-02 trans am\/firebird, 97-02 camaro, 350z, 370z,<\/p>\n\n<p>Is this your 1st vehicle: kinda<\/p>\n\n<p>Do you need a Warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: yes<\/p>\n\n<p>Additional Notes: i don&#39;t need an economical car so that is outta the question i&#39;m just looking for a quick car to play with and turbo charge later. looking for other suggestions in cars.<\/p>\n<\/div>","24":"<div class=\"md\"><p>Location: San Francisco Bay Area<\/p>\n\n<p>Price range: USD $250,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports car<\/p>\n\n<p>Must haves: Looks, sound, speed<\/p>\n\n<p>Desired transmission (auto\/manual, etc): N\/A<\/p>\n\n<p>Intended use: Fun driving <\/p>\n\n<p>Vehicles you&#39;ve already considered: Huracan, 570s, 488 GTB<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Looking for something super fun in the Lamborghini, Ferrari range<\/p>\n<\/div>","25":"<div class=\"md\"><p>Location: New York City<\/p>\n\n<p>Age: 25<\/p>\n\n<p>Price range: 200k -250k (Lamborghini Huracan) <\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New hopefully<\/p>\n\n<p>Type of vehicle: Sports car<\/p>\n\n<p>Must haves: must be white<\/p>\n\n<p>Desired transmission (auto\/manual, etc): automatic<\/p>\n\n<p>Intended use: weekend car<\/p>\n\n<p>Vehicles you&#39;ve already considered: lamborghini Huracan , audi R8 , or mercedes s550<\/p>\n\n<p>Is this your 1st vehicle: no. I have a Mercedes G wagon. But I now want a sportscar<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes but it would not be ideal<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n<\/div>","26":"<div class=\"md\"><p><strong>Location:<\/strong> United States - California<\/p>\n\n<p><strong>Price range:<\/strong> $25,000 - $40,000<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan, SUV, or Hatchback<\/p>\n\n<p><strong>Must haves:<\/strong> AWD, manual transmission, decent gas mileage (between 20-30 combined mpg)<\/p>\n\n<p><strong>Desired transmission:<\/strong> Manual<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver, weekend adventure getaway vehicle, especially for winter trips up to the mountains<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> WRX Limited (non-STI)<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong>Yes, as I am planning on buying this new<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Limited<\/p>\n\n<p><strong>Additional Notes:<\/strong>  Right now the WRX seems to be the big contender for my choice, but I want to know if there are any other options I can choose from from other car brands.  I have heard from a few people that repairing Subarus can be a bit on the pricier side and want to know if their reliability has greatly improved over the years.  Otherwise what would be some great alternatives for me to choose from, and whether or not it is worth waiting for something new to pop out<\/p>\n<\/div>","27":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","28":"<div class=\"md\"><p>Location: Primarily Oregon (college town)\nPrice range: 10K-17K USD\nLease or buy: Buy\nNew or used: Used\nType of vehicle: SUV\/Compact SUV\nMust have: AWD, reasonably efficient gas mileage\nDesired transmission: Manual\nIntended use: Daily driver\nVehicles considered: Subaru Forester, Honda CR-V, Mazda CX-9 \nIs this first vehicle? No. Currently drive a 2006 Mazda 6 \nDo you need a warranty? Unsure\nCan you do minor work on vehicle? No\nCan you do major work on vehicle? No\nNotes: Really like the sound of the Forester but have gotten mixed reviews about reliability of Subaru’s in general. Don’t want something I’m gonna need to be repairing or having break down on me (poor college student)<\/p>\n<\/div>","29":"<div class=\"md\"><p>Location: Tampa, FL<\/p>\n\n<p>Price range: Under 20,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: CPO<\/p>\n\n<p>Type of vehicle: Anything but a crossover, hatchback or two seater. I could do a truck, but I don’t want anything too large.<\/p>\n\n<p>Must haves: Leather Seats that aren’t black, Bluetooth, 0-60 under 8 seconds<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Ford Fusion Hybrid, V6 Mustang<\/p>\n\n<p>Is this your 1st vehicle: No, number 3<\/p>\n\n<p>Do you need a Warranty: Certified Pre-Owned<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n<\/div>","30":"<div class=\"md\"><p>Location: United State, San Francisco, CA<\/p>\n\n<p>Price range: $8,000 - $20,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Eeither<\/p>\n\n<p>Type of vehicle: Mazda 3 Sedan<\/p>\n\n<p>Must haves: N\/A<\/p>\n\n<p>Desired transmission (auto\/manual, etc): N\/A<\/p>\n\n<p>Intended use: Work and travel<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda 3 and Honda Civic<\/p>\n\n<p>Is this your 1st vehicle: Second<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc): No<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ): No<\/p>\n\n<p>Additional Notes: I recently got into a car accident where I was at fault. The car that was in the total loss collision was a new (when I bought it) 2015 Mazda 3. I really like the 2015 Mazda 3, so I would like to get it again, but should I consider the new Mazda 3s, and if so, is the price justified?<\/p>\n\n<p>Thanks,<\/p>\n<\/div>","31":"<div class=\"md\"><p>Location: South East U.S.A.<\/p>\n\n<p>Price range: 35,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Classic Convertible\/Coupe\/Sedan, Classic Truck<\/p>\n\n<p>Must haves: V8, large size, I’m a big dude<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either or<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: I’ve looked at different classic cars from the 60s and very early 70s. <\/p>\n\n<p>Is this your 1st vehicle: No, I own a 2008 F250 Superduty<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: I am capable, but I am living on campus and don’t have access to the tools I normally would. <\/p>\n\n<p>Additional Notes: I am looking for a clean Classic car that will require only light matinence. Some of the bigger names that are more expensive due to collector status are out af my reach due to pricing, but something that isn’t quite as popular as the big name musclecars of the time while still being badass is what I’m looking for. I’m thinking that I don’t really need something practical right now, and this might be the only time in my life I can Daily something like this. <\/p>\n<\/div>","32":"<div class=\"md\"><p>Location: South Carolina, United States.<\/p>\n\n<p>Price range: $10,000-$15,000<\/p>\n\n<p>Lease or Buy:Buy<\/p>\n\n<p>New or used: Used. Under 100k miles<\/p>\n\n<p>Type of vehicle: Car\/Sports Car\/Luxury Car<\/p>\n\n<p>Must haves: Bluetooth, Backup Camera, Cooled Seats, Good Safety Rating,<\/p>\n\n<p>Desired transmission (auto\/manual, etc):Automatic<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2012 Mercedes E Class Coupe, Audi TT,<\/p>\n\n<p>Is this your 1st vehicle:Yes<\/p>\n\n<p>Do you need a Warranty:No<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Since it is so hot in the south I&#39;ve been looking for something with cooled\/ventilated seats but no website has cooled seats as a filter. Managed to find a Mercedes E 350 Coupe 2012 with cooled seats in Atlanta but I can&#39;t find anything closer to my home town of Columbia. Finding any sports car or luxury car in the area has proved to be tough due to the lack of any available. Its not like there is a lack of the cars there just aren&#39;t any near me. Where should I look to find these vehicles and what models do you suggest that has cooled seats?<\/p>\n<\/div>","33":"<div class=\"md\"><p>Location: NJ\/NY<\/p>\n\n<p>Price range: 10-30k<\/p>\n\n<p>Lease or Buy: open to either but leaning buy<\/p>\n\n<p>New or used: lease or certified pre. <\/p>\n\n<p>Type of vehicle: compact suv, ideally luxury<\/p>\n\n<p>Must haves: AWD<\/p>\n\n<p>Desired transmission: auto<\/p>\n\n<p>Intended use: weekend use<\/p>\n\n<p>Vehicles you&#39;ve already considered: none yet<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Do you need a Warranty: yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: no<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: interested in Mercedes and Audi but don’t want to buy a car known for high cost to maintain. <\/p>\n\n<p>Edit: typing is hard<\/p>\n<\/div>","34":"<div class=\"md\"><p><strong>Location:<\/strong> Philadelphia<\/p>\n\n<p><strong>Price range:<\/strong> Up to $5,000 for purchase and repairs<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> Used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Short cab trucks, possibly SUVs<\/p>\n\n<p><strong>Must haves:<\/strong> 4x4, AWD, 16+ mpg highway<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Prefer auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver, Off-roading. Need to drive ~30 minutes roundtrip for work this summer, possibly some longer road trips, and maybe bring to school with me in the fall.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> I really want a Bronco, but 92 added the front crumple zone and 94 the airbag, but the 92 also made it technically illegal to remove the top afaik. Have also been looking at geo trackers, ramchargers, k5 blazer, jeep t\/yj, 3door rav4s, older, boxier short cab trucks like the k1\/2500, c\/s10, f150, f100, ranger, etc.<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Not gonna happen lol<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> If I can learn it from a youtube video \/ manual and I don&#39;t need a lift, probably<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n<\/div>","35":"<div class=\"md\"><p>Location: New Jersey\nPrice Range: less than $15,000\nBuy\/Finance\nCPO is preferred (I’m very wary of CL\/private sellers\/shady car dealers)\nType: Sedan\nMust have: Leather Seats and if applicable, push to start\nIntended use: Family car\/Daily drive\nVehicles considered: Civic\/Corolla\/Camry\nWould be second car(planning on selling my lemon)\nI would prefer a warranty<\/p>\n\n<p>In terms of work(minor and major) I can do anything that can be done on YT without special equipment.<\/p>\n<\/div>","36":"<div class=\"md\"><p>• Location: Canada<\/p>\n\n<p>• Price range: 15000-30000$CAD<\/p>\n\n<p>• Lease or Buy:Buy<\/p>\n\n<p>• New or used: New<\/p>\n\n<p>• Type of vehicle: hatchback, sedan<\/p>\n\n<p>• Must haves: fun ride, awd or fwd cause canada<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>• Intended use:Daily driver<\/p>\n\n<p>• Vehicles you&#39;ve already considered: \n&#39;18 golf gti, Subaru WRX, Mazda 6<\/p>\n\n<p>• Is this your 1st vehicle:\n3rd<\/p>\n\n<p>• Do you need a Warranty:\nWould be preferable but shouldn&#39;t matter<\/p>\n\n<p>• Can you do Minor work on your own vehicle: Yep :) <\/p>\n\n<p>• Can you do Major work on your own vehicle: No :\/<\/p>\n\n<p>• Additional Notes:<\/p>\n<\/div>","37":"<div class=\"md\"><p>Hello\nIm in new mexico around santa fe and abq area.\nMy budget is around 6k, i need a reliable prefereably japanese car, honda toyotas 4 banger for work my work alone is 12k miles a year.\nSo i need a 4 banger that has less than 130k miles and reliable and economical.\nFront drive please no priuses.\nI found 2008 honda civic coupe on criagslist for almost 7k is it worth it? It had under 90k miles.<\/p>\n\n<p>Thank you.<\/p>\n<\/div>","38":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","39":"<div class=\"md\"><ul>\n<li>Location: Texas<\/li>\n<li>Price range: $20k max<\/li>\n<li>Lease or Buy: buy<\/li>\n<li>New or used: used<\/li>\n<li>Type of vehicle: Sedan, Crossover, SUV, wagon<\/li>\n<li>Must haves: Reliable reputation<\/li>\n<li>Desired transmission: auto<\/li>\n<li>Intended use: Daily Driver, Family Car<\/li>\n<li>Vehicles you&#39;ve already considered: Toyota Highlander, Ford Flex<\/li>\n<li>Is this your 1st vehicle: no<\/li>\n<li>Do you need a Warranty: no<\/li>\n<li>Can you do Minor work on your own vehicle: yes<\/li>\n<li>Can you do Major work on your own vehicle: no<\/li>\n<li>Additional Notes: I am a very long-legged chap (am 6&#39;6&quot;), and therefore have to move the drivers seat all the way back in most cars. What would be a good used car or SUV\/crossover that could comfortably seat myself as well as fit a toddler in the seat behind me?<\/li>\n<\/ul>\n<\/div>","40":"<div class=\"md\"><p>Location: (Specify your country or region) USA, Phoenix Area<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency) $10,000-$28,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.) Sports Car\/Sedan<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.) Greater than 22mpg combined would be preferable, as I have a 30mile commute to and from work each day. <\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic<\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.) Daily Drive<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mustang, Charger, BMW 3 Series<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) No<\/p>\n\n<p>Additional Notes: I moved to Arizona about 6 months ago and drastically increased my income to the $90,000+ range. I&#39;ve never enjoyed driving or taken pride in my vehicle, and wanted something that excites me to drive everyday. I had a 2013 Kia Forte but recently found out that I have $2200 in repairs on the brakes alone to make it operational again. Considering I was already wanting to buy a new car within the next 2 years, decided I&#39;d start looking now. <\/p>\n<\/div>","41":"<div class=\"md\"><p>Location: Toronto, Ontario, Canada<\/p>\n\n<p>Price range: $40,000-$65,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New, Used if they have adequate infotech<\/p>\n\n<p>Type of vehicle: Luxury SUV<\/p>\n\n<p>Must haves: Luxurious interior, remote start, maps\/carplay, heated steering wheel, heated\/cooled seats, seat memory, lumbar support.<\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Intended use: Daily Driver, Family<\/p>\n\n<p>Vehicles you&#39;ve already considered: BMW X3, Audi Q5, Mercedes GLC, Porsche Maccan, Volvo CX60, Land Rover Disco Sport<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Looking for a Luxury SUV with all the tech bells and whistles. Luxurious interior is most important. Most cars are missing a feature or 2 i&#39;d like, for example it&#39;s tough to find remote start on most of these cars.<\/p>\n<\/div>","42":"<div class=\"md\"><p>Location: South Carolina, United States.<\/p>\n\n<p>Price range: $10,000-$15,000<\/p>\n\n<p>Lease or Buy:Buy<\/p>\n\n<p>New or used: Used. Under 100k miles<\/p>\n\n<p>Type of vehicle: Car\/Sports Car\/Luxury Car<\/p>\n\n<p>Must haves: Bluetooth, Backup Camera, Cooled Seats, Good Safety Rating,<\/p>\n\n<p>Desired transmission (auto\/manual, etc):Automatic<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2012 Mercedes E Class Coupe, Audi TT,<\/p>\n\n<p>Is this your 1st vehicle:Yes<\/p>\n\n<p>Do you need a Warranty:No<\/p>\n\n<p>Can you do Minor work on your own vehicle: No<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Since it is so hot in the south I&#39;ve been looking for something with cooled\/ventilated seats but no website has cooled seats as a filter. Managed to find a Mercedes E 350 Coupe 2012 with cooled seats in Atlanta but I can&#39;t find anything closer to my home town of Columbia. Finding any sports car or luxury car in the area has proved to be tough due to the lack of any available. Its not like there is a lack of the cars there just aren&#39;t any near me. Where should I look to find these vehicles and what models do you suggest that has cooled seats?<\/p>\n<\/div>","43":"<div class=\"md\"><p>Location: Southern California<\/p>\n\n<p>Price range: $0-$~25000\nLease or Buy:Buy<\/p>\n\n<p>New or used: New or newer used model (2015+)<\/p>\n\n<p>Type of vehicle: Sedan or Hatch<\/p>\n\n<p>Must haves: Fuel efficient, trunk space, rear seat comfort (good enough headroom to sit a six foot tall person comfortably, leg room), relatively up to date on tech\nDesired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Toyota Camry<\/p>\n\n<p>Is this your 1st vehicle: No, 2004 Ford Mustang<\/p>\n\n<p>Do you need a Warranty: No, but preferred<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n<\/div>","44":"<div class=\"md\"><p>Location: Southern New Jersey<\/p>\n\n<p>Price Range: preferably under $5,000; Likely around $7,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or Used: Newer Used<\/p>\n\n<p>Type: Sedan, but open to similar<\/p>\n\n<p>Must Haves: Fuel efficient, preferably long lasting<\/p>\n\n<p>Desired Trans: Auto<\/p>\n\n<p>Intended Use: Daily Driver, Occasional long trips<\/p>\n\n<p>Vehicles considered: Camry, Elantra, Civic, Forte<\/p>\n\n<p>1st Vehicle: No; Previously had 2002 Nissan Maxima that I totalled, currently have 2003 Ford Escape with too high upkeep &amp; gas<\/p>\n\n<p>Warranty: Would be nice, not a necessity<\/p>\n\n<p>Minor Work: Yes<\/p>\n\n<p>Major Work: Dependent on location of work. If no lift is needed, most likely yes. If not, it goes to a shop<\/p>\n\n<p>Additional notes: Looking at former lease or loan cars, something that will hold it&#39;s value, should I choose to sell it in the next few years after college. Situation is very up in the air right now. <\/p>\n<\/div>","45":"<div class=\"md\"><p><strong><em>Location:<\/em><\/strong>  Kentucky<\/p>\n\n<p><strong><em>Price range:<\/em><\/strong>  5K to 10K, not a hard limit since all of my income is disposable but of course cheaper is better.<\/p>\n\n<p><strong><em>Lease or Buy:<\/em><\/strong> Buy<\/p>\n\n<p><strong><em>New or used:<\/em><\/strong> Used<\/p>\n\n<p><strong><em>Type of vehicle:<\/em><\/strong> Sports car<\/p>\n\n<p><strong><em>Must haves:<\/em><\/strong> Fit 6&#39;6 me. Not be super unreliable or anything (if that makes sense). Ideally RWD.<\/p>\n\n<p><strong><em>Desired transmission (auto\/manual, etc):<\/em><\/strong>Manual.<\/p>\n\n<p><strong><em>Intended use:<\/em><\/strong> Daily driver<\/p>\n\n<p><strong><em>Vehicles you&#39;ve already considered:<\/em><\/strong> 4th Gen Mustang, 5th gen Mustang, Boxster 986, C5 Corvette, FRS<\/p>\n\n<p><strong><em>Is this your 1st vehicle:<\/em><\/strong> Yes<\/p>\n\n<p><strong><em>Do you need a Warranty:<\/em><\/strong> I am the warranty<\/p>\n\n<p><strong><em>Can you do Minor work on your own vehicle:<\/em><\/strong> Yes<\/p>\n\n<p><strong><em>Can you do Major work on your own vehicle:<\/em><\/strong> If I don&#39;t need a engine lift and it can be done over a weekend I&#39;m down for it.<\/p>\n\n<p><strong><em>Additional Notes:<\/em><\/strong> I can&#39;t seem to find literally any C5&#39;s near me that aren&#39;t 20K but I did find one that is $7500 near me but it has a rebuilt title from flood damage and some body work that I can easily do. How bad of a idea would it be to buy it since it has a rebuilt title and flood damage? If I did buy I would have somewhere do a prepurchase inspection on it<\/p>\n<\/div>","46":"<div class=\"md\"><p><strong>Location:<\/strong> Alberta<\/p>\n\n<p><strong>Price range:<\/strong> Up to $45k if new, up to $30k if used<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> Either, but under 100k km if used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Car, 4+ doors<\/p>\n\n<p><strong>Must haves:<\/strong> RWD, stick shift, nimble, lightweight<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Manual<\/p>\n\n<p><strong>Intended use:<\/strong> DD\/ Family car<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> ATS 2.0T, used 3 Series, used G37, R33-4 Skylines<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Anything that doesn&#39;t involve machining or welding, but I&#39;ll be real upset if I have to within the first 6 years of ownership<\/p>\n\n<p><strong>Additional Notes:<\/strong><\/p>\n\n<p>Looking for the most nimble RWD sedan\/wagon I can find in stick. Debating between coupe and sedan right now, since upcoming family, but I know what coupe I would get, so that&#39;s a non-issue. It&#39;s still snowing where I live, so I&#39;m intending on getting as much research done as possible while the roads are too shitty for a proper test drive. Don&#39;t really want another BMW unless they make a 4 door 2 series and I can get the 4 years of free maintenance, since they&#39;re fucking expensive to upkeep. The ATS is the lightest I&#39;ve found at 3300 lbs, so we&#39;ll see if it feels it when I can test drive it. Still looking for other suggestions.<\/p>\n<\/div>","47":"<div class=\"md\"><p>Location: USA Desert<\/p>\n\n<p>Price range: 30k<\/p>\n\n<p>New or used: new\/used<\/p>\n\n<p>Type of vehicle: Sedan \/ Hatchback \/ Crossover \/ SUV<\/p>\n\n<p>Must haves: Nice interior, quiet<\/p>\n\n<p>Desired transmission : Auto<\/p>\n\n<p>Intended use: Daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: Civic Touring Hatchback, &#39;18 Accord, Forester XT<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n<\/div>","48":"<div class=\"md\"><p>Location: USA-Northern Midwest<\/p>\n\n<p>Price range: 33k~ for new<\/p>\n\n<p>Lease or Buy: Open to both<\/p>\n\n<p>New or used: If leasing new, if buying most likely used.<\/p>\n\n<p>Type of vehicle: SUV<\/p>\n\n<p>Must haves: AWD\/Good winter driving, sunroof<\/p>\n\n<p>Desired transmission (auto\/manual, etc):Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Basically every Forester (I love how it looks) CR-V, CX-5, Crosstrek(did not like)<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Not sure, <\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Negative ghost rider.<\/p>\n\n<p>Additional Notes: I was planning on buying a 2019 Forester but was left feeling underwhelmed. I would REALLY REALLY like an electric SUV but there just don&#39;t seem to be any available right now.<\/p>\n\n<p>I&#39;m basically looking for a vehicle that can get me to 2021\/22 when I expect there to be way more viable and good Electric SUVs on the market if this means buying a car for 12-14k and reselling it that would be fine. If that means leasing for 3 years also fine, I have a ton of options available to me and would really appreciate people with better formed opinions giving me suggestions. Thanks.<\/p>\n\n<p>TLDR: I would like a good bridge vehicle for the next 3-4 years that maximizes my resell\/minimizes money lost while also being a SUV. <\/p>\n<\/div>","49":"<div class=\"md\"><p><strong>Location:<\/strong> Charlotte, NC<\/p>\n\n<p><strong>Price range:<\/strong> $50k<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Open to both options<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sports car, 2 door or 4 door, or even a hatchback<\/p>\n\n<p><strong>Must haves:<\/strong> Apple\/Android car play is probably my biggest requirement<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Doesn&#39;t matter<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Veloster N (not out yet), Mustang GT Premium (current top pick)<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, 1st car was a 2001 Golf, currently have a 2000 BMW 328ci<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Yes, but thanks to my current car (BMW e46) I don&#39;t want to spend any weekends wrenching, I&#39;m over it. <\/p>\n\n<p>Additional Notes: I&#39;m starting to shop for what will be my first new car. I was waiting for the veloster N, which is yet to be released but I just got a promotion with a substantial pay increase and I have a little more money to spend on a car. I don&#39;t have kids, I don&#39;t plan on having kids so I don&#39;t need any space. I really like the 2018 mustang GT premium simply because of the sound it makes and all the tech but I&#39;d like to look around some more. The only brand I don&#39;t want to get is a BMW. <\/p>\n<\/div>","50":"<div class=\"md\"><p><strong>Location:<\/strong> Great Lakes region<\/p>\n\n<p><strong>Price range:<\/strong> ~$35k or less is ideal, $45k maximum<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan<\/p>\n\n<p><strong>Must haves:<\/strong> Would like heated leather seats<\/p>\n\n<p><strong>Desired transmission:<\/strong> Auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Currently considering:<\/strong> <\/p>\n\n<p>Me: Buick LaCrosse or Regal, Acura TLX, Volvo S60, Jaguar XE. Also interested in Cadillac, Infiniti, and Lincoln but haven&#39;t looked much<\/p>\n\n<p>Wife: German entry level luxury car, Lexus ES, she also is interested in most cars I listed except for Buick and Volvo.<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> First as a married couple<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> I&#39;m thinking yes. Advice?<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Additional Notes:<\/strong> As I said above, this will be our first car we&#39;re buying as a married couple. I currently drive an &#39;06 corolla that&#39;s in great condition, but we have been wanting to buy a new vehicle for a while. My wife will drive my corolla, so it&#39;s not going to be traded in. My wife is just a bit more brand-conscious than I am, and really into the iconic luxury brands like BMW and Mercedes; although I&#39;ve made some headway in selling her on the 2018 LaCrosse. I&#39;m very impressed by the new Buicks, so the LaCrosse is currently my top choice. I would want the Essence package, as that is the lowest trim that comes with heated leather (appointed) seats. <\/p>\n\n<p>My biggest concern about the German cars is the cost of upkeep. I know very little about cars, so I wouldn&#39;t be able to do much maintenance myself. Am I justified in feeling this way, or would a LaCrosse be just as expensive to maintain? If I simply can&#39;t get my wife to agree on the LaCrosse, what car would be the best compromise between our tastes? Is there a standout vehicle among those I listed? Something I should be considering, but haven&#39;t? Any feedback is appreciated!<\/p>\n<\/div>","51":"<div class=\"md\"><p><strong>Location:<\/strong> Florida<\/p>\n\n<p><strong>Price range:<\/strong> 50k<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> Either<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sports car\/2 or 4-door\/no hatchback<\/p>\n\n<p><strong>Must haves:<\/strong> Leather seats, fast, sound<\/p>\n\n<p><strong>Desired transmission:<\/strong> Auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n<\/div>","52":"<div class=\"md\"><p><strong>Location:<\/strong> Lansing, Michigan. We will possibly drive out to Detroit for more options. <\/p>\n\n<p><strong>Price range:<\/strong> 20k-35k<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> We are expecting our first child so preferably a crossover. Actual SUV’s are a little large for me but if you have a great recommendation I would be open to it. <\/p>\n\n<p><strong>Must haves:<\/strong> Leather seats would be a bonus, probably AWD (or 4WD?) because of the snow. I really enjoyed the touch screen, heated seats, and remote start in my previous car that was recently totaled. <\/p>\n\n<p><strong>Desired transmission:<\/strong> Auto<\/p>\n\n<p><strong>Currently Considering:<\/strong> The new Ford Escape, Buick Encore, and Honda HRV. I’m not really sure what else is out there though. Also, I have a broken right foot from my car accident so I haven’t actually test driven any of these cars or looked into them much yet. I basically like them so far for exterior aesthetic reasons. They also seem to be pretty similar in cost but we are willing to spend a bit more if it is of a higher quality. <\/p>\n\n<p>Also, I had an extreme amount of problems with my past Chevy Cruze (that was only 3 years old) which was recently totaled so I am not interested in purchasing another Chevy. <\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver, first family car <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, 2008 Ford Escape, 2015 Chevy Cruze<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Edit\/Additional:<\/strong> Did some of my own research and I’m really leaning towards the HR-V. Opinions and recommendations, as well as the models of any similar vehicles, would be appreciated!<\/p>\n<\/div>","53":"<div class=\"md\"><p>Location: Wisconsin (MKE)<\/p>\n\n<p>Price range: $10,000-18,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Sedan, hatchback<\/p>\n\n<p>Must haves: Fuel efficient, trunk space<\/p>\n\n<p>Desired transmission: Manual<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda 3, Civic Hatchback<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Do you need a Warranty: Probably yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: Not as of now, I could probably try to learn<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: looking for a first car out of college, a reliable daily driver that has decent trunk space for moves\/camping. I know next to nothing about buying a car, I went to a dealership to test drive and was offered a new 2018 Civic Hatchback LX for $18,000, is this a good deal?<\/p>\n<\/div>","54":"<div class=\"md\"><p>Location: Texas<\/p>\n\n<p>Price range: $10-25k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports Car<\/p>\n\n<p>Must haves: <a href=\"https:\/\/imgur.com\/a\/Jq5sb\">Powwweeeer<\/a><\/p>\n\n<p>Desired transmission: Prefer Manual as it&#39;s all I&#39;ve ever had, however I&#39;ve heard new auto&#39;s are good too?<\/p>\n\n<p>Intended use: Daily\/Weekend<\/p>\n\n<p>Vehicles you&#39;ve already considered: Coyote Mustang, E46 M3<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Probably not<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Not currently skilled, however YouTube is a beautiful thing<\/p>\n\n<p>Additional Notes: I didn&#39;t want to not follow the rules, but I&#39;m in a very odd spot.  Sorry for the long explanation.<\/p>\n\n<p><strong>TL:DR<\/strong> at the top: Own 2 cars currently, neither really worth selling, neither perfect for what I want. Power and comfort + engine reliability.<\/p>\n\n<p>Have wife&#39;s old 2008 Matrix, super reliable, pretty boring. Have my &quot;old&quot; 2001 Mustang GT - blown a spark plug twice out the head due to a <a href=\"https:\/\/mustangforums.com\/forum\/4-6l-1996-2004-modular-mustang\/648053-what-year-had-spark-plug-blow-problem-the-most.html\">vulnerability<\/a> no one warned me about in this 4.6l engine when I first bought it.  Last time cost me 1.7k as they had to rebuild an entirely different head.<\/p>\n\n<p>Options I&#39;ve considered:<\/p>\n\n<p>Toyota Avalon (super boring I know) almost 300hp, not a slouch on the freeway, actually only 200lbs heavier than my current Mustang.<\/p>\n\n<p>2015+ Coyote - Fast, styling I love, power, but maybe not the highest build quality b\/c Ford.<\/p>\n\n<p>E46 M3 - Reliability? Not the best sound? However supposedly an awesome driver&#39;s car and fun\/fast and a lot less electrical issues than most BMW&#39;s.<\/p>\n\n<p>Coyote Swap - Just rip my engine out, sell it to help offset pumping up to a Coyote build in my current Mustang. Downsides are - older, transmission, no independent rear suspension. However mine is already lowered, on sport suspension, fat tires in the back, and it was my first big purchase I made for myself when I got my post college job.<\/p>\n\n<p>Are there obvious choices I&#39;m forgetting? I definitely lean towards &quot;toss you back&quot; power over Miata\/Toyota86 handling.  To each their own, not knocking either...  But I COULD have a &quot;project car&quot; in a build since I can daily the Matrix in the meantime (bought the wife another car last month).  My Mustang only has 80k miles on it right now, even though it&#39;s a 2001. I bought it in 2010 with a mere 5300 miles so I&#39;ve basically had it since &quot;new&quot;.<\/p>\n\n<p>I keep going back and forth in my mind - hoping someone might have a better idea \/ something I haven&#39;t thought of \/ help me solidify my thoughts. Thanks for reading!<\/p>\n\n<p>(Not going to be a big fan of used EVO\/STI, usually the used ones are worn out - have considered import JDM&#39;s but not sure those are quite available enough yet.)<\/p>\n<\/div>","55":"<div class=\"md\"><p>Location: Western Washington, USA<\/p>\n\n<p>Price range: $3,000 - $15,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Undecided<\/p>\n\n<p>Type of vehicle: Car, Sedan, Crossover<\/p>\n\n<p>Must haves: Fuel efficient, Smooth ride, some trunk space, reliable<\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Intended use: Daily Driver\/Commuter<\/p>\n\n<p>Vehicles you&#39;ve already considered: None seriously, looked at Toyota Camry, and some Kias.<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Preferably (the last car came with its fair share of burns)<\/p>\n\n<p>Can you do Minor work on your own vehicle: Some, but not all<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Looking to replace a commuter car that recently incurred a repair that we deemed not worth repairing. Warranty would be preferable because of issues with last vehicle. Reliability is KING. If we can get a RELIABLE car for a LOW COST and not expect to replace it soon, please let us know! We know 0 about cars, but need to have this done quickly.<\/p>\n\n<p>Thank you people of Reddit! :)<\/p>\n<\/div>","56":"<div class=\"md\"><p>Location: Berkeley<\/p>\n\n<p>Price range: $10-25k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Car, Sedan, Coupe or Hatchback<\/p>\n\n<p>Must haves: power, leather<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Genesis Coupe BK2, Mazda 3 hatchback, wrx<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: preferably<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes:<\/p>\n<\/div>","57":"<div class=\"md\"><p>Location: Texas<\/p>\n\n<p>Price range: $20K-$30K<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Preferably new <\/p>\n\n<p>Type of vehicle: Crossover\/smaller SUV<\/p>\n\n<p>Must haves: Reliable, high safety ratings, preferably leather seats or similar<\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda CX-5, VW Tiguan, Subaru Forester<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Preferably<\/p>\n\n<p>Can you do Minor work on your own vehicle: Some things but relatively inexperienced<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Thanks in advance, any advice is appreciated!<\/p>\n<\/div>","58":"<div class=\"md\"><p>Location: San Antonio, Texas. Willing to go to Austin\/ New Braunfels\/ San Marcos.<\/p>\n\n<p>Price range: $5k-13k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Sedan, Coupe, Hatchback<\/p>\n\n<p>Must haves: Reliability, fun to drive, decent mpg (27+), prefer newer\/ more features<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Never driven a manual but willing to learn for the right car.<\/p>\n\n<p>Intended use: Daily Driver, maybe some trips\/camping in the future so some room for cargo would be nice<\/p>\n\n<p>Vehicles you&#39;ve already considered: Ford Fiesta ST, Mazda 3, Ford Focus ST, Infiniti G35\/37, Nissan 350\/370z, Lexus IS250\/IS350, Hyundai Genesis Coupe<\/p>\n\n<p>Is this your 1st vehicle:No<\/p>\n\n<p>Do you need a Warranty:No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Never have but willing to learn to save money<\/p>\n\n<p>Can you do Major work on your own vehicle: Willing to learn to save money (I have no tools if they are necessary\/if it makes a difference)<\/p>\n\n<p>Additional Notes: I&#39;m looking to replace my 2008 Mazda 3 hatch that I bought around a year ago. It was a fun car but the repairs are stacking up and I&#39;m kind of looking to just get rid of it for something I don&#39;t have to worry about as much. I&#39;ve read a lot of great things about the Fiesta ST and would love to get one if I can find it in my price range. Overall, I would love to have a newer Lexus IS350 (with the updated body style), but it seems like it would take a miracle to find one in my price range. I do really like the Mazda 3 and I think if I could find a good (newer, with less miles and more features, and mechanically sound), then I would seriously consider that. But everything points to the Fiesta ST being the most fun car I can get in my range, while also being very fuel efficient, and I like the look a lot. Would love to get some second opinions though.<\/p>\n<\/div>","59":"<div class=\"md\"><p>Location: Minnesota, USA<\/p>\n\n<p>Price range: $20k-$30k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: SUV, Car, Crossover, Fast!!! <\/p>\n\n<p>Must haves: AWD or decent in snow. Moderately reliable and I don&#39;t wanna spend a crap ton on parts<\/p>\n\n<p>Desired transmission: matic<\/p>\n\n<p>Intended use: Daily (10k a year)<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2012 x5m, 2012 SRT8 Jeep, 2012-2015 SHO<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Depends on the car!<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Yes<\/p>\n\n<p>Additional Notes: I&#39;m 6&#39;5! I want something different then everyone else that I build with. We have S3&#39;s, S4&#39;s, Subies, Race trucks, M sedans, Infiniti G&#39;s, and all your other basic tuners...<\/p>\n<\/div>","60":"<div class=\"md\"><p>Location: Northeast USA<\/p>\n\n<p>Price range: Under $6,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Pickup, SUV, or larger crossover<\/p>\n\n<p>Must haves: Reliable with no major common issues, Decent MPG (not below 13-14), Ample cargo space<\/p>\n\n<p>Desired transmission: Auto but not opposed to manual<\/p>\n\n<p>Intended use: Daily Driver\/Winter car.<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2000-02 Toyota 4Runner, Older Jeep Cherokee\/Grand Cherokee<\/p>\n\n<p>Is this your 1st vehicle: Currently yes but with the intention of getting a weekend car soon.<\/p>\n\n<p>Do you need a Warranty: Nope<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Depends what it is but would lean towards no.<\/p>\n\n<p>Additional Notes: Looking for a winter car\/daily that will be practical enough to allow me to get a less practical fun weekend\/track car. That way I won’t have to worry about space\/putting too many miles on whatever fun car I get.<\/p>\n<\/div>","61":"<div class=\"md\"><p>Location: Boca Raton, Florida<\/p>\n\n<p>Price range: 20k to 90k<\/p>\n\n<p>Lease or Buy: Lease<\/p>\n\n<p>New or used: Both but would like to avoid depreciation. <\/p>\n\n<p>Type of vehicle: Luxury\/ Sports car<\/p>\n\n<p>Must haves: Fuel efficient, Navigation, Smooth ride, Leather, Audio and Luxurious look. <\/p>\n\n<p>Desired transmission auto<\/p>\n\n<p>Intended use: Daily Driver\/Weekend Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mercedes c250, c350, Audi R8, BMW I8<\/p>\n\n<p>Is this your 1st vehicle: Yes<\/p>\n\n<p>Do you need a Warranty:I don&#39;t know<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Yes<\/p>\n\n<p>Additional Notes: I&#39;m also under 20 so I&#39;ll be paying a lot for insurance. No, this isn&#39;t &quot;daddy&#39;s money&quot; thanks.<\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null},"comment_edited":{"0":false,"1":false,"2":false,"3":false,"4":1522074167.0,"5":false,"6":1522164475.0,"7":1522483333.0,"8":false,"9":1522068066.0,"10":1522081288.0,"11":1522088293.0,"12":1522090141.0,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":1522453165.0,"46":false,"47":false,"48":1522517895.0,"49":false,"50":1522533195.0,"51":false,"52":1522536813.0,"53":false,"54":false,"55":false,"56":false,"57":false,"58":1522625779.0,"59":false,"60":false,"61":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false},"comment_score":{"0":7,"1":5,"2":5,"3":5,"4":3,"5":3,"6":3,"7":3,"8":3,"9":2,"10":2,"11":2,"12":2,"13":2,"14":2,"15":2,"16":2,"17":2,"18":2,"19":2,"20":2,"21":2,"22":2,"23":2,"24":2,"25":3,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":-1,"61":-2},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false},"author_id":{"0":"kyavc2f","1":"","2":"byqfo","3":"fxggo","4":"coxwt","5":"dc56z","6":"5eb0s","7":"keyqu","8":"","9":"mu2ma","10":"5eb0s","11":"ltaaf9a","12":"pf7og","13":"7o948","14":"","15":"","16":"mybfh","17":"s0hri8b","18":"d1rtl","19":"vrffpyc","20":"","21":"alrjw","22":"143sr3","23":"oby0cy","24":"14efrudk","25":"13kdzp3j","26":"95mvn","27":"","28":"12vbtl","29":"rygdv","30":"16bbhj","31":"rygdv","32":"rxcbvf2","33":"4qdiukn","34":"j29yg","35":"13hqobzy","36":"bhpd2","37":"40l4z02","38":"","39":"zsrfe","40":"5zddi","41":"axghi","42":"rxcbvf2","43":"s0hri8b","44":"wrphh","45":"s30zq","46":"cy2w4","47":"nk0i0","48":"5gqq5","49":"7intv","50":"","51":"6l44t","52":"mzyoffu","53":"chwn2","54":"7pvng","55":"ka7dm","56":"6prp4","57":"1752xo","58":"81b7e","59":"z17yf7e","60":"irl7n","61":"12w0i3"},"author_name":{"0":"Smackarat","1":"","2":"CunniMingus","3":"MogwaiInjustice","4":"MathBender","5":"wakawakawomp","6":"BoldTitan","7":"IcyWolfosKelsos","8":"","9":"Sjotroll","10":"BoldTitan","11":"unitedcarnation","12":"ApocTheLegend","13":"ljackstar","14":"QuintiusCincinnatus","15":"tropics_","16":"thefireslayer43","17":"nightbird56","18":"ladayen","19":"PorcupineSpike","20":"","21":"redblockpowered","22":"bigg_mic","23":"Silentx_xNinja","24":"MysteriousEffect6","25":"Marax4","26":"liddok3vin","27":"","28":"duckbear-","29":"Just__A__Commenter","30":"incognixo","31":"Just__A__Commenter","32":"moistchipz","33":"ObsessiveIndecisive","34":"JustAnotherINFTP","35":"Fetty-Guac","36":"moldybees","37":"ewasf77","38":"","39":"drpantalones","40":"Jaytriple","41":"synchronoze","42":"moistchipz","43":"nightbird56","44":"mpersonally","45":"vagabond139","46":"ArguablyTasty","47":"precense_","48":"defiantleek","49":"Reaps21","50":"","51":"Shudderbird","52":"canda5","53":"Skittea","54":"Rodic87","55":"wey2radical","56":"qlible","57":"Coys8","58":"Zubluya","59":"mattspx","60":"The_Real_Billy_Walsh","61":"supertrilll"}}