{"comment_id":{"0":"e4x3mbw","1":"e4xpas8","2":"e4ysy7z","3":"e4x0rdt","4":"e4x1c9o","5":"e4xaj7r","6":"e4xheun","7":"e4xiscy","8":"e4xjyyq","9":"e4xp9gn","10":"e4z63v4","11":"e4z7y76","12":"e4z9el5","13":"e4zazn7","14":"e4zem3c","15":"e4zh5so","16":"e4ztoku","17":"e50z4sa","18":"e518gd0","19":"e5176eh","20":"e4ww6m1","21":"e4x24mx","22":"e4xdwko","23":"e4xjv5r","24":"e4xovn8","25":"e4ybh2h","26":"e4yx4un","27":"e4zdfpa","28":"e4zga9x","29":"e4zz7xi","30":"e5039bh","31":"e506ojt","32":"e50ow9o","33":"e5191bs","34":"e51b0vh","35":"e51e17d","36":"e51laaq","37":"e51xfys","38":"e528z01","39":"e529vtq","40":"e52oav7","41":"e52srso","42":"e52wmvp","43":"e52xtai","44":"e532uwb","45":"e53x6zm","46":"e54d2by","47":"e54o0mw","48":"e50agzh"},"comment_parent_id":{"0":"t3_9ao1q6","1":"t3_9ao1q6","2":"t3_9ao1q6","3":"t3_9ao1q6","4":"t3_9ao1q6","5":"t3_9ao1q6","6":"t3_9ao1q6","7":"t3_9ao1q6","8":"t3_9ao1q6","9":"t3_9ao1q6","10":"t3_9ao1q6","11":"t3_9ao1q6","12":"t3_9ao1q6","13":"t3_9ao1q6","14":"t3_9ao1q6","15":"t3_9ao1q6","16":"t3_9ao1q6","17":"t3_9ao1q6","18":"t3_9ao1q6","19":"t3_9ao1q6","20":"t3_9ao1q6","21":"t3_9ao1q6","22":"t3_9ao1q6","23":"t3_9ao1q6","24":"t3_9ao1q6","25":"t3_9ao1q6","26":"t3_9ao1q6","27":"t3_9ao1q6","28":"t3_9ao1q6","29":"t3_9ao1q6","30":"t3_9ao1q6","31":"t3_9ao1q6","32":"t3_9ao1q6","33":"t3_9ao1q6","34":"t3_9ao1q6","35":"t3_9ao1q6","36":"t3_9ao1q6","37":"t3_9ao1q6","38":"t3_9ao1q6","39":"t3_9ao1q6","40":"t3_9ao1q6","41":"t3_9ao1q6","42":"t3_9ao1q6","43":"t3_9ao1q6","44":"t3_9ao1q6","45":"t3_9ao1q6","46":"t3_9ao1q6","47":"t3_9ao1q6","48":"t3_9ao1q6"},"comment_created_utc":{"0":1535382049.0,"1":1535400917.0,"2":1535450758.0,"3":1535379327.0,"4":1535379895.0,"5":1535388221.0,"6":1535394135.0,"7":1535395419.0,"8":1535396469.0,"9":1535400887.0,"10":1535467390.0,"11":1535469034.0,"12":1535470315.0,"13":1535471683.0,"14":1535474764.0,"15":1535476951.0,"16":1535487482.0,"17":1535536610.0,"18":1535549669.0,"19":1535548369.0,"20":1535374398.0,"21":1535380661.0,"22":1535391146.0,"23":1535396378.0,"24":1535400580.0,"25":1535422482.0,"26":1535457880.0,"27":1535473777.0,"28":1535476179.0,"29":1535492219.0,"30":1535495927.0,"31":1535499122.0,"32":1535517697.0,"33":1535550236.0,"34":1535552109.0,"35":1535554724.0,"36":1535560796.0,"37":1535570758.0,"38":1535580374.0,"39":1535581208.0,"40":1535595340.0,"41":1535600108.0,"42":1535605009.0,"43":1535606755.0,"44":1535616087.0,"45":1535651118.0,"46":1535665189.0,"47":1535676959.0,"48":1535502832.0},"comment_body":{"0":"<div class=\"md\"><p><strong>Location:<\/strong> currently PA<\/p>\n\n<p><strong>Price range:<\/strong> $20-40,000<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> New<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Four door car<\/p>\n\n<p><strong>Must haves:<\/strong> Reliable, ability to handle winter weather (with hills), decent gas mileage, fabric that can handle a dog, a trunk type area that is either enclosed or easily covered (I want a space I can leave crap, and not have to worry about people seeing it)<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Prefer manual, but would go for the right automatic<\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver, with perhaps some longer trips<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Friends tried to convince me this weekend to get a WRX STI (gas mileage too low), Jetta GLI, or Golf GTI<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Super minor, like check my fluids, replace bulbs and wipers. I can&#39;t do much of anything else right now, but would consider learning once we live somewhere with our own driveway.<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No.<\/p>\n\n<p><strong>Additional Notes:<\/strong> I currently drive a 2001 Civic. It still gets in the range of 33-35 mpg, but a lot of stuff is starting to break and I might need a new vehicle sooner rather than later (it&#39;s currently sitting at the mechanics with an engine light and leaking coolant, and who knows what else). Anything I buy will of course have better tech and safety than what I&#39;m used to now. Our other vehicle is a manual Subaru Forester. We currently live in central PA, but my husband&#39;s job could take us just about anywhere in the continental US next. Husband is trying to convince me to get something &quot;fun&quot; with some zip to it. I want to be mindful to get something that doesn&#39;t have <em>too<\/em> much power, as we live in an area with regular highway coverage by state troopers. I looked at the stats for a WRX STI, but between the low gas mileage and need for premium, it&#39;s definitely out. I&#39;ve started looking into the VW GLI and GTI. We do have a VW dealership in town, so I may go test drive them soon. If Hondas still maintain their reliability, I&#39;d definitely consider another one. I&#39;ve loved my Civic.<\/p>\n<\/div>","1":"<div class=\"md\"><ul>\n<li><p>location: UK (south west)<\/p><\/li>\n<li><p>price range: £0-£1500<\/p><\/li>\n<li><p>lease or buy: buy<\/p><\/li>\n<li><p>new or used: used<\/p><\/li>\n<li><p>type of vehicle: any. Mostly looking at sports cars and warm hatches.<\/p><\/li>\n<li><p>must haves: must be interesting. 1.8+ litres. Weatherproof roof. Mot.<\/p><\/li>\n<li><p>desired transmission: manual<\/p><\/li>\n<li><p>intended use: daily driver<\/p><\/li>\n<li><p>vehicles already considered: Fiat Punto HGT, Citroen C2 VTS, Alfa Romeo 147, Alfa Romeo GT\/GTV, MGF, Mazda MX-5, Toyota MR2, Jaguar s-type, jaguar xj8, BMW z3, Mazda rx8, Alfa Romeo 156, BMW 330i<\/p><\/li>\n<li><p>Is this your first vehicle? No it will be the third vehicle I have owned and will replace one of my two current vehicles. Therefore it doesn&#39;t need to be completely 100% reliable, but I don&#39;t want it to distract from my actual project car. <\/p><\/li>\n<li><p>do you need a warranty: no<\/p><\/li>\n<li><p>can you do minor work on your own vehicle: yes.<\/p><\/li>\n<li><p>can you do major work on your own vehicle: yes.<\/p><\/li>\n<\/ul>\n\n<p>Additional notes: I own an xj8, that is actually quite reliable but I don&#39;t quite trust to get me to work. This would therefore be my daily. I would like it to be interesting. My commute is mostly country back roads. I feel a small sports car or a hot hatch would round out my stable quite nicely. I don&#39;t really like VAG products, I also don&#39;t really like mx5s but I feel I should at least give one a test drive! <\/p>\n\n<p>One day I would like to own a front engined, rear wheel drive, manual, straight 6, naturally aspirated, 2 seater, sports car. Some of the cars I have considered fall under that plan. For example I could get an rx8 and hope to keep it running stock for a year, and then when the rotary inevitably goes drop a BMW N54 in there. Or I could buy a BMW 330i (I haven&#39;t actually checked prices for them) and use the engine and gearbox in something later down the road. <\/p>\n\n<p>On the other hand I already have experience and tools for working on modernish jags, so maybe an s-type with a 3.2 ajv8 would make the best use of that. <\/p>\n\n<p>I test drove an mgf yesterday, and actually I didn&#39;t like it very much, but I am hoping it was just a bad example, since an mgf was pretty much the front runner up until then. <\/p>\n\n<p>I am also considering expanding my stable to 3 cars. Buying a cheap warm hatch as a daily and an almost project-y roadster. Therefore having three cars, all of which can be interesting and unreliable :P. However realistically that will probably just result in me having two projects on the go and not making the progress I would like on either. <\/p>\n\n<p>I also have a bit of a kink for lowered minitrucks with 6 cylinder diesels :P. <\/p>\n\n<p>Sorry for the essay! <\/p>\n\n<p>Cheers!<\/p>\n<\/div>","2":"<div class=\"md\"><ul>\n<li>location: NY, USA<\/li>\n<li>price range: 1.5k-10k<\/li>\n<li>lease or buy: buy<\/li>\n<li>new or used: used<\/li>\n<li>type of vehicle: No preference<\/li>\n<li>must haves: Torque, push you back into your seat when accelerating<\/li>\n<li>desired transmission: auto or manual<\/li>\n<li>intended use: daily driver<\/li>\n<li>vehicles already considered: Jaguar XJR, Pontiac Grand Prix GTP, Chevy Cobalt SS Supercharged, Chevy Impala SS (V6 SC variant)<\/li>\n<li>Is this your first vehicle? No, I have a family sedan as backup just in case. I don&#39;t mind fixing the car when it needs fixing but I would rather it be on the road more than the shop.<\/li>\n<li>do you need a warranty: no<\/li>\n<li>can you do minor work on your own vehicle: yes.<\/li>\n<li>can you do major work on your own vehicle: yes.<\/li>\n<li>Additional Notes: As you can see I picked cars with Superchargers b\/c they produce a lot of torque. I currently have a 2002 Nissan Sentra SE-R Spec V .For a 4 cylinder it produces more torque than HP and I love that. I would like to replace it with a car that really pushes you down into your seat when accelerating.<\/li>\n<\/ul>\n<\/div>","3":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","4":"<div class=\"md\"><p>Are any of the German wagons reliable? And by reliable I mean the chance of a major electrical or mechanical issue before ~125k miles is low.<\/p>\n\n<p>I really want a sporty wagon but my options are limited unless I want to go used.<\/p>\n<\/div>","5":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> Philadelphia, PA  <\/p>\n\n<p><strong>Price range:<\/strong> 4000-8000k USD  <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy  <\/p>\n\n<p><strong>New or used:<\/strong> Used  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Crossover, wagon, small SUV, maybe another hatch  <\/p>\n\n<p><strong>Must haves:<\/strong> Decent cargo space for hauling hockey equipment. Decent reliability.   <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Automatic  <\/p>\n\n<p><strong>Intended use:<\/strong> Used maybe 1-2 times per week. I recently switched from having to commute from Philadelphia to the suburbs for about an hour each way in traffic and now work in center city. I will not need a car to get to work, but will need one to go to hockey practice weekly, make trips to see my family, grocery trips, etc.   <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Subaru Forrester, Subaru Outback, Honda CRV  <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No  <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> This will be my first used car - I will take advice from those who have been in similar situations  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No, but am friends with a mechanic  <\/p>\n\n<p><strong>Additional Notes:<\/strong> In May of 2017 I bought a new Golf GTI Sport for my situation. I previously had a TDI which was a part of the emissions scandal, so when I got the settlement from them (about 18k) I used it as a down payment for the GTI. Thankfully VW was also able to work with me for the new car, which I got an incredible deal on for the time (I believe I paid about 23.5k for it - they matched the lowest price I could find in the entire Mid-Atlantic area). I needed a new car at the time based on how much I was driving, but after getting a great new position for a company I see myself at for a long time in center city, I barely use the thing, and the less I use it the more worried I become of people dinging it in the city. Paying full insurance and a car payment each month comes to about $310. I would like to do the following: Sell\/trade my car (getting offers of about 18k for it), buy a used car for between 4-8k that can drive well in winter and has decent cargo space, and pocket the cash that is left over to have funds for repairs and pay down some student loan debt. I currently owe about 6.8k on the car, so going off of the 18k that is being offered, it will net about 11.2k remaining. I have mostly considering &#39;07-&#39;10 Foresters, but would like to see what others are thinking. I would also be dropping down just having liability on the car, so I would save more money for purchasing a home by not having a car payment any more and also paying less in insurance. Thanks in advance for the help!<\/p>\n<\/blockquote>\n<\/div>","6":"<div class=\"md\"><p><strong>Location:<\/strong> Ontario, Canada<br\/>\n<strong>Price range:<\/strong> $0 - $45,000 CAD<br\/>\n<strong>Lease or Buy:<\/strong> Buy \/ Finance<br\/>\n<strong>New or used:<\/strong> New AND Used (3 years old sweet-spot)<br\/>\n<strong>Type of vehicle:<\/strong> 4-Door Sedan, 2-Door Coupe<br\/>\n<strong>Must haves:<\/strong> Infotainment System, Backseat Bench\/Seats, Quiet (I don&#39;t like the road noises) at speeds 0 - 130 KM\/Hr<br\/>\n<strong>Desired transmission (auto\/manual, etc):<\/strong> Automatic<br\/>\n<strong>Intended use:<\/strong> Daily Driver<br\/>\n<strong>Vehicles you&#39;ve already considered:<\/strong>  Chevrolet Cruze, Toyota Corrolla, Kia Forte, Hyundai Elantra, Audi S3,  Acura ILX, Acura TLX SH-AWD, BMW 330i \/ 430i, Lexus IS250 \/ IS300,  Infiniti Q50 \/ Q60.<br\/>\n<strong>Is this your 1st vehicle:<\/strong> 5th Vehicle<br\/>\n<strong>Do you need a Warranty:<\/strong>  Standard Manufacturer Warranty, or will be buying Used Car Warranty, I  don&#39;t include Warranty in my $45,000 budget. Additional warranty can be  up to $6000.<br\/>\n<strong>Can you do Minor work on your own vehicle:<\/strong> Maybe? Detail (buff, wax, wash, vaccuum), change windshield fluid, add coolant.<br\/>\n<strong>Can you do Major work on your own vehicle:<\/strong> No.<br\/>\n<strong>Additional Notes:<\/strong><br\/>\n<strong>Summary:  Need a car which is fairly reliable (survive 3 years outdoors), quiet,  looks decent, and has decent value. Anyone who drives the cars listed,  I&#39;d like to hear your input and experience.<\/strong><br\/>\nI  drive a lot. It&#39;s not uncommon for me to put 300 - 400 km on my car  every week. My driving is 50\/50 city\/highway driving. The cars I&#39;ve  owned are 2006 Suzuki Swift+, 2014 Toyota Corolla, 2013 Audi A4 Premium  Plus Quattro, 2018 Mazda 3 Sport Hatchback. I don&#39;t know if I have  unrealistic expectations, but I know I&#39;m not fussy about the equipment.<br\/>\n1  - Standard equipment (infotainment system, power windows\/locks,  bluetooth, backup camera, AC, heating) is everything I need. I don&#39;t  care for electric seat adjustment, heated seats, 2-zone climate control,  heads up display, leather, extra stitching, etc. I just want to drive  the car in AC while listening to music.<br\/>\n2  - The cabin car must be quiet under 130 km\/hr. Noise isolation is the  most important thing to me when I consider driving for long periods of  time. Whether it&#39;s the engine noise or road noise, quiet please. I&#39;m not  too fussy about suspension, softer is nicer but I understand that sport  cars are stiff and I can live with that.<br\/>\n3  - The car should have sufficient power to make quick maneuvers when  merging onto the freeway. Highway 401 in Ontario can get frisky when not  in traffic. I&#39;d like the car to be nimble in start\/stop situations and  when merging into the fast lane. I don&#39;t care for having the most horse  power, or the highest top speed.<br\/>\n4 -  Value. If the car is a budget car (under 25,000) then I&#39;m open to  keeping it longer. If the car is considered and &quot;luxury&quot; car, then I&#39;d  like to sell it after 3 years.<br\/>\n5 -  Reliability and build quality. I&#39;ve been reassigned to the Ottawa  Valley. There&#39;s 40 cm snowfall, and the roads are heavily salted. I  don&#39;t have access to an in-door garage. I&#39;m stuck in this situation for 3  more years, 2021. I will not be considering a truck.<br\/>\n6 - I want a good looking car for my own vanity. There&#39;s no one to impress out here, so I don&#39;t mind driving a budget car.<br\/>\n7  -   I am considering a coupe (first time) because I drive on my own. On  some occasion (30-50 times a year) I will drive 2-3 friends. Once a  year I&#39;ll put something large in my car (desk chair, ikea desk). I am  willing to pay for delivery for these things.<br\/>\n8  - I like the idea of a budget car if it&#39;s everything but powerful. The  problem with the budget cars is that they might not last in the harsh  winters, and are usually quite loud. My 2018 Mazda 3 sounds quite loud  when I get to 2500 RPM, and still doesn&#39;t get up to speed in what I&#39;d  consider quickly. The 2013 Audi A4 cruises well at 100-130 km\/hr sitting  at 2000-2200 RPM. It&#39;s quite quiet and has enough power 211 HP to do  what I want, but the car itself was expensive for what I received.  Anemic power compared to other similarly priced luxury German vehicles,  not as prestigious or luxurious (plastic wood panels), considering it  was a top trim, top spec, top everything model, I felt that it wasn&#39;t  worth. The 2014 Corolla was a treat to drive except that it was grossly  under powered. Well equipped, well styled, reliable, cheap to maintain. I  don&#39;t want to drive this car again because I&#39;d like to experience other  brands.<br\/>\n9 - I understand that the coupes  listed are basically the same as their sedan counterparts  (mechanically). I see on the used market, that they are relatively close  in price compared to their markup when new. If I&#39;m getting the same  driver experience from these coupes, I&#39;d rather just take the sedan.<br\/>\nThanks for the help.<\/p>\n<\/div>","7":"<div class=\"md\"><p>Location: Baltimore<\/p>\n\n<p>Price range: &lt;$25,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan or hatchback<\/p>\n\n<p>Must haves: My biggest items so far is reliability and gas mileage. My commute involves driving in Baltimore city, which has some poor roads, so I’d like my new car to be able to handle small potholes\/bumps daily and have a comfortable ride. Gas mileage is also important to me mainly because my current car is a 15 year old Jeep, so it’s not getting great MPG. My daily commute total is about 25 miles, with half being city driving and half being highway speeds.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Automatic<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Volvo S60, Honda Civic, Honda Accord<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: I don’t know<\/p>\n\n<p>Can you do Minor work on your own vehicle: If I can reach it and I won’t injure myself, I’ll try it. I’m living the apartment life, so major work isn’t viable. I’m going to be committed to proper maintenance schedule for my new car.<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: I like the look of the European cars. As I’ve been looking at cars, it seems that lots of other manufacturers are going for a angular\/pointy look, which I don’t like. I really do like the look of the S60 and I’ve seen the Cross Country model. It offers a little more height off the ground and is AWD. I just read a lot about how maintenance for Euro cars can be pricey it seems.<\/p>\n\n<p>Thanks for any help. I’ve been really indecisive lol.<\/p>\n<\/div>","8":"<div class=\"md\"><p><strong>Location:<\/strong> Pacific Northwest<\/p>\n\n<p><strong>Price range:<\/strong> $0-$40k<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Either<\/p>\n\n<p><strong>New or used:<\/strong> Either (Up to ~3 years old. I like my tech)<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Car<\/p>\n\n<p><strong>Must haves:<\/strong> Nothing specific<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Civic Coupe Touring, Kia Stinger, Tesla 3, lower end BMWs and Audis<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Would be nice<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> some<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> no<\/p>\n\n<p><strong>Additional Notes:<\/strong><\/p>\n\n<p>Looking for a solid balance of tech package (infotainment, driver assist if possible, especially follow cruise control), comfort (prefer sport cloth), and responsiveness. It doesn&#39;t need to be an outright sports car, but snappy acceleration is a plus.<\/p>\n<\/div>","9":"<div class=\"md\"><p>Location: Latvia<\/p>\n\n<p>Price range: Around 3k Euros\nLease or Buy:<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sporty \nMust haves: Fuel efficient,\nDesired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily Driver\nVehicles you&#39;ve already considered: MK2 MX5, 03 Type R, Celica GTS<\/p>\n\n<p>Is this your 1st vehicle: Kinda my first was a 96 Corolla and this is second<\/p>\n\n<p>Do you need a Warranty: Nope<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Maybe<\/p>\n<\/div>","10":"<div class=\"md\"><p><strong>Location:<\/strong> Utah, USA<\/p>\n\n<p><strong>Price range:<\/strong> $5000-$6000<\/p>\n\n<p><strong>Lease or Buy:<\/strong> buy<\/p>\n\n<p><strong>New or used:<\/strong> used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan<\/p>\n\n<p><strong>Must haves:<\/strong> comfy ride<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> automatic<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> don&#39;t know what to consider (see additional notes)<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> no<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> no<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> nope<\/p>\n\n<p><strong>Additional Notes:<\/strong> Over the past 25 years (or so) I&#39;ve had 3 Buick LeSabres. Bought &#39;em all used and drove the heck out of them. I love that they seem to run great for a long time (3800 V6?) and that they&#39;re like driving a couch. They seem like a hidden gem in the car world (in that nobody is really into these cars).<\/p>\n\n<p>I see that they aren&#39;t making that engine anymore, but it looks like I can go with a 2008 Lucerne to stay with that engine. I&#39;m wondering if you folks have any different suggestions for a &quot;hidden gem&quot; like the LeSabre.<\/p>\n<\/div>","11":"<div class=\"md\"><p>I found a new job but the only way to get up there is this twisty mountain road. A small car is more than enough to get the job done and my FIAT Panda is doing alright, but since I&#39;ll be out all day I need to buy a new car because the Panda is the car that we use in my family. I&#39;m looking for something 20+ years old (because in Italy those are considered vintage and thus they&#39;re a lot cheaper when it comes to insurance and taxes) with a good fuel economy, possibly a hatchback because there are some very very narrow spaces to park where I live and where I work now. The only car that ticks all the boxes <em>and<\/em> is rwd is the E36 Compact 318 tds. So I&#39;d like to start a discussion about this car, do you have any experience with the car or with the engine?<\/p>\n\n<p>Thanks<\/p>\n<\/div>","12":"<div class=\"md\"><p>Why are Jags so underpowered\/ overpriced? Are you just paying for the badge? Is the level of luxury really that much higher than a BMW or Audi?<\/p>\n<\/div>","13":"<div class=\"md\"><ul>\n<li>Southern California<\/li>\n<li>$12,000=$16,000<\/li>\n<li>Buy<\/li>\n<li>Used<\/li>\n<li>Car\/Sedan\/Crossover<\/li>\n<li>Reasonably fuel efficient<\/li>\n<li>Auto Transmission<\/li>\n<li>Daily Driver<\/li>\n<li>Not 1st vehicle<\/li>\n<li>Don&#39;t need warranty<\/li>\n<li>Won&#39;t be working on own vehicle<\/li>\n<li>So far considering 2016 Honda Civic or 2015-2016 Toyota Camry or 2016 Mazda CX-5, but not sure about anything yet<\/li>\n<\/ul>\n<\/div>","14":"<div class=\"md\"><p>• Location: USA\n • Price range: Around 15-20k\n • Lease or Buy: buy ideally \n • New or used: used\n • Type of vehicle: Truck\n • Must haves: good towing capacity, doesn’t have to be 4x4 but would be a plus\n • Desired transmission: auto\n • Intended use: Tow vehicle for track car\n • Vehicles you&#39;ve already considered: ford Super duty, ford explorer, Ford Expedition \n • Is this your 1st vehicle: no\n • Do you need a Warranty: no\n • Can you do Minor work on your own vehicle: yes\n • Can you do Major work on your own vehicle: yes\n • Additional Notes: looking for something with a comfortable towing capacity of around 7,000 lbs. i have a daily driver currently so this truck would not be driven much except for when towing an open trailer with a mustang on it. Ive considered 6.0 diesel super dutys and thats what I’m currently looking at. Open to suggestions. <\/p>\n<\/div>","15":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","16":"<div class=\"md\"><p>Location: Los Angeles, CA, USA<\/p>\n\n<p>Price range: Up to ~200k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Exotic Car<\/p>\n\n<p>Must haves: Fun and not too harsh to drive<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Either<\/p>\n\n<p>Intended use: Weekend Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Gen 2 Gallardo, Huracan, 570s\/gt, Viper ACR(too harsh), 458 Italia, Lexus LC500, AMG-GTR, *GT3-RS<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Won&#39;t on this car<\/p>\n\n<p>Can you do Major work on your own vehicle: Won&#39;t on this car<\/p>\n\n<p>Additional Notes: Not going to buy an i8. My head says that buying a Huracan is worth the extra money over the Gallardo. Probably my first choice as of right now. What else might I have skipped over or not thought about? Thanks!<\/p>\n<\/div>","17":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> Australia - NSW  <\/p>\n\n<p><strong>Price range:<\/strong> 9000 AUD  <\/p>\n\n<p><strong>Lease or Buy: Buy<\/strong>  <\/p>\n\n<p><strong>New or used: used<\/strong>  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sports\/Sedan\/coupe\/convertible  <\/p>\n\n<p><strong>Must haves:<\/strong> v6 or smaller, no turbo, must be less then 130kw\/ton (australian p-plate laws), under 150,000km  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc): Either, ive only ever driven auto, if i do my p plate test on auto than i can only drive auto until i get my fuel lisence<\/strong>  <\/p>\n\n<p><strong>Intended use:<\/strong> daily driver (first car)  <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:  NB mx5, impreza, civic, other first cars<\/strong>  <\/p>\n\n<p><strong>Is this your 1st vehicle: yes<\/strong>  <\/p>\n\n<p><strong>Do you need a Warranty: yes<\/strong>  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> no but willing to learn  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> no <\/p>\n<\/blockquote>\n<\/div>","18":"<div class=\"md\"><p>Please help me find a convertible to have fun with on the weekends and on trips to the beach. That or convince me not to get one . <\/p>\n\n<p>Location: Orlando<\/p>\n\n<p>Price: &gt;$5k preferred but can move this up to 7k for the right car <\/p>\n\n<p>Lease or buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type: Convertible <\/p>\n\n<p>Transmission: Automatic because I am too stupid to learn manual<\/p>\n\n<p>Use: Weekend car<\/p>\n\n<p>Cars considered: Miata, BMW 3 series, Audi A4, and BMW z3\/4<\/p>\n\n<p>I can do very minor work but no major work <\/p>\n<\/div>","19":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","20":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","21":"<div class=\"md\"><p>Location: Midwest, USA<\/p>\n\n<p>Price range: Ideally less $10k but max budget is about $15k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Car, coupe or sedan<\/p>\n\n<p>Must haves: Just something with no issues, fun, decently fast, AWD or FF.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily Fun Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Focus ST, Fiesta ST, Subaru WRX, <\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No but wouldn&#39;t mind one<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Yes but don&#39;t want to<\/p>\n\n<p>Additional Notes: <\/p>\n\n<p>I currently drive an RSX Type S. But I have ran into the issue where I cannot realistically put the car down to do maintenance\/install parts\/mod it on a Friday and then try to get it all back together by Monday morning for work. It&#39;s showing it&#39;s age (16 years old) so I am stuck trying to fix door lock actuators, replacing old and worn parts, etc. For a while, I wanted a really cheap beater (like $1500) so that I could garage my RSX and really work on it some more but my wife was not having it.<\/p>\n\n<p>So I decided to start looking at newer cars with less problems and more enjoyment. I was thinking something 2013 and newer. Max budget of $15k. New or used. I&#39;m a big Honda guy but nothing 2013 or newer, under $15k, really fits the bill. I like the Fiesta and Focus but really do not like the interior. The WRX seems great, I like the styling of the 15-16, but the WRX might not be my thing, coming from Hondas and all.<\/p>\n\n<p>My biggest worry is rust. Hondas are prone to rusting. I have really only experience with older Hondas. I want something I can drive in the winter and not become rusted within 5 years. <\/p>\n<\/div>","22":"<div class=\"md\"><p><strong>Location:<\/strong> Europe, Belgium<\/p>\n\n<p><strong>Price range:<\/strong> 40000<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Lease<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> Yes<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Mercedes C class 180d vs 200d<\/p>\n\n<p><strong>Additional Notes:<\/strong><\/p>\n\n<p>So I already know which car I will choose but I don&#39;t know which one I should choose.<\/p>\n\n<p>I can choose the c180 d Business Solution with some extra options (Artico Leather, Digital Heads-up display, Smart-phone Integration), 122 HP.<\/p>\n\n<p>Or<\/p>\n\n<p>I can choose the c200 d Business solution without the options above but with 150 HP.<\/p>\n\n<p>As this is my first car I am uncertain whether I should choose for a car with options that I like or I should choose a car with a higher performance engine.<\/p>\n<\/div>","23":"<div class=\"md\"><p><strong>Location:<\/strong> Pittsbrugh, PA (USA)<br\/>\n<strong>Price range:<\/strong> &lt;$25,000 USD<br\/>\n<strong>Lease or Buy:<\/strong> Either<br\/>\n<strong>New or used:<\/strong> Either, but at least within the last 5 or so years.<br\/>\n<strong>Type of vehicle:<\/strong> I&#39;m up for anything... I&#39;ve only ever owned coupes and roadsters<br\/>\n<strong>Must haves:<\/strong> Dynamic steering\/handling, quick acceleration, daily driving comfort<br\/>\n<strong>Desired transmission (auto\/manual, etc):<\/strong> Doesn&#39;t matter<br\/>\n<strong>Intended use:<\/strong> Daily Driver<br\/>\n<strong>Vehicles you&#39;ve already considered:<\/strong> Civic Si, Veloster Turbo, Soul Turbo<br\/>\n<strong>Is this your 1st vehicle:<\/strong> 15th Vehicle<br\/>\n<strong>Do you need a Warranty:<\/strong> I don&#39;t, but it&#39;d be nice...<br\/>\n<strong>Can you do Minor work on your own vehicle:<\/strong> Very minor. New cars are confusing to me :(<br\/>\n<strong>Can you do Major work on your own vehicle:<\/strong> No.<br\/>\n<strong>Additional Notes:<\/strong><br\/>\nI&#39;d like something with pep—sporty, but it doesn&#39;t need to be a rocket. I want it to be fun enough to keep me engaged, but comfortable enough that the Pittsburgh potholes don&#39;t annihilate my spine. <\/p>\n<\/div>","24":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> Florida (moving to CA in a few weeks)  <\/p>\n\n<p><strong>Price range:<\/strong> $0-$40K   <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy  <\/p>\n\n<p><strong>New or used:<\/strong> Either but pref new for the tech (really want adaptive cruise control)  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Hatchback, wagon, small SUV  <\/p>\n\n<p><strong>Must haves:<\/strong> Fun to drive, comfy interior, daily driver, would love adaptive cruise control  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> auto  <\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver   <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Golf GTI, Veloster Turbo, GLA SUV  <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No  <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Can do fluids, oil changes, etc.   <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No  <\/p>\n\n<p><strong>Additional Notes:<\/strong> This is the first time I&#39;ve been willing to spend a significant amount of money on a car and I&#39;m terrified of buyer&#39;s remorse. I liked the GTI a lot when I drove it, but hate the plaid seats. Going with the Autobahn model gets me leather and adaptive cruise control, but takes the price way up. I&#39;m wondering if there&#39;s a better option at that price (~$37K sticker). <\/p>\n<\/blockquote>\n<\/div>","25":"<div class=\"md\"><p>Anyone have any thoughts on a 2012 Toyota RAV4 4x4 Limited V6? About 55,000 Miles, price about $16,000. Anyone own one of these have any good or bad things about it?<\/p>\n<\/div>","26":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> US Midwest(MN,WI,ND,SD)  <\/p>\n\n<p><strong>Price range:<\/strong> $10,000-$18,000  <\/p>\n\n<p><strong>Lease or Buy: Buy<\/strong>  <\/p>\n\n<p><strong>New or used:  Used<\/strong>  <\/p>\n\n<p><strong>Type of vehicle:<\/strong>Crossover SUV  <\/p>\n\n<p><strong>Must haves:<\/strong> Fuel Efficient, All wheel drive, at least 2,000 lb towing capacity, leather seats.  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):  Automatic<\/strong>  <\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver   <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered: Mazda CX-5, Ford Edge, Hyundai Sonata, Honda CR-V<\/strong>  <\/p>\n\n<p><strong>Is this your 1st vehicle: No<\/strong>  <\/p>\n\n<p><strong>Do you need a Warranty: No<\/strong>  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No  <\/p>\n\n<p><strong>Additional Notes: I have done a decent amount of research and am looking for a car with decent room. I have only owned Honda vehicles so seeing if there are others out there that can handle the test of time.<\/strong><\/p>\n<\/blockquote>\n<\/div>","27":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","28":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> Southern California  <\/p>\n\n<p><strong>Price range:<\/strong> 20k-45k  <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Either  <\/p>\n\n<p><strong>New or used:<\/strong> Likely New  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan  <\/p>\n\n<p><strong>Must haves:<\/strong> Leather Seats, Safety conveniences(Lane departure, parking sensors), 4 door or hatch  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Manual, but Auto if it&#39;s not available  <\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver  <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong>  <\/p>\n\n<p>I&#39;m between the following:<\/p>\n<\/blockquote>\n\n<ul>\n<li>Genesis G70 2.0MT (patiently waiting them actually arriving : | )<\/li>\n<li>Kia Stinger GT1 (I do like the sportback)<\/li>\n<li>BMW 330i <\/li>\n<li>Audi A4\/A5<\/li>\n<li>VW GTI Autobahn<\/li>\n<li>Subaru WRX Limited<\/li>\n<\/ul>\n\n<blockquote>\n<p><strong>Is this your 1st vehicle:<\/strong> No, have a 2005 Elise for the real fun :)   <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Likely new, so yes  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Yes  <\/p>\n\n<p><strong>Additional Notes:<\/strong>  <\/p>\n\n<p>Not as interested in the German cars, but they would be good comps for the G70 and I&#39;ve never shopped one in earnest. Not a big fan of the Focus RS \/ Civic Type R looks. Probably need to start test driving, but wanted to see if anyone had been between similar options.<\/p>\n<\/blockquote>\n<\/div>","29":"<div class=\"md\"><ul>\n<li>Location: DC Metro<\/li>\n<li>Price range: 20k-50k<\/li>\n<li>Lease or Buy: Lease<\/li>\n<li>New or used: New<\/li>\n<li>Type of vehicle: Crossover, Hatch, Wagon<\/li>\n<li>Must haves: Apple Carplay, Adaptive Cruise Control (or better)<\/li>\n<li>Desired transmission (auto\/manual, etc): Manual<\/li>\n<li>Intended use: Around town and many 4h long highway trips<\/li>\n<li>Vehicles you&#39;ve already considered: Subaru Crosstrek &amp; Impreza, VW Tiguan &amp; Golf, Volvo SUV\/Wagons<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Do you need a Warranty: No<\/li>\n<li>Can you do Minor work on your own vehicle: Prefer not to<\/li>\n<li>Can you do Major work on your own vehicle: No<\/li>\n<li>Additional Notes: Looking mainly for a practical car that is good quality, well engineered, and high attention to detail, gets decent gas mileage, and comfrotable. Normal SUVs are too big for my taste, so crossover style is the limit for me. I&#39;m willing to pay for engineering\/quality, but I don&#39;t want to pay for status or luxury for its own sake.<\/li>\n<\/ul>\n<\/div>","30":"<div class=\"md\"><p>Grand Rapids Michigan <\/p>\n\n<p>2500 max<\/p>\n\n<p>Buy<\/p>\n\n<p>Used<\/p>\n\n<p>Sport, sedan or coupe<\/p>\n\n<p>Decent fuel economy hopping for at least 20 city, no rear wheel drive, nothing over 200 hp trying to save on insurance don’t want something crazy fast<\/p>\n\n<p>Manual<\/p>\n\n<p>Daily drive<\/p>\n\n<p>Not first vehicle<\/p>\n\n<p>Can do minor work<\/p>\n\n<p>No major work<\/p>\n<\/div>","31":"<div class=\"md\"><p>Location: (Specify your country or region) north east usa<\/p>\n\n<p>• Price range: (Minimum-Maximum in your local currency) 25k-35k USD<\/p>\n\n<p>• Lease or Buy: buy<\/p>\n\n<p>• New or used: new<\/p>\n\n<p>• Type of vehicle: Crossover, SUV<\/p>\n\n<p>• Must haves: AWD, Android auto, panoramic sunroof, adaptive cruise control, lane keep assist, blind spot monitoring, leather seats<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>• Intended use: Daily Driver<\/p>\n\n<p>• Vehicles you&#39;ve already considered: 19 hyundai santa fe, 18 vw tiguan, 18 crv<\/p>\n\n<p>• Is this your 1st vehicle: no<\/p>\n\n<p>• Do you need a Warranty: yes<\/p>\n\n<p>• Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) yes<\/p>\n\n<p>• Additional Notes:<\/p>\n\n<p>────────<\/p>\n<\/div>","32":"<div class=\"md\"><p>Location: Colorado, Denver<\/p>\n\n<p>• Price range: ~40k USD, lower the better<\/p>\n\n<p>• Lease or Buy: Lease <\/p>\n\n<p>• New or used: New<\/p>\n\n<p>• Type of vehicle: Crossover, SUV, Sedan, hatchback<\/p>\n\n<p>• Must haves: AWD, Android auto, Apple CarPlay, 220+ HP, preferably turbo\/supercharger options, sporty look!<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>• Intended use: Daily Driver<\/p>\n\n<p>• Vehicles you&#39;ve already considered: Volvo XC40, VW Atlas, Golf R, VW Arteon, Honda Pilot <\/p>\n\n<p>• Is this your 1st vehicle: no<\/p>\n\n<p>• Do you need a Warranty: yes<\/p>\n\n<p>• Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) no<\/p>\n\n<p>• Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) no<\/p>\n\n<p>• Additional Notes:<\/p>\n\n<p>I currently own a 2018 VW Tiguan SE on the new MQB platform. It&#39;s great but seriously under powered. So I want something else. \n────────<\/p>\n<\/div>","33":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> USA\/New England  <\/p>\n\n<p><strong>Price range:<\/strong> ~$40K  <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Lease (maybe buy if on the cheaper end)  <\/p>\n\n<p><strong>New or used:<\/strong> New  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Performance\/hot hatch  <\/p>\n\n<p><strong>Must haves:<\/strong> Performance-oriented, turbo  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Auto, but willing to learn manual  <\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver  <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> VW Golf R, Ford Mustang Ecoboost, Honda Civic Type R, Kia Stinger, Hyundai Veloster N, Subaru WRX  <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No  <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes, but not going to  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No  <\/p>\n\n<p><strong>Additional Notes:<\/strong> Currently have a &#39;16 MK7 GTI, lease is up in May<\/p>\n<\/blockquote>\n<\/div>","34":"<div class=\"md\"><p>• Location: Massachusetts <\/p>\n\n<p>• Price range: 5-10k<\/p>\n\n<p>• Lease or Buy: Buy<\/p>\n\n<p>• New or used: Used<\/p>\n\n<p>• Type of vehicle: Pickup truck<\/p>\n\n<p>• Must haves: 4wd, lowish mileage, and a decently maintained interior.<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): Automatic<\/p>\n\n<p>• Intended use: dd\/utility<\/p>\n\n<p>• Vehicles you&#39;ve already considered: F150, Silverado 1500<\/p>\n\n<p>• Is this your 1st vehicle: No<\/p>\n\n<p>• Do you need a Warranty: No<\/p>\n\n<p>• Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: Some, but prefer not to.<\/p>\n<\/div>","35":"<div class=\"md\"><p>Location: Long Island, NY<\/p>\n\n<p>• Price range: 8k MAX don&#39;t qualify for any loans\/leases (don&#39;t want either\n• Lease or Buy: Buy<\/p>\n\n<p>• New or used: Used<\/p>\n\n<p>• Type of vehicle: Sedan<\/p>\n\n<p>• Must haves: Style 1st, Reliability 2nd, Comfort 3rd, gas Mileage 4th.<\/p>\n\n<p>• Desired transmission (auto\/manual, etc): Automatic, manual if its sporty<\/p>\n\n<p>• Intended use: dd\/utility<\/p>\n\n<p>• Vehicles you&#39;ve already considered: Chrysler 300c, VW TDI<\/p>\n\n<p>• Is this your 1st vehicle: No, Owned 1984 Camaro Z28, 1986 Monte Carlo SS, 1994 Ford Tbird SuperCoupe, 2001 Acura Integra GSR, 1995 Ford Bronco 5.8L all over 10-15yrs old when i bought them (Listed so you get an idea of my style preferences)<\/p>\n\n<p>• Do you need a Warranty: No<\/p>\n\n<p>• Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>• Can you do Major work on your own vehicle: Some, but don&#39;t have the tools or garage needed<\/p>\n\n<p>I REALLY like the look of the Chrysler 300c AWD.  But, i have heard REALLY bad things about realiablity.  I also like the look and MPG of the Jetti TDI, but they tend to only sell at this price with REALLY REALLY high miles<\/p>\n<\/div>","36":"<div class=\"md\"><ul>\n<li>  Location: Northern Ohio<\/li>\n<li>  Price Range: 0-$4000<\/li>\n<li>  Buy<\/li>\n<li>  Used<\/li>\n<li>  SUV Or Truck preferably <\/li>\n<li>  Must Haves: 4x4 or AWD<\/li>\n<li>  No desired trans<\/li>\n<li>  Daily driver<\/li>\n<li>  Vehicles Considered: Jeep Cherokee and Ford Escape<\/li>\n<li>  Yes, first vehicle\nThanks!!!<\/li>\n<\/ul>\n<\/div>","37":"<div class=\"md\"><p><strong>Location:<\/strong> Central Texas, USA<\/p>\n\n<p><strong>Price range:<\/strong> Under $14,000 would be ideal but willing to stretch up to $20,000.<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> Either, but I&#39;ll probably wind up with a used car for the value.<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sedan or sub\/compact<\/p>\n\n<p><strong>Must haves:<\/strong> Four doors, good reliability &amp; safety ratings.<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Automatic<\/p>\n\n<p><strong>Intended use:<\/strong> Daily car. I live alone and in a city, a few minutes&#39; drive from my workplace.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Honda Fit (2015 or 2018), Honda Accord (2016+), Kia Soul (2014)<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, second. (See notes.)<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes, but strongly prefer not to.<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Additional Notes:<\/strong> My previous car (2007 Accord) overheated and blew the head gasket last week, so I am unexpectedly shopping for a new vehicle. I think a car with Android Auto would be really snazzy, but I&#39;m willing to live without it.<\/p>\n<\/div>","38":"<div class=\"md\"><p><strong>Location: Norway Oslo<\/strong><\/p>\n\n<p><strong>Price range:<\/strong> up to 70k NOK<\/p>\n\n<p><strong>Lease or Buy:<\/strong> buy<\/p>\n\n<p><strong>New or used:<\/strong> used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> For this price - probably hachback<\/p>\n\n<p><strong>Must haves:<\/strong> at least a\/c, dont care about radio but would like aux.<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> dont care<\/p>\n\n<p><strong>Intended use:<\/strong> Daily driving<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Hyundai i10\/i20\/i30, Ford Ka\/Fiesta, Kia Ceed\/Picanto, Suzuki Alto<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> Yes, but I have driven a lot of different cars - from 1990s fiat without power steering to M4.<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> no<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> no<\/p>\n\n<p><strong>Additional Notes:<\/strong> I do love cars, but unfortunately need a car to fit a budget with little consideration for driving enjoyment.  I am a student looking for a car to commute to work since it&#39;s quite far and takes far too long to get there by public transport. I also found a Alfa Mito in this price range with 98k km in a good condition - how bad of an idea is it to get it on a budget?<\/p>\n<\/div>","39":"<div class=\"md\"><p><strong>Location:<\/strong> Eastern PA, USA<\/p>\n\n<p><strong>Price range:<\/strong> &lt;$40,000 US<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong> Used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Coupe\/Convertible<\/p>\n\n<p><strong>Must haves:<\/strong> V8+, some form of music player compatibility.<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Auto Preferred, but open to learning a manual.<\/p>\n\n<p><strong>Intended use:<\/strong> Daily Driver.<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> SL550, Granturismo, XKR, V8 Vantage, M6<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No, although it&#39;d be my first sporty car.<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> (fluids, alternator, battery, brake pads etc) Yes<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> (engine and transmission, timing belt\/chains, body work, suspension etc ) No<\/p>\n\n<p><strong>Additional Notes:<\/strong> I sorta already have an Idea of what I want, but, having never actually had one or known anyone who has one, I thought I&#39;d ask for opinions in the hope someone else has experience with them.  I&#39;d definitely take suggestions on cars I haven&#39;t mentioned as well, if you have something in mind.<\/p>\n\n<p>SL-550: i love how this car looks, and its definitely one of the best looking convertibles available. Its just super menacing, theres also a dealer real close to my house, so that&#39;s convienient, although it would always bother me that it wasn&#39;t the AMG because one was for sale near me not too long ago and I missed it.<\/p>\n\n<p>M6 Convertible: honestly, the only reason I was looking at the M6 was for the V10. The aesthetics are a bit hit or miss, but the torpedo shape has grown on me. I prefer the convertible cause i think it makes it look a bit better and the interior styling is pretty good.<\/p>\n\n<p>XKR Coupe: I’ve always had an appreciation for Jags. I really cant place it, but the XKR is probably one of my ideal cars.  The coupe looks sleek and stylish from the side, but also mean and intimidating from the front.  The convertible, on the other hand, looks significantly worse, at least to me. The lack of the sloped back really hurts it.<br\/>\nIm also not a fan of the pre-2010 interior.  Its a bit aged.<\/p>\n\n<p>GranTurismo: This looks even better than the Jag, but ive heard its otherwise not great.  Despite that, it’s under consideration for appearance alone. Except the interior, which looks like a phone from the 90&#39;s.  Its a bit more expensive though, at 39k for the one&#39;s I&#39;ve seen, which is at the top of my range.<\/p>\n\n<p>V8 Vantage:  who wouldnt get an Aston for 37k?  Ive never heard a single bad thing about this car. Honestly i havent heard much about it at all.  The only one within an hours drive of me though is a manual, which i kinda don’t know how to use, but I&#39;d consider it, just because its an Aston.<\/p>\n<\/div>","40":"<div class=\"md\"><p>I like this car and I&#39;m thinking of buying it.<\/p>\n\n<p><a href=\"https:\/\/www.facebook.com\/marketplace\/item\/986733161486732\/?surface=messenger_banner\">https:\/\/www.facebook.com\/marketplace\/item\/986733161486732\/?surface=messenger_banner<\/a><\/p>\n\n<p>I&#39;m not really sure what to do though, or how to decide if it&#39;s a good car or not. I&#39;m pretty sure timing belt + clutch have <em>not<\/em> been done. I don&#39;t plan to race though. <\/p>\n\n<p>I&#39;ll be going up to look at it on saturday, but its a 2.5 hour drive each way so I know that will probably cloud my judgement. <\/p>\n\n<p>Any help would be appreciated. <\/p>\n<\/div>","41":"<div class=\"md\"><p>Winter beater, or winter Drive?<\/p>\n\n<p>I am a student working a decent job, and I have lucked into a 2001 Honda Prelude Electron Blue Pearl that has only seen 3 winters in it&#39;s lifetime. (I live in Ottawa, Ontario Canada where the weather regularly fluctuates between 5C and -35C during the winter and salt use is very liberal) .<\/p>\n\n<p>It is in AMAZING shape for my area, but it still does have a small amount of rust on the inside of the wheel arch on both sides (the lip that folds under from the quarter panel) and enough rock chips on the hood to warrant a repaint.<\/p>\n\n<p>I am trying to decide whether to get all of the bodywork done now at a cost of roughly $1500 and drive the car during the winter, or to spend that money on heated storage ($500) and a winter beater ($1000).<\/p>\n\n<p>Essentially:<\/p>\n\n<p>Is there any chance that the rust could get worse while it is in storage?<\/p>\n\n<p>Which one would give me more value for my money?<\/p>\n\n<p>Any opinions, answers, personal experiences and\/or words of wisdom would be very much appreciated.<\/p>\n<\/div>","42":"<div class=\"md\"><p>miata or eclipse (ca. $3k)?\nlocation: CA\ncan do slightly more than minor work myself<\/p>\n\n<p>Looking to buy a first car; preferably a good mix of fun and usability in my budget. The miata is certainly always the answer, but i really like the look of the third gen eclipse. Should I go for the rwd funzies and mazda handling, or for the borderline practicality of four seats and a solid roof?<\/p>\n\n<p>Or maybe there’s another gem in the 3k realm i’m missing?<\/p>\n<\/div>","43":"<div class=\"md\"><blockquote>\n<p>Hi guys,  <\/p>\n\n<p>So my 1999 NB1 Mazda Miata just crapped out on me tonight. Had a fellow miata driver come check it out while I was waiting for my tow truck and we both confirmed that it&#39;s cranking, so not a bad battery so either spark or gas issues.  <\/p>\n\n<p>Either way, it&#39;s been 3 years since I&#39;ve owned her as my first ever car, and I&#39;m ready for a change. Please give me any suggestions, my only real must haves are manual transmission and decent legroom (coming from a tall guy in a miata).  <\/p>\n\n<p><strong>Location:<\/strong> East Bay, California (Norcal)  <\/p>\n\n<p><strong>Price range: ~16-17k MAX<\/strong>  <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Preferably buy  <\/p>\n\n<p><strong>New or used:<\/strong> Used  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Sports Car, Sedan (I&#39;m coming from a 1999 Mazda Miata)  <\/p>\n\n<p><strong>Must haves:<\/strong> Manual Transmission (please), more room as I&#39;m 6&#39; 4&quot;, reliability, good handling  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Manual  <\/p>\n\n<p><strong>Intended use:<\/strong> DD, commuting, maybe an occasional autocross, road trips  <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered: Civic SI, Honda Accord Sport, Mazda 3\/6?<\/strong>  <\/p>\n\n<p><strong>Is this your 1st vehicle: No<\/strong>  <\/p>\n\n<p><strong>Do you need a Warranty: ?<\/strong>  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Brake cylinder, clutch slave\/master, oil change, brake fluid change, coolant flush  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> no<\/p>\n<\/blockquote>\n<\/div>","44":"<div class=\"md\"><p>​<\/p>\n\n<p>Location: (Specify your country or region)<\/p>\n\n<p>UK​<\/p>\n\n<p>​<\/p>\n\n<p>•Price range: (Minimum-Maximum in your local currency)<\/p>\n\n<p>£3000<\/p>\n\n<p>​<\/p>\n\n<p>•Lease or Buy:<\/p>\n\n<p>Buy, 2nd hand<\/p>\n\n<p>​<\/p>\n\n<p>•New or used:<\/p>\n\n<p>Used​<\/p>\n\n<p>​<\/p>\n\n<p>•Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)<\/p>\n\n<p>Coupe (Sporty)<\/p>\n\n<p>​<\/p>\n\n<p>•Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.)<\/p>\n\n<p>Smooth ride, nice interior, good looking, decent fuel economy, not bad insurance, 4 seat<\/p>\n\n<p>​<\/p>\n\n<p>•Desired transmission (auto\/manual, etc):<\/p>\n\n<p>Either<\/p>\n\n<p>​<\/p>\n\n<p>•Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off roading etc.)<\/p>\n\n<p>Daily driver​<\/p>\n\n<p>​<\/p>\n\n<p>•Vehicles you&#39;ve already considered:<\/p>\n\n<p>Hyundai Coupe SIII<\/p>\n\n<p>Mazda RX-8 (Way too expensive to run + insurance too high)<\/p>\n\n<p>​​<\/p>\n\n<p>•Is this your 1st vehicle:<\/p>\n\n<p>2nd, previously owned a Renault Clio Extreme 07reg<\/p>\n\n<p>​​<\/p>\n\n<p>•Do you need a Warranty:<\/p>\n\n<p>Not sure?<\/p>\n\n<p>​​<\/p>\n\n<p>•Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc)<\/p>\n\n<p>No<\/p>\n\n<p>​<\/p>\n\n<p>•Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc )<\/p>\n\n<p>No<\/p>\n\n<p>​<\/p>\n\n<p>•Additional Notes:<\/p>\n\n<p>I&#39;m only 19 and so insurance is obviously a HUGE factor for me, I have been drivng since July 2016, had no issues and have Gold rating on my Blackbox. I am a sensible driver but would love something sporty looking and with a bit more power than my current car (1.2 Clio), I have looked at the Hyundai Coupe 2.0 very seriously and was quoted £1000 on insurance (currently paying £700 for the Clio 2 yrs no claims), however, I am 6&quot;5 and am worried about the leg room and also finding it hard to find god reviews of the car. This will be my first self-bought car and so it is important to me that I get this right and get something I am happy wth!<\/p>\n\n<p>​<\/p>\n\n<p>Thanks all!<\/p>\n\n<p>​<\/p>\n<\/div>","45":"<div class=\"md\"><p>So we currently own a Mitsubishi Eclipse 2g, but it keeps breaking down on me. Currently had to open the cylinder head and there&#39;s a lot of issues with it right now, but I won&#39;t delve into it. For context, that car has been with us for 17 years and my dad and older brother used it before me. When it broke down for the nth time this year, my dad and I both realized that maybe, despite our attachment to it, it would be better to get another car. The problem we have is there are about 50 Eclipses in our country and parts are hard to get. Now, we&#39;ve been thinking what to get if we were to really sell it, and I fell in love with the idea of owning a Miata. We used to own one but had to sell it because there was an issue with the papers due to it being an import, instead of the local ones here. I&#39;m pretty sure that Miata parts are way easier to get here, and there&#39;s a much bigger community of Miata owners here. Do you think the Eclipse would be worth selling to get a Miata? I&#39;m currently a college student, to add a bit of context.<\/p>\n\n<p>Location: Philippines<\/p>\n\n<p>Price range: 250,000 to 400,000 php (5k to 8k dollars)<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: Sports Car\/Convertible\nMust haves: fun driving the car.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily college driver\/project car<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda Miata. BMW 3 series (not yet sold on this though, feel like I&#39;d fare better with a miata.)<\/p>\n\n<p>Is this your 1st vehicle: nope, I&#39;ve driven a bunch of cars but a Lancer and Eclipse have been my daily driver.<\/p>\n\n<p>Do you need a Warranty: Not really.<\/p>\n\n<p>Can you do Minor work on your own vehicle: not personally, but know someone who can and is readily available. I know how to, but feel like I&#39;d botch it.<\/p>\n\n<p>Can you do Major work on your own vehicle: Have a shop that services all our vehicles.<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>Edit: Someone might mention that the Miata is as old, or even older than the Eclipse, but the parts are way more common, easier to acquire, and cheaper. I like to be that guy who&#39;s different, so maybe that might affect my want to sell the eclipse (which isn&#39;t that common here), but fun driving takes priority for me. Trunk space is not an issue with me, nor are the two seats. Will probably miss the stage 1 build 300hp of the eclipse, but my dad said that, with how light the Miata is, it&#39;ll go really fast despite the 120hp, and I can build it as a project car anyway.<\/p>\n<\/div>","46":"<div class=\"md\"><p><strong>Location:<\/strong> Northern California<\/p>\n\n<p><strong>Price range:<\/strong> $3k-$10k<\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy<\/p>\n\n<p><strong>New or used:<\/strong>  Used<\/p>\n\n<p><strong>Type of vehicle:<\/strong> Wagon<\/p>\n\n<p><strong>Must haves:<\/strong> AWD\/ snow capable, comfortable, and I don&#39;t hate myself driving it.<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Manual<\/p>\n\n<p><strong>Intended use:<\/strong> Hauling around stuff, going on snow trips and camping trips, taking friends to the bar, and being my most comfortable and spacious car<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong>  E46 325xit, Volvo V70R, Audi avant, E91\/E61 It would be replacing my Outback XT which is too finicky of a car and does not handle well.  I have considered converting my Outback into a Legacy and doing a bunch of suspension work, but I don&#39;t like the car enough to do that.<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> No<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> Yes absolutely<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> Yes, but I&#39;d prefer this car to not need too much for the most part.<\/p>\n\n<p><strong>Additional Notes:<\/strong>  In my mind the E46 is the only option.  E90s are less reliable, V70R&#39;s are hard to find and I&#39;m not sure I trust the reliability, I don&#39;t want another Subaru and their interiors are crap, plus I am already familiar with wrenching on E30&#39;s and E36&#39;s so the E46 should be easy so long as I am preventative with the cooling system.<\/p>\n<\/div>","47":"<div class=\"md\"><p>Location: Upstate NY<\/p>\n\n<p>Price range: 20-37k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sport Sedan<\/p>\n\n<p>Must haves: Awd<\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Intended use: Daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: Audi S4, Bmw 335i xdrive<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: preferred, not necessary<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: most<\/p>\n\n<p>Additional Notes: Test drove both the s4 and 335, wanted to see what others think or any other recommendations <\/p>\n<\/div>","48":"<div class=\"md\"><blockquote>\n<p><strong>Location:<\/strong> NYC area  <\/p>\n\n<p><strong>Price range:<\/strong> Up to $15k  <\/p>\n\n<p><strong>Lease or Buy:<\/strong> Buy  <\/p>\n\n<p><strong>New or used:<\/strong> Used  <\/p>\n\n<p><strong>Type of vehicle:<\/strong> Crossover, SUV  <\/p>\n\n<p><strong>Must haves:<\/strong> Union made (list here: <a href=\"https:\/\/aflcio.org\/UnionCars\">https:\/\/aflcio.org\/UnionCars<\/a>), AWD, Fuel efficient, Trunk space, sunroof, comfortable for both tall and short people (hubs is 6&#39;2&#39;&#39; and i am 5&#39;2&#39;&#39;)  <\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> automatic  <\/p>\n\n<p><strong>Intended use:<\/strong> Family\/weekend car, mostly for trips out of town. Only occasional daily city use.   <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Ford Escape, Chevy Equinox  <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> no (as in ever? no. we don&#39;t have a car now though)  <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> preferably yes  <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> probably wouldn&#39;t end well  <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> definitely not  <\/p>\n\n<p><strong>Additional Notes:<\/strong> We&#39;re hitting a time where we are spending so much on rental cars for travel that we may as well buy a car. Looking to get something that we can use for trips for the next couple of years while we only have fur kids, and then we&#39;ll probably upgrade to something with more safety bells and whistles when we have human kids. <\/p>\n<\/blockquote>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null},"comment_edited":{"0":false,"1":1535401401.0,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":1535478219.0,"16":1535492281.0,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":1535581370.0,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":1535651398.0,"46":false,"47":false,"48":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false},"comment_score":{"0":4,"1":5,"2":3,"3":2,"4":2,"5":2,"6":2,"7":2,"8":2,"9":2,"10":2,"11":2,"12":2,"13":2,"14":2,"15":2,"16":2,"17":2,"18":2,"19":2,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false},"author_id":{"0":"4hh3c","1":"","2":"acmux","3":"","4":"776oo","5":"66wj2","6":"oduil","7":"3jxcv","8":"7ousd","9":"","10":"9idtu","11":"dvz0d","12":"pb9imsx","13":"","14":"948b5","15":"","16":"780dj","17":"yvdyw","18":"misyx","19":"","20":"","21":"uwjv3aq","22":"d0qne","23":"64nyd","24":"","25":"t7kbkt1","26":"g4re3","27":"","28":"p0ygt","29":"3zwwa","30":"14jc81","31":"147i0f","32":"sh3zl","33":"tq6zw","34":"8ukgj","35":"11s7mn","36":"1c0l5oiw","37":"qjbx8","38":"6n9v0","39":"b147j","40":"dnp2c","41":"6yjkn","42":"xy04886","43":"b4gnj","44":"v1jc4dh","45":"guaqj","46":"54w5l","47":"1731e0","48":"4prkp"},"author_name":{"0":"gfpumpkins","1":"","2":"Ar1S3","3":"","4":"nullsignature","5":"FlyersKJM","6":"PLEASEHIREZ","7":"mpgorans","8":"Jazztoken","9":"toilettv123","10":"dorkbot3000","11":"Sheik92","12":"PrimeMover17","13":"","14":"Epic_Creation","15":"","16":"I_Will_Eat","17":"Randal_The_VandaI","18":"wandering_pleb13","19":"","20":"","21":"sprchrgddc5","22":"NINJA159","23":"Mekkakat","24":"glowser","25":"Wake_Jake","26":"terf312","27":"","28":"Oreallyus","29":"thidr0","30":"PKExcalibur0049","31":"tisthetimetobelit","32":"vahdyx","33":"Nicksaw85","34":"theguy494","35":"Ridewithme38","36":"seamonkey418","37":"Great-Dane","38":"95POLYX","39":"Snaz5","40":"MovkeyB","41":"firehawk1115","42":"mabo1812","43":"SirJuvenile","44":"accountforthissub","45":"itswhatshisname","46":"bmetz16","47":"mr_bissel","48":"lurkerbee"}}