{"comment_id":{"0":"hdlcucc","1":"hds6ynx","2":"hdlbkez","3":"hdlfxnl","4":"hdmgbqc","5":"hdshruz","6":"hdq85z1","7":"hdrmpz6","8":"hdstj4f","9":"hdv7cc2","10":"hdlqkau","11":"hdlrpqg","12":"hdmjald","13":"hdmok0q","14":"hdoyra2","15":"hdqwxvp","16":"hdrlxmm","17":"hdsya76","18":"hdveiui","19":"hdzmwzu","20":"he18vqe","21":"heeavty","22":"heewmkx","23":"he804j6","24":"hdljoe6","25":"hdnvp3a","26":"he31k72","27":"hdw7znm","28":"hdlunz9","29":"hdmsm3b","30":"hdnmbmf","31":"hdnvjll","32":"hdom26p","33":"hdoqeod","34":"hdorhzv","35":"hdpm4ih","36":"hdrfbg5","37":"hdtwwsv","38":"hdu4chk","39":"hdv3q8t","40":"hdwcsnk","41":"hdwikwy","42":"hdwiww8","43":"hdxdmtw","44":"hdyiygg","45":"hdywyow","46":"hdz34zq","47":"hdzebgi","48":"hdzj27g","49":"he07i4q","50":"he0cmcy","51":"he184us","52":"he3hguo","53":"he5g1dx","54":"he5waz9","55":"he6lhtn","56":"he77spd","57":"he7ef7z","58":"he7w2n4","59":"he93wni","60":"heag788","61":"heah3wk","62":"hebbxah","63":"hec3biu","64":"hectkfv","65":"heddd4x","66":"hedl5kz","67":"heg6n4c","68":"hegw4pl","69":"hem2t4y","70":"hg27jvk","71":"he2hqyv","72":"he46ioq","73":"hdn230a","74":"hdr1ffr","75":"heaw7nl","76":"hed4pjp"},"comment_parent_id":{"0":"t3_prvhic","1":"t3_prvhic","2":"t3_prvhic","3":"t3_prvhic","4":"t3_prvhic","5":"t3_prvhic","6":"t3_prvhic","7":"t3_prvhic","8":"t3_prvhic","9":"t3_prvhic","10":"t3_prvhic","11":"t3_prvhic","12":"t3_prvhic","13":"t3_prvhic","14":"t3_prvhic","15":"t3_prvhic","16":"t3_prvhic","17":"t3_prvhic","18":"t3_prvhic","19":"t3_prvhic","20":"t3_prvhic","21":"t3_prvhic","22":"t3_prvhic","23":"t3_prvhic","24":"t3_prvhic","25":"t3_prvhic","26":"t3_prvhic","27":"t3_prvhic","28":"t3_prvhic","29":"t3_prvhic","30":"t3_prvhic","31":"t3_prvhic","32":"t3_prvhic","33":"t3_prvhic","34":"t3_prvhic","35":"t3_prvhic","36":"t3_prvhic","37":"t3_prvhic","38":"t3_prvhic","39":"t3_prvhic","40":"t3_prvhic","41":"t3_prvhic","42":"t3_prvhic","43":"t3_prvhic","44":"t3_prvhic","45":"t3_prvhic","46":"t3_prvhic","47":"t3_prvhic","48":"t3_prvhic","49":"t3_prvhic","50":"t3_prvhic","51":"t3_prvhic","52":"t3_prvhic","53":"t3_prvhic","54":"t3_prvhic","55":"t3_prvhic","56":"t3_prvhic","57":"t3_prvhic","58":"t3_prvhic","59":"t3_prvhic","60":"t3_prvhic","61":"t3_prvhic","62":"t3_prvhic","63":"t3_prvhic","64":"t3_prvhic","65":"t3_prvhic","66":"t3_prvhic","67":"t3_prvhic","68":"t3_prvhic","69":"t3_prvhic","70":"t3_prvhic","71":"t3_prvhic","72":"t3_prvhic","73":"t3_prvhic","74":"t3_prvhic","75":"t3_prvhic","76":"t3_prvhic"},"comment_created_utc":{"0":1632147276.0,"1":1632268230.0,"2":1632146703.0,"3":1632148632.0,"4":1632163608.0,"5":1632273414.0,"6":1632238126.0,"7":1632258965.0,"8":1632279149.0,"9":1632330769.0,"10":1632153096.0,"11":1632153569.0,"12":1632164822.0,"13":1632166974.0,"14":1632209420.0,"15":1632248265.0,"16":1632258622.0,"17":1632281702.0,"18":1632333666.0,"19":1632419049.0,"20":1632444848.0,"21":1632691672.0,"22":1632701859.0,"23":1632578199.0,"24":1632150226.0,"25":1632186238.0,"26":1632487019.0,"27":1632350116.0,"28":1632154774.0,"29":1632168641.0,"30":1632181830.0,"31":1632186167.0,"32":1632199711.0,"33":1632202669.0,"34":1632203457.0,"35":1632228108.0,"36":1632255838.0,"37":1632309019.0,"38":1632313702.0,"39":1632329301.0,"40":1632352277.0,"41":1632355037.0,"42":1632355196.0,"43":1632370706.0,"44":1632401895.0,"45":1632408279.0,"46":1632410885.0,"47":1632415544.0,"48":1632417475.0,"49":1632427847.0,"50":1632430112.0,"51":1632444497.0,"52":1632494438.0,"53":1632524192.0,"54":1632531684.0,"55":1632544108.0,"56":1632559954.0,"57":1632565403.0,"58":1632576241.0,"59":1632596065.0,"60":1632618526.0,"61":1632618973.0,"62":1632635215.0,"63":1632656570.0,"64":1632669890.0,"65":1632678093.0,"66":1632681111.0,"67":1632729823.0,"68":1632749161.0,"69":1632846855.0,"70":1633835761.0,"71":1632472731.0,"72":1632504895.0,"73":1632172566.0,"74":1632250131.0,"75":1632626376.0,"76":1632674588.0},"comment_body":{"0":"<div class=\"md\"><p>Please help. After searching around for over a year and a half I&#39;m kinda back at square one.   <\/p>\n\n<p>Location: Michigan<br\/>\nPrice range: ~35-40k<br\/>\nLease or Buy: Buy (I will drive this thing till the wheels fall off. Yes, I have attachment issues)<br\/>\nNew or used: Either, but preferably New<br\/>\nType of vehicle: Car\/Sports Car<br\/>\nMust haves: Power(280hp+. Preferably 300+). Manual, or perhaps a really, really fun DCT). AWD or FWD for Michigan Winters. 4 Doors (sigh...kids are in the future)<br\/>\nDesired transmission (auto\/manual, etc): Manual.<br\/>\nIntended use: Daily Driver\/occasional weekend getaway vehicle for me and the wife.<br\/>\nVehicles you&#39;ve already considered: Subaru WRX\/STI; 2022 Hyundai Elantra N (current choice); Dodge Charger(decided I didn&#39;t want to drive a boat but please feel free to change my mind if you own one); Ford Mustang w\/ 5.0 V8.<br\/>\nIs this your 1st vehicle: No.<br\/>\nDo you need a Warranty: Eh, not really.<br\/>\nCan you do Minor work on your own vehicle: Yes.<br\/>\nCan you do Major work on your own vehicle: Some. Can&#39;t pull an engine but I don&#39;t mind getting under a car to do my own work.<br\/>\nAdditional Notes:<br\/>\nThe biggest thing for me about cars is the theatre and experience. I want noise, power, rowing through gears, crackles and pops! Buuuuut I also know that in the next year or so my wife and I will likely have our first child, so we discussed it and agreed that we will very likely need a 4 door car. I&#39;m not super jazzed about that but c&#39;est la vie.   <\/p>\n\n<p>My current selection is the Elantra N but I&#39;m not sure if it&#39;s enough power, but I guess I won&#39;t know until I drive it. My guess is that it certainly will be enough. Others I considered are the Subaru WRX\/STI but I&#39;ve moved away from that since the release of the newest model (I think it looks absolutely atrocious) and the fact that there just seems to be SO MUCH work that needs to go into an STI to get it to where I would want it to be.   <\/p>\n\n<p>I&#39;ve even looked into buying an old Bentley Flying Spur(in my dreams) because I really want a super fun feeling. I like smaller cars and my current DD is a 2000 Toyota Celica GT. I love that car and high revving engines, but it just doesn&#39;t fit my needs anymore.   <\/p>\n\n<p>Thanks in advance for your help, suggestions, insults, and more.<\/p>\n<\/div>","1":"<div class=\"md\"><ul>\n<li>Location: Southeast United States<\/li>\n<li>Price range: maximum of around $18k USD<\/li>\n<li>Lease or Buy: Buy<\/li>\n<li>New or used: Used<\/li>\n<li>Type of vehicle: Sedan or SUV<\/li>\n<li>Must haves: light interior, backup camera, bluetooth, good safety and reliability rating<\/li>\n<li>Desired transmission (auto\/manual, etc): Automatic<\/li>\n<li>Intended use: daily driving<\/li>\n<li>Vehicles you&#39;ve already considered: I really like the Honda Accord, Toyota 4Runner, and Subaru Legacy (NO VOLKSWAGENS!! Lol that is what I used to have an I do not have the money to upkeep that thing)<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Do you need a Warranty: No<\/li>\n<li>Can you do Minor work on your own vehicle: No<\/li>\n<li>Can you do major work on your vehicle: No<\/li>\n<\/ul>\n\n<p>Additional notes: My car was totaled the other day, just waiting for the appraisal to come through, so anything in the price range of $10k-$18k would be appreciated because its all up in the air right now<\/p>\n<\/div>","2":"<div class=\"md\"><p>Like everyone else, we are in need of a car at the worst possible moment. But here we are.<\/p>\n\n<p>Our situation:<\/p>\n\n<p>We are a family of 4, in the Chicago area. Two young kids still in car seats.<\/p>\n\n<p>We have a Subaru Impreza hatchback which we love, but it’s small. And we now need a second car. The Subaru will be for one adult to commute to work. The new car will be for moving kids, larger shopping trips, going camping, road trips, etc.<\/p>\n\n<p>We ideally want to buy a car that we’ll have for a while. <\/p>\n\n<p>We’ve been looking at Toyota Highlanders. They seem to meet that sweet spot where they have off-road capability, Japanese reliability, not obscenely huge, but something our family can grow into.<\/p>\n\n<p>Budget is pretty much whatever we want it to be, but ideally around $30k. We also don’t want to throw money at a car. We just want it to move us around in relative comfort, drive through snow and mud, fit a growing family, and last a while. We camp a lot and want something we can travel in.<\/p>\n\n<p>We don’t care much about trim. We take good care of our things, but we don’t need or want high-end.<\/p>\n\n<p>We’re looking at both used and new, and simply can’t decide what makes the most sense in these current conditions.<\/p>\n\n<p>Thank you for any advice. Please feel free to ask follow-ups.<\/p>\n<\/div>","3":"<div class=\"md\"><p>I find myself at a crossroads. My truck, a 2012 F150, crossed over 120k miles recently, heading quickly for the age of heavy repairs to stay on the road. And fuck me am I sick of 14mpg with that 5.0 V8. So.<\/p>\n\n<p>Located in the US PNW<\/p>\n\n<p>Price range...sub $40k, I think. Lower is better but I&#39;m not gonna be sacrificing comfort or capability for the sake of my wallet, y&#39;know? Looks like I&#39;ll be able to rack up $15k+ for my trade in cuz dealers around here are desperate for trucks. <\/p>\n\n<p>Buying, New. <\/p>\n\n<p>Type...this is where I&#39;m unsure. I&#39;ve always been a truck guy, but I&#39;ve moved into a denser city now, don&#39;t do much towing or farm work anymore, so I&#39;m not certain I can justify it anymore. <\/p>\n\n<p>Must haves: 4x4\/AWD at a minimum, I&#39;m no hardcore rock-crawler but I regularly run some pretty messed up forest roads. I&#39;m looking to increase my fuel efficiency for sure. <\/p>\n\n<p>Auto preferred, never drove stick<\/p>\n\n<p>Intended use: I&#39;m lucky enough to commute on foot so this will be a weekend warrior, road trips so rider\/driver comfort is important, camping\/hunting so off-road ability and a dirt-proof cargo space equally important. <\/p>\n\n<p>Vehicles I&#39;ve considered: Maverick is tempting but I&#39;m not sure about comfort at that cabin size, Subarus lineup of course, all the trucks except the Ridgeline though I&#39;m not a big Toyota fan. <\/p>\n\n<p>Not my first rodeo<\/p>\n\n<p>Warranties would be nice<\/p>\n\n<p>I can do my own maintenance, but major mechanic work goes to the shop. <\/p>\n\n<p>Additional notes: <a href=\"https:\/\/i.imgur.com\/KqoHICO.jpeg\">This is my current ride.<\/a> I&#39;m used to being able to go wherever I want without much concern with whether or not I&#39;ll be able to survive the trip. I hunt, hike, camp, love long road trips, do some minor wheeling just for the sake of mud, and I go target shooting deep in the woods. When my rig goes out we come back dirty. I don&#39;t want to change that, but I would really like to not spend $80 every weekend to fill the tank. I don&#39;t need towing, I just want to be able to drive to Alaska in winter and bring back a bloody elk carcass on a whim, without destroying the environment along the way. I would love a hybrid or electric.<\/p>\n<\/div>","4":"<div class=\"md\"><p>Location: Nova Scotia, Canada<\/p>\n\n<p>Price range: ~$20 000 CAD<\/p>\n\n<p>Lease\/buy: I&#39;m leaning toward buying<\/p>\n\n<p>Type of car: sedan or hatch<\/p>\n\n<p>Must haves: reliability. fuel efficient would be nice. Otherwise, nothing specific<\/p>\n\n<p>Desired transmission:Automatic but I can drive manual(i mostly do city driving)<\/p>\n\n<p>Intended use: daily driver <\/p>\n\n<p>Vehicles I&#39;ve considered: 2019-2022 corolla, civic and Mazda 3s.<\/p>\n\n<p>First vehicle?: First vehicle in my name. I&#39;ve been driving a vehicle in my dad&#39;s name for a while.<\/p>\n\n<p>Do you need a warranty?: It would be preferred<\/p>\n\n<p>Minor work: brakes and oil changes are no problem<\/p>\n\n<p>Major work: no, I live in an apartment and don&#39;t have a location to do major repairs<\/p>\n<\/div>","5":"<div class=\"md\"><p>Breaking the mold, but I&#39;m looking at a 2018 Alfa Romeo Stelvio Sport, 30k miles. <\/p>\n\n<p>Going to trade in my boring but nearly paid off 76k miles Fusion.<\/p>\n\n<p>Using a fleet car for work and will probably put few miles on this vehicle, wife will use this a a bougie car for certain lawyer functions.<\/p>\n\n<p>Backup car is my wife&#39;s Equinox which is nearly paid off.<\/p>\n\n<p>Talk me out of this dumb life choice.<\/p>\n<\/div>","6":"<div class=\"md\"><p>Location: California<\/p>\n\n<p>Price range: $30k give or take<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Sedan or hatchback (sport compact\/hot hatch)<\/p>\n\n<p>Must haves: Fun to drive, decently practical, comfortable, and safe<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual preferred<\/p>\n\n<p>Intended use: Fun daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Hyundai Elantra N, Toyota GR Corolla, VW GTI<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Yes<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Some<\/p>\n\n<p>Additional Notes: My 02 Mustang has bit the dust. My next car needs to be more practical (4 doors) and fairly comfortable, but I still want it to be fun to drive. The upcoming Elantra N seems ideal to me. Same with the GR Corolla. Not sure if I can wait long enough to buy either, though. I could opt for a GTI, but I&#39;m not sure if the 2022 models are at dealerships yet. Similar story with the WRX: If the upcoming redesign is more comfortable with a nicer interior than the old one, I&#39;ll definitely put it on the list, but I may not be able to wait that long. The Civic Type R and Veloster N are both great, but the former is too pricey and the latter is too small. If I decided to ditch the manual-transmission, fun-to-drive side of things, I&#39;d just get an Accord Sport 2.0T and call it &quot;good enough.&quot;<\/p>\n\n<p>(Posted this on Sunday right before last week&#39;s thread went away, figured I&#39;d try again!)<\/p>\n<\/div>","7":"<div class=\"md\"><p>location: new england\nprice: 3-7k\nbuy\nused\ntype of vehicle: doesn’t matter \nmust haves: awd preferred (snow), i’d like it to be sorta fun but that’s obviously limited by my budget\ndesired transmission: auto preferred\nintended use: daily\nvehicles considered: common cars in the price range; subaru impreza, honda civic, ford focus, etc\nnot my first vehicle \nno warranty\ncapable of minor work, not major \nadditional notes: \nfor reference i find my 2002 rav4 to be fun so that’s my standard of “fun”. love the car but with 250k miles and a shitty transmission she doesn’t have much time left. would like to save up a little more still before i buy anything but it would be nice to have a goal in mind. thanks<\/p>\n<\/div>","8":"<div class=\"md\"><p>Location: Upstate SC, USA<\/p>\n\n<p>Price range: $0k -$9k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan, Coupe, SUV or truck<\/p>\n\n<p>Must haves: fun to drive, reliable, low mileage<\/p>\n\n<p>Desired transmission (auto\/manual, etc): auto<\/p>\n\n<p>Intended use: daily driver...Home to work and back <\/p>\n\n<p>Vehicles you&#39;ve already considered: camry, civic, accord, mazda 6<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) haven&#39;t in the past, but I want to learn.<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) no.<\/p>\n<\/div>","9":"<div class=\"md\"><p>Location: Texas<\/p>\n\n<p>Price range: ~40k<\/p>\n\n<p>Lease or Buy: buy<\/p>\n\n<p>New or used: either<\/p>\n\n<p>Type of vehicle: sports car<\/p>\n\n<p>Must haves: engaging driving dynamics<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily driver, might do some auto cross<\/p>\n\n<p>Vehicles you&#39;ve already considered: Nissan 370z, Toyota 86\/frs\/brz, 6th gen Camaro SS, civic type r, focus RS, focus st, Datsun 240z, Evo x<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: yes<\/p>\n\n<p>Additional Notes: I used to have an FRS, but due to covid my financial stability was in question so I sold it, but now I find myself in a much better financial situation than ever before and want to get a sports car again. I love how engaging the FRS was and how well it handled, but I&#39;m also up for something new. Speed and power aren&#39;t a major concern and I&#39;m to tall for a Miata. I also have no interest in the mustang, WRX, or anything from FCA. I plan to modify\/ tune any car I own<\/p>\n<\/div>","10":"<div class=\"md\"><p>Does anyone have an old Porsche 911 (pre-1995) that can give insight as to the monthly\/yearly maintenance costs? I&#39;m hopefully going to be in the market for an old Targa SC or Cab Carrera here soon. I want to make sure I&#39;m not getting in over my head but I&#39;m on the younger side and am confident this vehicle will be a for-lifer. Thanks!<\/p>\n\n<p>edit: should probably mention I&#39;ll be looking in the sub-60\/70k range if that gives any more info. It won&#39;t be a daily.<\/p>\n<\/div>","11":"<div class=\"md\"><p>Does a 2013 Civic Si with only 55k KM for 13 K Canadian seem fishy?<\/p>\n\n<p>Why would an 8 year old car only have 50k km?<\/p>\n\n<p>Y&#39;all think I should avoid it?<\/p>\n<\/div>","12":"<div class=\"md\"><p>Hi there,i have a doubt between two cars.We are talking about a firts car for a 17y\/o and im from South America.<\/p>\n\n<p>I was looking between some 2000s Hyundai Coupe V6 and a some 90s Mitsubishi Ecplise GST.I have found 2 examples of each with around 50-75 k miles and all under 10\/12K USD.I was wondering which one should a i go for.The Hyundai looks cool and is pretty fast but the Eclipse is more tunable and consumes less fuel (remember this is my first car).I am fairly new to the car world so any help is usefull. Im talking about these two models but any sporty cool looking cheap-ish 2 door asian car is welcomed as a suggestion.Thanks.<\/p>\n<\/div>","13":"<div class=\"md\"><p>what models to search for - good mpg awd around $5000 and reliable. <\/p>\n\n<p>rav 4, subarus, random suvs (isuzu, mitsubishi etc) what else<\/p>\n<\/div>","14":"<div class=\"md\"><p>Location: Southern California<\/p>\n\n<p>Price range: $30k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sports Car<\/p>\n\n<p>Must haves: Lightweight, good inputs (steering, clutch feel, shifter), reliability, ideally reasonably low cost of ownership.<\/p>\n\n<p>Desired transmission: Prefer manual, but not opposed to a good auto.<\/p>\n\n<p>Intended use: Weekend Car<\/p>\n\n<p>Vehicles you&#39;ve already considered: FR-S, S2000, Miata<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Can do suspension work, can&#39;t do anything else.<\/p>\n\n<p>Additional Notes: Loved the Integra Type R back in the day, picked up the FR-S when it was new because I was hoping it would be roughly the equivalent of a RWD ITR. Loved the FR-S overall - had great steering, a good clutch, and good shifter feel - but wanted something without the torque dip without having to mess with CARB legality.<\/p>\n\n<p>Ended up selling the FR-S for $18k with 30k miles on the clock because I also own an Insight, and it didn&#39;t think it made sense to have a &quot;compromise&quot; sports car when I don&#39;t drive much anymore due to WFH. Tried out an S2K since it&#39;s philosophically similar to the FR-S but with less compromise, but the only clean examples I found are $30k+ and this might be blasphemous to say, but the S2K isn&#39;t $15k better (after taxes\/fees) than the FR-S. Engine&#39;s better, but steering feel is worse, and clutch\/shifter feel are roughly equal.<\/p>\n\n<p>So, my question is, are there any other fun, lightweight, cars that I&#39;m missing? I don&#39;t and have never really loved the Miata, which I think is the other primary contender in this category. At this point, I&#39;m thinking my best bet may be to just wait a couple of years until the second gen BRZ\/GR86 begin to hit the used market. Used GR Supra maybe down the line? I don&#39;t know, open to options.<\/p>\n<\/div>","15":"<div class=\"md\"><p>Location: Las Vegas, NV<\/p>\n\n<p>Price range: $35K<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either<\/p>\n\n<p>Type of vehicle: Truck, Sedan, Sports Car<\/p>\n\n<p>Must haves: Im 6&#39;4, 250lbs looking for a vehicle I can fit in<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: All Trucks, Honda Accord, Toyota Camry<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Will send to mechanic<\/p>\n\n<p>Additional Notes: My truck is dying and its time for a new vehicle.  I am a large man at 6&#39;4 250lbs and need something that is comfortable.  I want a truck, but the cost effective decision would be a Honda Accord.  When I start looking at the Accord I just know it will be boring to drive and I will miss having a truck.  Any recommendations?<\/p>\n<\/div>","16":"<div class=\"md\"><p>Location: Ontario, Canada<\/p>\n\n<p>Price range: Max $20,000 CAD<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Mid size sedan<\/p>\n\n<p>Must haves: Good fuel economy, safety rating, and reliability<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Kia Optima, Honda Accord, Toyota Camry, Mazda 6<\/p>\n\n<p>Is this your 1st vehicle: Yes it will be my girlfriend&#39;s first vehicle<\/p>\n\n<p>Do you need a Warranty: Would like it, but might not be possible at our price range<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Would prefer a hybrid. And also something that will have cheap insurance.<\/p>\n<\/div>","17":"<div class=\"md\"><p>Location: Rocky Mountains<\/p>\n\n<p>Price Range: $0-$50k USD<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or Used: New<\/p>\n\n<p>Type of Vehicle: SUV, Crossover<\/p>\n\n<p>Must Haves: 4x4 or AWD, decent ground clearance, good ride, good cargo space and carry at least 5 passengers (preferably 6). Fuel efficiency and under body protection is a big plus. Turbos are a plus due to elevation.<\/p>\n\n<p>Desired Transmission: Auto (no CVT or dual clutch)<\/p>\n\n<p>Intended Use: Daily driver, weekend trips, long road trips, ski trips, overlanding<\/p>\n\n<p>Vehicles I have considered: 4Runner, Explorer, Traverse, Telluride, Pallisade, Grand Cherokee and Grand Cherokee L<\/p>\n\n<p>1st Vehicle?: 3rd Vehicle<\/p>\n\n<p>Do you need warranty: yes<\/p>\n\n<p>Can you do minor work: willing to learn<\/p>\n\n<p>Can you do major work: will take to mechanic<\/p>\n\n<p>Additional notes: Driving will be predominantly above 8000 ft. Will experience a lot of snow driving and will be used to get to dispersed campgrounds and trailheads on weekends. Into sports that require gear carrying (crash pads, skis, and mountain bikes)<\/p>\n\n<p>Thanks in advance!<\/p>\n<\/div>","18":"<div class=\"md\"><p>I am looking to buy a second car for my family.  We are debating between a Toyota Sienna and a Corolla. We are a family of six, but we already have a 2019 Honda Odyssey that we use when we are all together, so it would be rare that we would need the space of two minivans, but it could be helpful given our kids have friends. <\/p>\n\n<p>Given a budget of between $5000 and $10000, what is your recommendation? How should I think about this?<\/p>\n<\/div>","19":"<div class=\"md\"><p>Location: SW Ontario<\/p>\n\n<p>Price range: Max 35k CAD<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Sedan<\/p>\n\n<p>Must haves: AWD, fuel efficient, fun to drive, decent passing power, reliable<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily driver and weekend fun car\nVehicles you&#39;ve already considered: BMW 330XI, Lexus IS300 F Sport<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No <\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>I have a long commute (100km\/day) and I’m looking for something that comfortable, fuel efficient and fun to drive. I like the Lexus but the fuel economy has me concerned and with the bmw I’m a bit worried about reliability.<\/p>\n<\/div>","20":"<div class=\"md\"><ul>\n<li>Location: Ontario, Canada<\/li>\n<li>Price Range: $0-$20k<\/li>\n<li>Lease or Buy: Buy<\/li>\n<li>New or Used: Used<\/li>\n<li>Type of Vehicle: Crossover\/mid sized SUV<\/li>\n<li>Must Haves: Good fuel economy and reliability above all else<\/li>\n<li>Desired Transmission: Auto<\/li>\n<li>Intended: Daily driver<\/li>\n<li>Is this your 1st vehicle: No<\/li>\n<li>Warranty: not required <\/li>\n<li>Can you do minor\/major work: no<\/li>\n<\/ul>\n\n<p>Looking for a crossover\/mid sized SUV for my parents to use. Really just looking for something spacious, fuel efficient, and most importantly as reliable as can be.<\/p>\n<\/div>","21":"<div class=\"md\"><p>Okay guys I found 2 cars in my area. having trouble deciding which one I should get. I live in the northeast, snow is a factor. I also have 3 children under age 10. Really wanted something sporty , awd, and 4 doors. I should also note that its mostly for running errands and pleasure driving. I have a company vehicle for commuting.<\/p>\n\n<p>2017 Dodge charger sxt ralleye. YELLOW! Fully loaded. 57k miles. automatic $29k I test drove this car and it all around feels like a nicer car than the wrx. nicer interior better ride. not as sporty but more room. I would buy this if I had my choice but I really feel like its a lot of money for a car with 57k miles and im worried about potential resale down the road. I think I will lose my ass.<\/p>\n\n<p><a href=\"https:\/\/www.goldsteinchryslerdodgejeep.com\/used-Albany-2017-Dodge-Charger-SXT-2C3CDXJG1HH516188\">https:\/\/www.goldsteinchryslerdodgejeep.com\/used-Albany-2017-Dodge-Charger-SXT-2C3CDXJG1HH516188<\/a><\/p>\n\n<p>2019 wrx premium. 25k miles. $31k, 5 speed (this is a plus in my eyes) Pretty nice but overall less bells and whistles than the charger. Smaller car overall the kids will probably be a bit more cramped but they will get over it. I think its a bit quicker and will hold its value better but like I stated I dont think its as nice of a car. It is a pretty rough ride<\/p>\n\n<p><a href=\"https:\/\/www.carbonesubaruoftroy.com\/used\/Subaru\/2019-Subaru-WRX-for-sale-Troy-NY-41f58c310a0e09b00028b8f176a15823.htm\">https:\/\/www.carbonesubaruoftroy.com\/used\/Subaru\/2019-Subaru-WRX-for-sale-Troy-NY-41f58c310a0e09b00028b8f176a15823.htm<\/a><\/p>\n\n<p>My dad said they both suck dont buy either haha.<\/p>\n\n<p>I know they are 2 very different cars but I really like both of them and having trouble deciding so ive turned to the reddit gods to help me decide. Thank you in advance for any opinions.<\/p>\n<\/div>","22":"<div class=\"md\"><p>Location: USA<\/p>\n\n<p>Price range: $5,000 - $30,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Either, preferably new<\/p>\n\n<p>Type of vehicle: Truck, sedan<\/p>\n\n<p>Must haves: Fuel efficient, reliable<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily driver\/family car, occasional use on dirt\/gravel roads, occasional use as a work vehicle<\/p>\n\n<p>Vehicles you&#39;ve already considered: Toyota Tacoma, BMW 3 series, Ford Ranger<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Totalled my car, insurance will pay me out $7,500.<\/p>\n<\/div>","23":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","24":"<div class=\"md\"><p>Does anybody have any thoughts on the new Civic Sport vs the new Camry SE? I’m considering both but don’t know a whole lot about cars, so would be interested to hear about any especially meaningful differences in tech options, performance, or MPG<\/p>\n<\/div>","25":"<div class=\"md\"><p>Location: Florida, US<\/p>\n\n<p>Price range: Under $40k<\/p>\n\n<p>Lease or buy: Buy<\/p>\n\n<p>New or used: No preference<\/p>\n\n<p>Type of Vehicle: SUV<\/p>\n\n<p>Must haves: In order of preference* AWD, &lt;7.0 0-60 mph, fuel efficiency, cargo space<\/p>\n\n<p>Transmission: Auto<\/p>\n\n<p>Intended use: Daily driver, recreational outdoor activity in all weathers (snow included!)<\/p>\n\n<p>Vehicle considered: Toyota RAV4, Bronco sport badlands, Subaru Outback onyx <\/p>\n\n<p>1st vehicle: No, currently a Toyota Camry owner<\/p>\n\n<p>Do you need a warranty: no<\/p>\n\n<p>Can you do minor work on your own vehicle: yes<\/p>\n\n<p>Major work: no<\/p>\n\n<p>Additional notes: Florida is a short term location so looking for a car that can support all outdoor hobbies. Extra points for ability to install a camper bed in the back with ease. Also enjoy the occasional extra speed boost! The RAV4 prime would be the perfect car but I don’t have the capability to charger every night. I’ve been extremely torn and any advice is super appreciated!<\/p>\n<\/div>","26":"<div class=\"md\"><p>Location: Washington State, USA<\/p>\n\n<p>Price range: 20-30k USD<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used:either<\/p>\n\n<p>Type of vehicle: Sports Coupe preferred<\/p>\n\n<p>Must haves: Smiles per gallon.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: WRX, 370z<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: no<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) Yes but I would prefer not to<\/p>\n\n<p>Additional Notes: 2k mi per month commute to work, need something fast\/fun to commute in while I turn my current daily into an actual track car.  Going to test drive 370z and wrx this weekend, wondering what else i should go drive before i decide. Must be good for highway driving at high speeds, it&#39;s a 70mph highway that I take to work, but everyone does 80-85. My 96 del sol is not a fan of these high speeds LOL<\/p>\n<\/div>","27":"<div class=\"md\"><p>I’m a kid with hopes of my first car when I can drive in 2 years. I want something that has some alright performance, and some off-road capability as well. Also it has to look cool! I’ll have money from work but I don’t wanna go over like 30.<\/p>\n\n<p>Oh, and don’t assume I need an automatic :)<\/p>\n<\/div>","28":"<div class=\"md\"><p>Looking at plug in hybrids. I have a new family and our 2009 civic is lacking cargo space.<\/p>\n\n<p>What are peoples thoughts about leasing vs buying used?<\/p>\n\n<p>My primary choice is a 2022 hyundai tucson phev (waiting list à few months).But at over $500 CAD a month for a 4 year lease its a heavy lift.<\/p>\n\n<p>For the same monthly outlay I could finance a $20k to 25k vehicle such as a Honda Clarity, hyundai ioniq or mitsubishi outlander phev and have an asset at the end of the same 4 years. But I don&#39;t love any of those cars. <\/p>\n\n<p>Plan C is to get a smaller 2021 hyundai ioniq plugin for $400 a month. Still bigger and more plactical than our civic (whose rear seats don&#39;t fold, I didn&#39;t even know that was possible)<\/p>\n<\/div>","29":"<div class=\"md\"><p>Hyundai Tucson 1.6 T-GDI 180 HP or Hyundai Kona N 2.0 T-GDI 280 HP?<\/p>\n\n<p>I have that dilemma, I can afford either one of those (new), but I&#39;m not sure which one to pick. I&#39;m in my early 30&#39;s and currently drive i30 1.4CRDI and it was a wonderful car for what I needed, but now I got bored because I&#39;m missing the thrill of some decent acceleration and speed.<\/p>\n\n<p>So I would choose Kona, but since my GF likes to travel a lot, maybe a Tucson could be a good compromise (More interior space, better off-road, lower fuel consumption and still decent performance).<\/p>\n\n<p>So my question boils down to this: Would 180 HP SUV feel fun enough to drive for me, or should I take the 280 HP Kona, and accept it&#39;s a smaller car, and forget about off-roading?<\/p>\n<\/div>","30":"<div class=\"md\"><p>hey so i am buying a 2010 prius in CA that has NY plates. does it need smog? do i follow CA guidelines to buy the car or NY since it has NY plates? i also have a VA license so can i bypass smog by just registering in VA and will it be cheaper?<\/p>\n<\/div>","31":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","32":"<div class=\"md\"><p>Location: Sask, Canada<\/p>\n\n<p>Price range: Low $30k CAD max<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Smaller SUV (maybe a car, people say they have no issues in the winter with winter tires on a car but im not sure we&#39;re driving on the same shitty roads)<\/p>\n\n<p>Must haves: 4x4 or awd<\/p>\n\n<p>Desired transmission (auto\/manual, etc): prefer auto but I could learn, small city so not too much stop and go<\/p>\n\n<p>Intended use: DD, camping, hauling kayak, minor offroading, winter capable<\/p>\n\n<p>Vehicles you&#39;ve already considered: rav4, bronco sport<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: preferred but probably won&#39;t be a deal breaker<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) no<\/p>\n\n<p>Additional Notes: Looking to trade in my ram 1500 while used prices are good and get something smaller and brand new. I&#39;ve bought a place in the city now, never really need a truck and dread getting in and out of my downtown parking every day for work. Something that has a bit of go would be nice, I haven&#39;t test driven anything but mainly looking at rav4s or bronco sport and it doesnt sound like they&#39;re too thrilling to drive and might feel like a big downgrade from a truck. That may be asking too much for my price point so I&#39;m trying to manage expectations. Interior of my truck is pretty barebones so anything will be an upgrade from that.<\/p>\n\n<p>I&#39;m not sure how I feel about the rav4 hybrid engine, haven&#39;t looked into it too much yet tbh but not sure how it will do in -40 or long road trips. I do like the storage space and it looks like i (6&#39;4&quot;) could sleep in the back with the seat down.<\/p>\n\n<p>I&#39;ve considered cars and from what I&#39;ve seen I could get better performance and interior in my budget but I feel like that&#39;s a big change from a truck, very little storage and ground clearance concerns me. Maybe a nice hatchback could win me over.<\/p>\n<\/div>","33":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","34":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","35":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","36":"<div class=\"md\"><p><strong>Location:<\/strong> (Specify your country or region)\nMidwest United States \n<strong>Price range:<\/strong> (Minimum-Maximum in your local currency)\n12k-20kUSD<\/p>\n\n<p><strong>Lease or Buy:<\/strong>\nBuy\n<strong>New or used:<\/strong>\nEither<\/p>\n\n<p><strong>Type of vehicle:<\/strong> (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)\nCar or SUV <\/p>\n\n<p><strong>Must haves:<\/strong> (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.)\nFuel efficient and id like Lane assist.<\/p>\n\n<p><strong>Desired transmission<\/strong> (auto\/manual, etc):\nEither, leaning auto. <\/p>\n\n<p><strong>Intended use:<\/strong> (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off-roading etc.)\nDaily driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong>\nI&#39;ve heavily considered plug in ev for the federal rebate in the US and the accessible chargers at my apartment. <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong>\nNo, I have had a xterra that I liked a lot and have had other smaller cars. I liked the size and height of the xterra. <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong>\nI don&#39;t know<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> (fluids, alternator, battery, brake pads etc)<\/p>\n\n<p>No, only because I don&#39;t have a space to do them. <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> (engine and transmission, timing belt\/chains, body work, suspension etc )\nNo <\/p>\n\n<p><strong>Additional Notes:<\/strong>\nIf you all think it&#39;s an awful time to buy, I&#39;d consider just doing a lease.<\/p>\n<\/div>","37":"<div class=\"md\"><p>Hi guys. I may be in the market soon for a new car; not out of desire but out of necessity. I currently have a 2014 Kia soul with 160k miles that&#39;s burning oil and I&#39;ve been told it&#39;s just a matter of time before either the exhaust or engine needs some major repairs. Anyway, here&#39;s the deal:<\/p>\n\n<p>&#x200B;<\/p>\n\n<p>Location: Orlando, FL<\/p>\n\n<p>Price Range: I currently have 18k that I can comfortably spend as cash. I&#39;d rather not finance, but if need be, I could probably up that price to 30-35k max. Buy, not lease.<\/p>\n\n<p>New or used: Not sure. I&#39;ve only ever owned used cars. I&#39;ve been told CPO is the way to go.<\/p>\n\n<p>Type of Vehicle: Sedan or crossover.<\/p>\n\n<p>Must have: Smooth ride. Turbo would be nice since Ideally I&#39;d like to have decent performance in the vehicle.<\/p>\n\n<p>Desired transmission: Auto. I can drive a manual but that&#39;d be hell in this city.<\/p>\n\n<p>Intended Use: Daily driver.<\/p>\n\n<p>Vehicles you&#39;ve considered: Mazda3, Hyundai Sonata, Kia Sorento, Toyota Camry, Honda Civic\/Accord.<\/p>\n\n<p>1st vehicle?: No.<\/p>\n\n<p>Do you need a warranty: I&#39;d like one.<\/p>\n\n<p>Can you work on it: No, I&#39;m not car savvy outside of changing a flat or adding fluids.<\/p>\n<\/div>","38":"<div class=\"md\"><p>Location: Finland, Lapland<\/p>\n\n<p>Price range: ~6k<\/p>\n\n<p>Lease or Buy: buy<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: SUV or other offroad capable vehicle<\/p>\n\n<p>Must haves: 4wd, gasoline engine, reasonably fuel efficient.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual. (Automatic is okay, if specifically known to be reliable)<\/p>\n\n<p>Intended use: Daily drive, with recurring but not daily need for 4wd capability. Will have to survive heavy and prolonged winter conditions.<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2005 Jeep Cherokee, 2007 Jeep Compass, 2007 Nissan X-trail, 2005 Honda CR-V<\/p>\n\n<p>Is this your 1st vehicle: First own. Previously shared one with my brother.<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: I have a few specific candidates:<\/p>\n\n<p><a href=\"https:\/\/www.nettiauto.com\/jeep\/cherokee\/12321303\">https:\/\/www.nettiauto.com\/jeep\/cherokee\/12321303<\/a><\/p>\n\n<p><a href=\"https:\/\/www.nettiauto.com\/jeep\/compass\/12376955\">https:\/\/www.nettiauto.com\/jeep\/compass\/12376955<\/a><\/p>\n\n<p><a href=\"https:\/\/www.nettiauto.com\/nissan\/x-trail\/12333693\">https:\/\/www.nettiauto.com\/nissan\/x-trail\/12333693<\/a><\/p>\n\n<p>Question: How big is the difference in terms of off-road capability between Jeep Cherokee and Compass? (The Compass above seems a better deal in many ways, unless Cherokee is &quot;just a more rugged vehicle&quot;. Is that so?<\/p>\n<\/div>","39":"<div class=\"md\"><p>Location: Southern California<br\/>\nPrice range: &lt;60k<br\/>\nLease or Buy: Buy<br\/>\nNew or used: New<br\/>\nType of vehicle: Sports car<br\/>\nMust haves: 4 seats(for occasional use with kids) , gas only, great exhaust sound, good acceleration and handling.<br\/>\nDesired transmission: manual only<br\/>\nIntended use: Weekend car<br\/>\nVehicles you&#39;ve already considered:<br\/>\nBMW m2 competition<br\/>\nCamaro ss 1le<br\/>\nGt350<br\/>\nOn the lower end - new brz \/ gr 86<br\/>\nIs this your 1st vehicle:No<br\/>\nDo you need a Warranty: Yes<br\/>\nCan you do Minor\/Major work on your own vehicle: No<br\/>\nLooking to buy my midlife crisis\/last gas car. Looking to keep it for 10+ years or until I get bored.  So need a sports car with good long term reliability and relatively inexpensive maintenance costs. Need a rear seat for very occasional use(big enough to fit tiny human).<br\/>\nI thought the m2 was the perfect fit with all the above considered (BMW reliability \/ maintenance is one question) but it didn’t feel special enough when I rented it. Have owned a 1ss camaro in the past and the 1le seems like a good bet. The new brz\/gr 86 seems to fit the bill on the low end too. But not sure if it feels special enough for 10+ years.<br\/>\nAre there any other obvious options I am missing?<\/p>\n<\/div>","40":"<div class=\"md\"><p>Location: Alabama<\/p>\n\n<p>Price range: 25k<\/p>\n\n<p>Lease or Buy: Buying<\/p>\n\n<p>New or used: used<\/p>\n\n<p>Type of vehicle: sports car, hatchback, or sports sedan <\/p>\n\n<p>Must haves: reliable and cost of ownership can&#39;t be outrageous.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): manual or auto<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered:\nS2000, c6 corvette, q50, wrx, gt86, focus st, mazda6, chevy ss and lexus isf.<\/p>\n\n<p>Notes: I can do basic maintenance like spark plugs, fluids and alternators. I&#39;ve only owned miatas recently and was seeing what other cars I need to test drive.<\/p>\n<\/div>","41":"<div class=\"md\"><p>Help me decide between Mazda CX 30, Hyundai Kona, Kia Seltos.<\/p>\n\n<p>Basically I want a small SUV,<\/p>\n\n<p>It would be a Lease, located in NJ<\/p>\n<\/div>","42":"<div class=\"md\"><p>Setting: Need for daily driver and occasional off road capability in northern Finland. Heavy winter conditions will be guaranteed. After lengthy digging, I&#39;ve come up with these two to decide from:  <\/p>\n\n<p><a href=\"https:\/\/www.nettiauto.com\/toyota\/rav4\/12414596\">https:\/\/www.nettiauto.com\/toyota\/rav4\/12414596<\/a>  <\/p>\n\n<p><a href=\"https:\/\/www.nettiauto.com\/toyota\/rav4\/12414596\">https:\/\/www.nettiauto.com\/jeep\/compass\/12376955<\/a>  <\/p>\n\n<p>Which? Toyota RAV4&#39;s are more reliable as a whole, but that Jeep has 70 000km less behind it. How about the off-road capabilities?<\/p>\n<\/div>","43":"<div class=\"md\"><p>Location: Phoenix, Arizona, USA<\/p>\n\n<p>Price Range: 20,000-28,000<\/p>\n\n<p>Buy<\/p>\n\n<p>Sedan, Crossover, Hatchback<\/p>\n\n<p>Must haves: Fuel efficient<\/p>\n\n<p>Transmission: Auto<\/p>\n\n<p>Intended use: Daily driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: Ioniq, Civic, Elantra, Prius Prime, Rio 5, Crosstrek<\/p>\n\n<p>Is this your 1st vehicle: First new one, had a 94 Camry that recently died :(<\/p>\n\n<p>Do you need a Warranty: Yes I would like a warranty<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Having a back row that could potentially fold down for camping in the hatchbacks would be nice but in no way a deal breaker.<\/p>\n<\/div>","44":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","45":"<div class=\"md\"><p>So I currently drive a 2003 Infinity QX4 (automatic), and a 2001 Miata (maual). I love the Miata more than anything, but hate my QX4. I want to sell it and get a better daily, so I can work on the Miata and leave it on jackstands for weeks and still get to and from work.<\/p>\n\n<p>The predicament I&#39;m in is whether to look for an auto or manual daily. I want a fun sporty sedan from the 90s-early 2000s, and as a car guy, I have a long list of dream sedans I would love to have that fit these needs. e36, e46, e30, Mazdaspeed Protege, Civic, Camry, etc, the list goes on.<\/p>\n\n<p>I love the Miata and have dailyed it at times, and it wasn&#39;t too bad, i enjoy driving and having fun getting through traffic and I have a decently twisty commute to work. However, I live with my girlfriend (who can drive stick around the parking lot), but she wouldn&#39;t drive my car on the streets, as she is not comfortable driving stick, and doesn&#39;t really care to get better. This means if I ever borrow her car, she can&#39;t borrow either of mine. This, along with the fact that in the long run, I&#39;ll probably get sick of the manual at times (longer road trips, late at night when I&#39;m tired, after leg day at the gym, etc.), and if I really want to have a fun drive, I have the Miata to take.<\/p>\n\n<p>The QX4 works great being an auto, but I feel like if i got a sedan I really like and put some subtle mods (coilovers, wheels, and the such), I&#39;d be like &quot;Damn if only this were manual.&quot; It would just feel so wasteful getting a car I&#39;ve been dreaming of, just to get it in automatic, but the perks of automatic entice me.<\/p>\n<\/div>","46":"<div class=\"md\"><p>Location: Texas, USA<\/p>\n\n<p>Price range: $30,000 - $45,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Medium SUV\/truck(?)<\/p>\n\n<p>Must haves: Storage space, Android\/Apple Auto, AWD, Decently fast\/Hybrid\/Electric<\/p>\n\n<p>Desired transmission: auto <\/p>\n\n<p>Intended use: Daily Driver, possibly a bit of light towing <\/p>\n\n<p>Vehicles you&#39;ve already considered: Mazda CX-5, Ford Maverick <\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: Factor warranty is fine. <\/p>\n\n<p>Can you do Minor work on your own vehicle: Prefer to pay someone to do it<\/p>\n\n<p>Can you do Major work on your own vehicle: No.<\/p>\n\n<p>Additional Notes:<\/p>\n\n<ol>\n<li>​price range is a bit flexible.<\/li>\n<li>Need enough storage space to fit my dog&#39;s crate on road trips (he gets car sick) <\/li>\n<li>AWD is not a MUST HAVE, but is definitely a Nice To Have.<\/li>\n<li>Speed\/Hybrid\/Electric are not all three required, but it must have one of the three. (My current car, a 2016 Subaru Outback, goes 0-60 in about 12 seconds and that&#39;s gotten a bit old) <\/li>\n<li>I <em>can<\/em> drive a manual, but I don&#39;t think there are many being made in the medium size at this point, and I prefer manual anyways.<\/li>\n<li>&quot;Light towing&quot; means &quot;I might buy a teardrop trailer and take the dogs camping some time some day&quot;.<\/li>\n<li>Mazda CX-5 was fun to drive, but it didn&#39;t quite have enough zing to make it worth the price<\/li>\n<li>I liked the idea of the Maverick, but the dealership I asked said ordering now would probably put it about 9 months out to delivery, which is just a bit too far. <\/li>\n<li>I used to drive an F-150, but it was just too big to be fun to drive, which is why the Maverick appealed to me.<\/li>\n<\/ol>\n<\/div>","47":"<div class=\"md\"><p>Location: Charlotte, NC<\/p>\n\n<p>Price range: ~50000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: New<\/p>\n\n<p>Type of vehicle: Sedan or <em>roomy<\/em> coupe.<\/p>\n\n<p>Must haves: Comfortable\/natural position for diver&#39;s right leg, good noise isolation, sporty drive dynamics, AWD or RWD, modern\/high-trim monitoring features.<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual preferred, but not required<\/p>\n\n<p>Intended use: Daily<\/p>\n\n<p>Vehicles you&#39;ve already considered: WRX, Stinger GT, G70, 3-Series<\/p>\n\n<p>Is this your 1st vehicle: No.<\/p>\n\n<p>Do you need a Warranty: Yes.<\/p>\n\n<p>Can you do Minor work on your own vehicle: No.<\/p>\n\n<p>Can you do Major work on your own vehicle: No.<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>I really enjoy my Toyota 86 but it hurts me. Long drives mess up my knee, back, and hip in a big way, to the point where I need to trade it for something with more natural\/relaxed ergonomics. My vision is also not great, and I suffer from migraines that reduce my ability to pay attention to the environment, so I want a car that can pick up the slack for me and help filter out the drive noise for when I&#39;m having a bad day but still need to drive. I would like a functional backseat, but it&#39;s not a main focus; it&#39;s okay if it&#39;s not something I&#39;d want to roadtrip someone in, but I&#39;d like it to be something an adult can at least tolerate a 20 minute drive in.<\/p>\n<\/div>","48":"<div class=\"md\"><p>Location: Grand Forks, ND<\/p>\n\n<p>Price range: $4,500 - $11,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: Coupe or Sedan<\/p>\n\n<p>Must haves: AWD<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: Daily Driver<\/p>\n\n<p>Vehicles you&#39;ve already considered: 2008 Audi A4 3.2L quattro<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: Yes <\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>I need a car that can take snowy - icy weather for when I move up to North Dakota. I can do most of the work on it but I don&#39;t know what to even look for.<\/p>\n<\/div>","49":"<div class=\"md\"><p>[entfernt]<\/p>\n<\/div>","50":"<div class=\"md\"><p>Location: Bay Area California <\/p>\n\n<p>Price Range: min 500, max 5500<\/p>\n\n<p>Lease or Buy: buy<\/p>\n\n<p>New or used: used unless there’s new cars for less than 5500 LOL<\/p>\n\n<p>Types of vehicle: wagon, hatchback, , coupe, basically anything but a truck\/minivan\/large SUV<\/p>\n\n<p>Must haves: relatively good mpg, and be a little cool at least<\/p>\n\n<p>Desired transmission: either<\/p>\n\n<p>Intended use: Daily Driver\/could be more project-y as I want to learn more about cars<\/p>\n\n<p>Vehicles you’ve already considered: 1990s miata mx-5 (I don’t love that its so tiny), 90s-2000s Volvo v40s (scarce), 1986 Nissan 300zx (dream car but I heard working in the engine bay is shit, most considered rn), honda cr-v (they’re reliable and convenient but not aesthetically what i want)<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Do you need a Warranty: no :,) but itd be nice<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes, and I have family members who are also really in to cars too so minor work won’t be a problem<\/p>\n\n<p>Can you do major work on your own vehicle: probably not, depending on what it is<\/p>\n\n<p>Additional notes:\n- both my dad and my brother are big on ford mustangs, and know intricately how to take apart different gen engines if need be\n-preferably older cars (80s-2000s) \n- does not need to have 4 seats but would be preferable! \n- i fucking love pop up headlights so if there are any suggestions with them you bet ill look it up at least<\/p>\n<\/div>","51":"<div class=\"md\"><p>Location: USA<br\/>\nPrice range: 0-90K USD<br\/>\nLease or Buy: Buy<br\/>\nNew or used: Either<br\/>\nType of vehicle: Sports car or Race car<\/p>\n\n<p>Must haves: fast! and good looking<br\/>\nDesired transmission (auto\/manual, etc): Either<br\/>\nIntended use: Weekend Car and Track Toy<\/p>\n\n<p>Vehicles you&#39;ve already considered: Amg Gt, Audi R8<br\/>\nIs this your 1st vehicle: No<br\/>\nDo you need a Warranty: No<br\/>\nCan you do Minor work on your own vehicle: No<br\/>\nCan you do Major work on your own vehicle: No<\/p>\n<\/div>","52":"<div class=\"md\"><p>Location: SLC, Ut<\/p>\n\n<p>Price range: Max $10k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: I love the idea of a luxury\/sports sedan but pretty much anything is on the table. I really don’t care for SUVs or crossovers but I’m sure the right one could sway me<\/p>\n\n<p>Must haves: Reliability has to be priority #1 but I would love something with nice driving dynamics and a little bit of lower-end torque for city driving<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Manual preferred but not mandatory. I would rather get something a little sporty with an auto than a boring stick<\/p>\n\n<p>Intended use: Daily + Weekend fun car<\/p>\n\n<p>Vehicles you&#39;ve already considered: miata, infiniti g35\/37, volvo s60, ford taurus, subaru wrx, mini cooper<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: Super basic things like battery and oil are manageable but I have very little in the way of tools and know-how<\/p>\n\n<p>Can you do Major work on your own vehicle: No<\/p>\n\n<p>Additional Notes: Currently driving a turbo’d ‘94 miata and love it to death. Would absolutely drive it to the grave but the cost of maintaining a modded vehicle are proving to be steeper than I can accommodate. The original owner got forged rods and pins, turbo, AEM series 2 ecu, suspension, clutch, exhaust all aftermarket and I’m sure a few others things I’m forgetting but it ended up sitting in a shed for almost a decade. Been getting it back into shape and dailying it over the last 2 years but I think I have to accept the fact that paying a shop for diagnostics, parts and labor on a modded vehicle everytime something rusts out isn’t sustainable.<\/p>\n\n<p>I know nothing in my price range is going to compete with this car, especially with the markets as they are but I have to get something with at least a little bit of fun factor that I can in good conscience show my wife to make it easier to let go of my current car. We’re considering selling mine now while the market is crazy and waiting a few months to see if it cools down at all, should we have any reason to believe used cars are going to be closer to sane prices in 6 months?<\/p>\n\n<p>Tangential, but I also need help pricing the miata lol. Only found 2 working turbo’d ones for sale on a nationwide craigslist search and they were like $12k. Mine is in worse shape cosmetically and mechanically (huge dent behind driver side door, spews oil etc) but only 74k miles<\/p>\n<\/div>","53":"<div class=\"md\"><p><strong>Location:<\/strong> Tri-State area, USA<strong>Price range:<\/strong> lease deal up to $325\/month with around $1,500-$2,000 down before taxes, titles, and other fees<strong>Lease or Buy:<\/strong> Lease<strong>New or used:<\/strong> New<strong>Type of vehicle:<\/strong> anything but an SUV<\/p>\n\n<p><strong>Must haves:<\/strong> safety package (auto braking, lane assist, etc.); sunroof\/moonroof options (Mustang is the only car I would consider that does not have this option); good mpg; Apple CarPlay<\/p>\n\n<p><strong>Desired transmission (auto\/manual, etc):<\/strong> Auto<\/p>\n\n<p><strong>Intended use:<\/strong> Daily driver<\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> Kia Forte and K5 (test drove both, was unimpressed but would have considered if they weren&#39;t asking for $389\/month), Ford Mustang EcoBoost (really liked it but haven&#39;t been able to find anything under $400\/month)<\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> No<\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> Yes<\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> No<\/p>\n\n<p><strong>Additional Notes:<\/strong><\/p>\n\n<p>I would also want the exterior to look nice and sleek and maybe even a bit sporty, even if it&#39;s not a sports car. I just gave back the Chevy Malibu I was leasing a few months ago and some things I liked about it was that it had a moonroof, had good mpg, had a sleek kind of sporty exterior, and actually had pretty good pickup.<\/p>\n\n<p>If I can&#39;t find anything I like within the budget I&#39;m working with right now, I&#39;ll probably consider leasing another Malibu because we think that they would be more likely to give us close to the lease price we were paying before ($298\/month) since we&#39;ve just leased with them and are frequent Chevy customers.<\/p>\n<\/div>","54":"<div class=\"md\"><p>my company is probably going to a car allowance, All I really car about is resale value so narrowed it down to Rav4, CR-V and Forester.  Out of those 3, which is my best bet to get one quickly?  thanks in advance<\/p>\n<\/div>","55":"<div class=\"md\"><p>Location: PH <\/p>\n\n<p>Price range: 22k USD or roughly 2 million pesos <\/p>\n\n<p>Lease or Buy:Buy<\/p>\n\n<p>New or used: Used <\/p>\n\n<p>Type of vehicle: (sedan,pickup or suv )<\/p>\n\n<p>Must haves: Navigation and Fuel Efficient <\/p>\n\n<p>Desired transmission (auto or manual ) <\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car ) <\/p>\n\n<p>Vehicles you&#39;ve already considered:<\/p>\n\n<p>Is this your 1st vehicle:<\/p>\n\n<p>Do you need a Warranty: Insurance yes <\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads) probable yes <\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension ) if you have the knowledge to do this it would reduce the cost of changing that part<\/p>\n<\/div>","56":"<div class=\"md\"><p>[gelöscht]<\/p>\n<\/div>","57":"<div class=\"md\"><p>Location: Saudi arabia, KSA<\/p>\n\n<p>price: 25k-30k (us dollars) roughly 90k-120k riyals<\/p>\n\n<p>Preferbly new and bought<\/p>\n\n<p>Type: suv, crossover<\/p>\n\n<p>Must haves: fuel efficient, overall good interior<\/p>\n\n<p>Intended use: daily driver<\/p>\n\n<p>Ive considered: VW t-roc, mazda cx-30<\/p>\n\n<p>Im a college student and this will be my first car so i need somthing that is does the job while looking good not cool but good cuz you know…<\/p>\n<\/div>","58":"<div class=\"md\"><p>Location: SE Ohio<\/p>\n\n<p>Price range: (Minimum-Maximum in your local currency) Around $40,000, also looking at a few more expensive options<\/p>\n\n<p>Lease or Buy:  Buy<\/p>\n\n<p>New or used:  Considering new since used market so high <\/p>\n\n<p>Type of vehicle: (Truck, Car, Sports Car, Sedan, Crossover, SUV, Racecar, Luxury etc.)<\/p>\n\n<p>Looking at two door Jeep wranglers, charger, camaro, something fun to drive but need to be able to put carseats in the back.<\/p>\n\n<p>Brother in law got a Tesla and that&#39;s cool too, making me think about it.<\/p>\n\n<p>Must haves: (4x4, AWD, Fuel efficient, Navigation, Turbo, V8, V6, Trunk space, Smooth ride, Leather etc.)<\/p>\n\n<p>Something fun to drive but need to be able to put carseats in the back.  Needs to be reasonable in the snow because I live on a hill, but my 10 year old lexus es350 does fine<\/p>\n\n<p>Desired transmission (auto\/manual, etc):  Either, grew up driving a stick. <\/p>\n\n<p>Intended use: (Daily Driver, Family Car, Weekend Car, Track Toy, Project Car, Work Truck, Off-roading etc.)<\/p>\n\n<p>Daily driver, pick up kids, we use my wife&#39;s truck for most long trips <\/p>\n\n<p>Vehicles you&#39;ve already considered:  Looking at Jeep wranglers, camaro, charger, I currently drive a Lexus, but the luxury market is all ugly hatchbacks and soccer mom &quot;suvs&quot; that I simply do not like the look of.  <\/p>\n\n<p>I like acuras, but even acura dealerships aren&#39;t stocking them? <\/p>\n\n<p>I really don&#39;t want a hatchback or small SUV which seems to be most of the car market these days. <\/p>\n\n<p>Is this your 1st vehicle: no <\/p>\n\n<p>Do you need a Warranty: don&#39;t care<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc) - no<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) - no<\/p>\n\n<p>Additional Notes:<\/p>\n\n<p>Looking for guidance from Camaro\/Charger owners on how front facing carseats fit in the back.<\/p>\n\n<p>Looking for guidance on how to buy a two door jeep when the used ones all cost more than the new MSRP and the new ones are all ordered with $15,000 of nonsense accessories and four doors.  SHould I just custom order the one I want (which I think will be MSRP around $35k?)<\/p>\n\n<p>Anyone with a Tesla got any thoughts on that.  It would be around $20,000 more than the other options I am looking at, but obviously gas costs would be less and if I got a new one it would last long than a used muscle car or a jeep most likely.<\/p>\n<\/div>","59":"<div class=\"md\"><p>Location: Florida<\/p>\n\n<p>Price range: $50K max<\/p>\n\n<p>Lease or Buy: prefer leasing<\/p>\n\n<p>New or used: new<\/p>\n\n<p>Type of vehicle: preference would be a sports sedan, maybe a hatch<\/p>\n\n<p>Must haves: I’d like something under 5.0 0-60, 4 door<\/p>\n\n<p>Desired transmission (auto\/manual, etc): ok with either<\/p>\n\n<p>Intended use: work from home so I’d say “weekend driver”, I wouldn’t be putting many miles on it but still use it for weekend errands<\/p>\n\n<p>Vehicles you&#39;ve already considered: just started looking<\/p>\n\n<p>Is this your 1st vehicle: no<\/p>\n\n<p>Do you need a Warranty: I’m only considering leasing so it’d be under warranty<\/p>\n\n<p>Can you do Minor work on your own vehicle: yes<\/p>\n\n<p>Can you do Major work on your own vehicle: no<\/p>\n\n<p>Additional Notes: currently have a 2019 Charger RT, lease is up in 10 months but carmax gave me a quote for 8K over buyout price (Chrysler financial still accepts 3rd party buyouts so no issues there). Thinking of maybe trying something from the European line up, I can use 2-3K from selling my Charger for cash DAS, but still would like to get into something at or under $50K.<\/p>\n<\/div>","60":"<div class=\"md\"><p>Location: Massachusetts <\/p>\n\n<p>Price range: &lt;20k usd <\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Used<\/p>\n\n<p>Type of vehicle: idrk <\/p>\n\n<p>Must haves: idrk other than looks cool and not looking for something super modern<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Prefer manual<\/p>\n\n<p>Intended use: Learn more about cars and for travel <\/p>\n\n<p>Vehicles you&#39;ve already considered: 95 Honda inspire, Acura integer Type-R, Mitsubishi 3000gt(found them on the internet and thought they looked dope af)<\/p>\n\n<p>Is this your 1st vehicle: yes<\/p>\n\n<p>Do you need a Warranty: No<\/p>\n\n<p>Can you do Minor work on your own vehicle: I hope to start doing so with this car<\/p>\n\n<p>Can you do Major work on your own vehicle: Dont currently have the tools\/space<\/p>\n\n<p>Additional Notes: just turned 16 and my moms been pushing for me to get a car especially seeing as I just got a car recently so idrk too much bout cars all I know is I want a like 90s styles Japanese car I see all over the internet (Ik generic but I think they look cool)<\/p>\n<\/div>","61":"<div class=\"md\"><p>I&#39;ve got about $8k to spend on a 4wd SUV. A lot of the stuff popping up around CO are &#39;03-&#39;07 Pilots, MDXs, Pathfinders, and Highlanders with 130k-170k miles. What are the most reliable SUVs I should be looking for in this price range?<\/p>\n<\/div>","62":"<div class=\"md\"><p>Location: LA, California <\/p>\n\n<p>Prices range: $15-20k ( UNI student )<\/p>\n\n<p>Buy\/ Lease: Buy<\/p>\n\n<p>New\/Used: Idk interested in both if possible <\/p>\n\n<p>Type of vehicle: Sedan, Crossover ( As long as it looks good 👌🏼) <\/p>\n\n<p>Must have: Fuel efficient, Navigation, Smooth Ride, AC<\/p>\n\n<p>Desired Transmission: Auto<\/p>\n\n<p>Vehicles considers: Honda civic, Volkswagen sedan (Jetta) <\/p>\n\n<p>1st vehicle: Yes<\/p>\n\n<p>Do you need Warranty: preferred ( Would still consider if it’s a good deal)<\/p>\n\n<p>Can you do minor\/ major work: No, don’t know cars like that but I want to learn<\/p>\n\n<ul>\n<li>I appreciate any help that anyone can provide, god bless have a nice day.<\/li>\n<\/ul>\n<\/div>","63":"<div class=\"md\"><p>How important is adaptive cruise control in city driving?<\/p>\n<\/div>","64":"<div class=\"md\"><p>Location: Southern USA<\/p>\n\n<p>Price range: up to $70,000<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Doesn&#39;t matter<\/p>\n\n<p>Type of vehicle: SUV<\/p>\n\n<p>Must haves: Leather, Apple Car Play, 400+ hp<\/p>\n\n<p>Desired transmission (auto\/manual, etc): Auto<\/p>\n\n<p>Intended use: (Daily Driver, Family Car)<\/p>\n\n<p>Vehicles you&#39;ve already considered: MB GLC63, Alfa Romeo Stelvio QV, Tesla Model Y, Rivian R1S, Ford F150 lightning, Mustang Mach E GT Performance<\/p>\n\n<p>Is this your 1st vehicle: No<\/p>\n\n<p>Do you need a Warranty: It would be nice but not deal breaker<\/p>\n\n<p>Can you do Minor work on your own vehicle: (fluids, alternator, battery, brake pads etc): Yes<\/p>\n\n<p>Can you do Major work on your own vehicle: (engine and transmission, timing belt\/chains, body work, suspension etc ) No<\/p>\n\n<p>Additional Notes: I love the driving aspect of the MB GLC63 but there is a tiny rub on my right knee where the waterfall dash is. Driving the Alfa is ethereal but I&#39;m so worried about the reliability issues i keep hearing about, interior is a bit meh.  The performance of the Tesla is really fun but there are some quality issues to note and not sure if I should wait for 4680 battery pack. The Rivian seems like the most fun but it would stretch the budget and their network is not as established as Tesla. I love their interior colors and choices and the adventure aspect, would also get the EV tax credit on this too.  All in all i want something i can drive spirited but also that is safe and can hold my family.<\/p>\n<\/div>","65":"<div class=\"md\"><p>Location: New Jersey, USA<\/p>\n\n<p>Price range: &lt; $40k<\/p>\n\n<p>Lease or Buy: Buy<\/p>\n\n<p>New or used: Preferably new, open to used<\/p>\n\n<p>Must haves: Leg room (6&#39;4&quot;)<\/p>\n\n<p>Desired transmission: Auto<\/p>\n\n<p>Intended use: Daily driver, commute<\/p>\n\n<p>Vehicles already considered: N\/A<\/p>\n\n<p>First vehicle: Yes<\/p>\n\n<p>Warranty: No<\/p>\n\n<p>Minor\/Major work: No<\/p>\n<\/div>","66":"<div class=\"md\"><p>Location: Michigan\nIs this your first car?: No\nPrice range: up to 5k\nNew or used: used\nDesired transmission: manual\nUse of the car: daily driver, fun car to drive around in\nMust haves: none, i would prefer awd or fwd as it does snow around here \nType of car: sedan, coupe, sports car, luxury \nCan you do major\/minor work?: Yes<\/p>\n<\/div>","67":"<div class=\"md\"><p>Car: Audi a4 2003 3.0T Cabriolet convertible.<br\/>\nLocation: Canada<br\/>\nPrice: 10000 (likely pushable to 9500)<br\/>\nBuy: buy<br\/>\nmust have: Reliable, okay fuel mileage.<\/p>\n\n<p>Desired transmission: automatic<br\/>\nIntended use: short commutes. To work and back, some driving with friends<br\/>\nKilometers\/miles: 50000KM\/30000 miles<br\/>\nCan you do minor work: Yes<br\/>\nCan you do major work: no<br\/>\nIs this your first vehicle: yes.<br\/>\nAdditional notes: seems summer driven.<\/p>\n<\/div>","68":"<div class=\"md\"><p>Location: Fredericton, New Brunswick, Canada <\/p>\n\n<p>Price range: $8k-$13k CAD <\/p>\n\n<p>Lease or Buy: Buy\/Trade <\/p>\n\n<p>New or used: used <\/p>\n\n<p>Type of vehicle: Crossover\/SUV <\/p>\n\n<p>Must haves: AWD, cargo space, fuel efficiency <\/p>\n\n<p>Desired transmission (auto\/manual, etc): automatic <\/p>\n\n<p>Intended use: Daily Driver\/Family car <\/p>\n\n<p>Vehicles you&#39;ve already considered: <\/p>\n\n<p>Is this your 1st vehicle: No <\/p>\n\n<p>Do you need a Warranty: No <\/p>\n\n<p>Can you do Minor work on your own vehicle: to an extent <\/p>\n\n<p>Can you do Major work on your own vehicle: No <\/p>\n\n<p>Additional Notes: Gas is up and doesn&#39;t look like it&#39;ll be coming down anytime soon and I&#39;ve just had my first child so I&#39;ve decided it&#39;s time to trade in my 2012 GMC Sierra and get something a little more practical and fuel efficient. My Sierra has ~197,000 km on it and I&#39;m hoping it covers the bulk of the cost of it&#39;s replacement. <a href=\"https:\/\/www.eastcoastwheels.ca\/usedcars\/\">This dealer<\/a> is my best local option for my price range. In particular I&#39;m considering their 2012 Mitsubishi Outlander (9k), 2011 Subaru forester (10k), and the 2014 Hyundai tuscon (12k) but I&#39;m open to any and all suggestions and recommendations. Thanks in advanced for any advice you can offer!<\/p>\n<\/div>","69":"<div class=\"md\"><p>Hi all, <\/p>\n\n<p>I wanted to get some idea of whether it would be a good idea to buy a used Hyundai Ioniq EV with a radiator and bumper replaced. Compared to an ICE, it seems like radiators as not as important. Nevertheless, I would still think it is quite important for the functionality and maintenance of the car. Would really appreciate some feedback. <\/p>\n\n<p>If I were to go ahead with the purchase, how much should I take off the list price? <\/p>\n\n<p>Located in BC, Canada. <\/p>\n\n<p>Thank you!<\/p>\n<\/div>","70":"<div class=\"md\"><p>hey guys, <\/p>\n\n<p>kiwi here. I&#39;m on the fence with 2 options, one being a 2012 Audi s4 advant with around 110k miles for about 13k usd. the other is a 300zx z32 tt around the same mileage for about 16k usd. <\/p>\n\n<p>Audi would be the more sensible choice for comfort and possibly maintenance a little bit quicker also with modern tech.<\/p>\n\n<p>the z32 is a dream car and they&#39;re only going up in price and would bring me more joy still a good ride but wouldn&#39;t have the modern luxuries which isn&#39;t a deal breaker.<\/p>\n<\/div>","71":"<div class=\"md\"><p>Stick to your german engineering always reliable<\/p>\n<\/div>","72":"<div class=\"md\"><p><strong>Location:<\/strong> Waterloo Iowa <\/p>\n\n<p><strong>Price range:<\/strong> don’t really have a minimum but 8k is the max <\/p>\n\n<p><strong>Lease or Buy:<\/strong> buy<\/p>\n\n<p><strong>New or used:<\/strong> used <\/p>\n\n<p><strong>Type of vehicle:<\/strong> car<\/p>\n\n<p><strong>Must haves:<\/strong> either a V8 or a 4Cylinder <\/p>\n\n<p><strong>Desired transmission<\/strong> auto <\/p>\n\n<p><strong>Intended use:<\/strong> daily <\/p>\n\n<p><strong>Vehicles you&#39;ve already considered:<\/strong> I’ve been looking at charger R\/Ts but I also kinda want a four door 4Cylinder that’s pretty fast <\/p>\n\n<p><strong>Is this your 1st vehicle:<\/strong> no <\/p>\n\n<p><strong>Do you need a Warranty:<\/strong> no <\/p>\n\n<p><strong>Can you do Minor work on your own vehicle:<\/strong> yea <\/p>\n\n<p><strong>Can you do Major work on your own vehicle:<\/strong> to a certain extent but noting crazy like rebuilding the engine <\/p>\n\n<p><strong>Additional Notes:<\/strong>\nI want a Charger R\/T for the speed but I’ve been considering a 4Cylinder a lot lately but I don’t wanna lose out on that V8 speed<\/p>\n<\/div>","73":"<div class=\"md\"><p>Financing my first pre owned vehicle. Is this a good deal?<\/p>\n\n<p>Visited some local dealerships and found a 2012 Jeep Liberty . 53k miles , a little over $15k total so I’m looking at 2-3K down and around $350 per month. Is this as good as it sounds to me? <\/p>\n\n<p>The one thing that bothers me is the mpg. 15 city 21 highway. I’m buying the car because I’m moving from NY to Tennessee. Should I just take a uhaul and maybe find a better deal in TN?<\/p>\n<\/div>","74":"<div class=\"md\"><p>i&#39;m thinking e quadracycle with pedals<\/p>\n<\/div>","75":"<div class=\"md\"><p>Location: Colorado, USA<\/p>\n\n<p>Price range: Max $40k USD<\/p>\n\n<p>Lease or Buy: Debating the merits of both. I think we might live in a PHEV world in 3 to 5 years, so a lease is attractive for now, plus, I could cheaply lease something like a CX-30 for 3 years and ditch it before all the subscriptions kick in. Or I could buy something like the Trailhawk or Subaru that really hold their value decently well out here.<\/p>\n\n<p>New or used: In this market, leaning towards new since I can wait for it to come in and used is tending to be highly expensive anyway (or unavailable)<\/p>\n\n<p>Type of vehicle: Car, small SUV, or crossover. Nothing bigger than a Cherokee KL, for example<\/p>\n\n<p>Must haves: AWD or 4x4, space for a kid carseat, PWR of 1:18 or better preferably, 25+mpg, some amount of ground clearance, android auto \/ carplay, relatively quiet ride, adaptive cruise control, prefer some premium sound system, decent reliability as I already have a project carDesired transmission (auto\/manual, etc): Either is fine<\/p>\n\n<p>Intended use: 90% commuting and visiting family on roads that are cracked and badly paved but have 75+mph speed limits but also have traffic jams in high heat and bitter cold sometimes. Merge ramps onto highways can take you from a stop to 70mph in a quarter mile. Also needs to be capable of getting up into the snowy or dirt road mountain roads occasionally (and out of a snowed in subdivision).<\/p>\n\n<p>Vehicles you&#39;ve already considered: Mostly looking at the Cherokee Trailhawk, Subaru Legacy Touring XT (ventilated seats are a nice bonus), Subaru WRX Premium, and the Mazda CX-30 Turbo Premium<\/p>\n\n<p>Is this your 1st vehicle: Not remotely<\/p>\n\n<p>Do you need a Warranty: Not particularly, but new, so ...<\/p>\n\n<p>Can you do Minor work on your own vehicle: Absolutely<\/p>\n\n<p>Can you do Major work on your own vehicle: Yep, but would prefer less breakage on this car<\/p>\n\n<p>Additional Notes: Considered the Bronco Sport Badlands, but had a ton of road noise and a high sticker price with bad gas mileage. The Rav4 Prime might be awesome, but it&#39;s impossible to get. The Mazda CX-5 is an option, but felt a bit like a minivan compared to the CX-30. Hyundai Kona N Line was kind of cool but dear got the absolute slowness from a stop was a deal breaker (brilliant once you were doing more than 5mph).<\/p>\n\n<p>&#x200B;<\/p>\n\n<p>Also interested in opinions on the cars I&#39;m mostly considering ... one vs the other or why not to get one or the other.<\/p>\n<\/div>","76":"<div class=\"md\"><p>I just testdrove two mazda 3s 2015 and 2018 with 2 liter engine.<\/p>\n\n<p>The motor noice sounds so high compared to other cars ive tried like audi a3 2012 diesel 1.6 for example.<\/p>\n\n<p>Is this a thing with mazda 3s 2014-2018 that the gas engine is very noicy?<\/p>\n<\/div>"},"comment_toplevel":{"0":1,"1":1,"2":1,"3":1,"4":1,"5":1,"6":1,"7":1,"8":1,"9":1,"10":1,"11":1,"12":1,"13":1,"14":1,"15":1,"16":1,"17":1,"18":1,"19":1,"20":1,"21":1,"22":1,"23":1,"24":1,"25":1,"26":1,"27":1,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":1,"72":1,"73":1,"74":1,"75":1,"76":1},"comment_distinguished":{"0":null,"1":null,"2":null,"3":null,"4":null,"5":null,"6":null,"7":null,"8":null,"9":null,"10":null,"11":null,"12":null,"13":null,"14":null,"15":null,"16":null,"17":null,"18":null,"19":null,"20":null,"21":null,"22":null,"23":null,"24":null,"25":null,"26":null,"27":null,"28":null,"29":null,"30":null,"31":null,"32":null,"33":null,"34":null,"35":null,"36":null,"37":null,"38":null,"39":null,"40":null,"41":null,"42":null,"43":null,"44":null,"45":null,"46":null,"47":null,"48":null,"49":null,"50":null,"51":null,"52":null,"53":null,"54":null,"55":null,"56":null,"57":null,"58":null,"59":null,"60":null,"61":null,"62":null,"63":null,"64":null,"65":null,"66":null,"67":null,"68":null,"69":null,"70":null,"71":null,"72":null,"73":null,"74":null,"75":null,"76":null},"comment_edited":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":1632436290.0,"20":false,"21":false,"22":false,"23":false,"24":1632151246.0,"25":1632186610.0,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":1632228322.0,"36":false,"37":false,"38":false,"39":false,"40":1632352669.0,"41":false,"42":1632355399.0,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":1632430314.0,"51":false,"52":1632498866.0,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":1632618781.0,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false},"comment_is_submitter":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false},"comment_score":{"0":6,"1":7,"2":4,"3":5,"4":5,"5":5,"6":3,"7":3,"8":3,"9":3,"10":2,"11":2,"12":2,"13":2,"14":2,"15":2,"16":2,"17":2,"18":2,"19":2,"20":2,"21":2,"22":2,"23":2,"24":1,"25":1,"26":1,"27":0,"28":1,"29":1,"30":1,"31":1,"32":1,"33":1,"34":1,"35":1,"36":1,"37":1,"38":1,"39":1,"40":1,"41":1,"42":1,"43":1,"44":1,"45":1,"46":1,"47":1,"48":1,"49":1,"50":1,"51":1,"52":1,"53":1,"54":1,"55":1,"56":1,"57":1,"58":1,"59":1,"60":1,"61":1,"62":1,"63":1,"64":1,"65":1,"66":1,"67":1,"68":1,"69":1,"70":1,"71":-5,"72":-2,"73":0,"74":0,"75":0,"76":0},"comment_stickied":{"0":false,"1":false,"2":false,"3":false,"4":false,"5":false,"6":false,"7":false,"8":false,"9":false,"10":false,"11":false,"12":false,"13":false,"14":false,"15":false,"16":false,"17":false,"18":false,"19":false,"20":false,"21":false,"22":false,"23":false,"24":false,"25":false,"26":false,"27":false,"28":false,"29":false,"30":false,"31":false,"32":false,"33":false,"34":false,"35":false,"36":false,"37":false,"38":false,"39":false,"40":false,"41":false,"42":false,"43":false,"44":false,"45":false,"46":false,"47":false,"48":false,"49":false,"50":false,"51":false,"52":false,"53":false,"54":false,"55":false,"56":false,"57":false,"58":false,"59":false,"60":false,"61":false,"62":false,"63":false,"64":false,"65":false,"66":false,"67":false,"68":false,"69":false,"70":false,"71":false,"72":false,"73":false,"74":false,"75":false,"76":false},"author_id":{"0":"1db3t7dx","1":"7dey3ot7","2":"3iws8rue","3":"847l64bw","4":"14ifff","5":"1090aa","6":"eh2wx","7":"ehhiclsw","8":"uukzwgh","9":"d3x08","10":"g2woq","11":"g7m93","12":"1dzvtdqa","13":"cfim2hbi","14":"4aslm","15":"3m64wg40","16":"8zdpata5","17":"2rwvk79n","18":"78b82shx","19":"9s0o2l57","20":"z46ht","21":"176qfm","22":"gq410","23":"","24":"q0ad2tc","25":"4f5ex5a3","26":"49u44","27":"3k0g3xch","28":"ef0ziqiw","29":"5e4c6iyv","30":"973122c1","31":"","32":"bkclt","33":"","34":"","35":"","36":"g5bw8","37":"hfl1q","38":"4lem59wz","39":"2qbflo9v","40":"eupv7","41":"g9azi86","42":"4lem59wz","43":"2dc06d5j","44":"","45":"112pw8","46":"dxs7w","47":"yjcj2","48":"1miqfhws","49":"","50":"cvlt88dt","51":"ercv370p","52":"71xx03z4","53":"5rjzxlpu","54":"3blq8zz1","55":"8wdgrc27","56":"","57":"4ao8an6b","58":"a9ip2","59":"a5gm7","60":"50ix6xkx","61":"f6yqr","62":"6fmrz6h4","63":"53t52k4w","64":"1yrlkfn0","65":"5i3km73c","66":"3489m5pp","67":"1kjkpqy1","68":"3c9rsi8n","69":"1a91p0bz","70":"ae47gh6q","71":"9v8frb47","72":"86n5em23","73":"","74":"","75":"rkkv5","76":"53t52k4w"},"author_name":{"0":"hussar966","1":"thatonegirl_k","2":"Chilabo","3":"Akalenedat","4":"WeLikeSporkSporks","5":"Anurse1701","6":"hrbuchanan","7":"unclealbert4","8":"Flurb789","9":"thathalf-blackguy","10":"WeCanDoTheDirty","11":"TheOnlyOneWhoKnows","12":"XMythicalFrogX","13":"IAmAtHomeBlogging","14":"k2h7","15":"Esketitititit","16":"Dopey_Bandaid","17":"Dandorbicus","18":"Comfortable_Date2862","19":"Islandflava","20":"Polar_00","21":"GregortheMad","22":"VengefulKenny","23":"","24":"EssJayJay","25":"obamachairs","26":"bandwidthpirate","27":"Shaniac_C","28":"faizimam1","29":"VirtualMage","30":"deezycalifornia","31":"","32":"SumTingWong59","33":"","34":"","35":"","36":"tigr87","37":"St0rytime","38":"Viissataa","39":"spiketeam","40":"TranmanWonder","41":"Juan_PH_16","42":"Viissataa","43":"fenikz13","44":"","45":"macandcheesezone","46":"phroureo","47":"amaROenuZ","48":"Retarded_Dylan","49":"","50":"Poopinontheshitter","51":"ExtremeReasonable670","52":"sauce-for-the-soul","53":"youngandconfused22","54":"benjamin-benjami","55":"Illustrious-Royal634","56":"","57":"my_password_is_me","58":"wvtarheel","59":"djred532","60":"xaichu","61":"Radagascar1","62":"TheBigD39","63":"Cloudkingxz","64":"krakenwrangler09","65":"BamboozledKoala420","66":"sonofdevito69","67":"delicinq1","68":"KillerKian","69":"Moonb1n","70":"PoliticalCub","71":"lj12394","72":"Medical_Caterpillar8","73":"Dspsblyuth","74":"spitonyourhands","75":"SweetumsTheMuppet","76":"Cloudkingxz"}}